{
    "version": "https://jsonfeed.org/version/1",
    "title": "Push | The Communication Protocol of Web3 Blog",
    "home_page_url": "https://push-protocol.github.io/push-website/pr-preview/pr-965/blog",
    "description": "Push | The Communication Protocol of Web3 Blog",
    "items": [
        {
            "id": "https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/innovations-by-push-chain",
            "content_html": "<p><img loading=\"lazy\" alt=\"Cover image of Innovations By Push Chain\" src=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/assets/images/cover-image-d4de94c63723c0248a825a015a1f2c78.webp\" width=\"1600\" height=\"900\" class=\"img_ev3q\"></p>\n<h2 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"introduction\">Introduction<a href=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/innovations-by-push-chain#introduction\" class=\"hash-link\" aria-label=\"Direct link to Introduction\" title=\"Direct link to Introduction\">​</a></h2>\n<p>Push recently unveiled its new layer 1 blockchain - Push Chain, a shared state blockchain designed for shared app experiences.</p>\n<p>Unlike traditional Layer 1 chains, Push Chain introduces ten key innovations and optimized mechanisms to unify any chain, any user, and any app.</p>\n<p>This article will help you understand:</p>\n<ul>\n<li>What innovations Push Chain brings to web3</li>\n<li>How Push Chain enables any user to connect to any app from any chain</li>\n<li>How Push Chain is positioned to onboard the first billion users to web3 (for real!)</li>\n</ul>\n<h3 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"tldr\">TLDR;<a href=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/innovations-by-push-chain#tldr\" class=\"hash-link\" aria-label=\"Direct link to TLDR;\" title=\"Direct link to TLDR;\">​</a></h3>\n<p><a href=\"https://push.org/chain/\" target=\"_blank\" rel=\"noopener noreferrer\">Push Chain</a> is a Proof of Stake shared state blockchain designed to support the development of hyper-scalable, consumer-centric, universal web3 applications by unifying settlement from any L1s, L2s and L3s.</p>\n<p><img loading=\"lazy\" alt=\"push architecture diagram\" src=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/assets/images/image1-f0449ab66b8b7f04df4944bab35b03ff.webp\" width=\"1600\" height=\"1432\" class=\"img_ev3q\"></p>\n<p>Key Innovations and Superpowers of Push Chain include:</p>\n<p>→ 1. <strong>Blockchain agnostic wallet addresses</strong></p>\n<p>→ 2. <strong>Support Txns from any chain</strong></p>\n<p>→ 3. <strong>Fee Abstraction</strong></p>\n<p>→ 4. <strong>Wallet abstractio</strong></p>\n<p>→ 5. <strong>Consumer (Unordered) and Traditional (Ordered) Transactions</strong></p>\n<p>→ 6. <strong>True Scale: Sub Second Finality (speed)</strong></p>\n<p>→ 7. <strong>True Scale: Parallel validators (scaling write throughput)</strong></p>\n<p>→ 8. <strong>True Scale: Dynamic Sharding (scaling read throughput)</strong></p>\n<p>→ 9. <strong>Push ID</strong></p>\n<p>→ 10. <strong>Universal Smart Contracts and Shared State</strong></p>\n<p>Let’s take a closer look at each of these innovations and enhancements</p>\n<h2 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"innovations-by-push-chain\">Innovations By Push Chain<a href=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/innovations-by-push-chain#innovations-by-push-chain\" class=\"hash-link\" aria-label=\"Direct link to Innovations By Push Chain\" title=\"Direct link to Innovations By Push Chain\">​</a></h2>\n<h3 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"1-blockchain-agnostic-wallet-addresses\">1. Blockchain agnostic wallet addresses<a href=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/innovations-by-push-chain#1-blockchain-agnostic-wallet-addresses\" class=\"hash-link\" aria-label=\"Direct link to 1. Blockchain agnostic wallet addresses\" title=\"Direct link to 1. Blockchain agnostic wallet addresses\">​</a></h3>\n<p>For Apps to support users from any chain and achieve <strong>universal compatibility</strong> - there must be a way to identify, interpret and transact with addresses incoming from various chains.</p>\n<p>As a shared-state blockchain, Push Chain is designed to parse and handle blockchain addresses alongside the specific chains they originate from.</p>\n<p>For instance, Push Chain can identify and support Solana, EVM, Cosmos and any other chain’s addresses.\nTo achieve this, Push Chain fully adopts <a href=\"https://github.com/ChainAgnostic/CAIPs/blob/main/CAIPs/caip-10.md\" target=\"_blank\" rel=\"noopener noreferrer\">CAIP-10</a> blockchain-agnostic wallet addresses, enabling it to deduce the chain, network, and address associated with each transaction ensuring universal compatibility across multiple blockchain ecosystems.</p>\n<h3 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"2-support-txns-from-any-chain\">2. Support Txns from any chain<a href=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/innovations-by-push-chain#2-support-txns-from-any-chain\" class=\"hash-link\" aria-label=\"Direct link to 2. Support Txns from any chain\" title=\"Direct link to 2. Support Txns from any chain\">​</a></h3>\n<p>In addition to parsing addresses across various chains, Push Chain supports transactions from any wallet, regardless of the originating chain—be it Ethereum, Solana, or any other network.</p>\n<p>Push Chain achieves this by accepting signed payload data and supporting the native signers of individual chains. Validator nodes then verify these signatures → conduct pre-transaction checks (such as fee validation) → and then admit the transactions to the network.</p>\n<p>To clarify, a user doesn’t have to “bridge” to another chain to use our platform. Instead, the app becomes universal and available to all users of any chain.</p>\n<p>Push Chain also introduces a new mechanism called <strong>Push ID</strong> to create a consistent and unified interface for users, no matter which wallet they use.</p>\n<p><strong><em>More on Push ID below...</em></strong></p>\n<h3 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"3-fee-abstraction\">3. Fee Abstraction<a href=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/innovations-by-push-chain#3-fee-abstraction\" class=\"hash-link\" aria-label=\"Direct link to 3. Fee Abstraction\" title=\"Direct link to 3. Fee Abstraction\">​</a></h3>\n<p>With web3’s progression towards true interoperability, the necessity to hold native tokens for basic interactions creates unnecessary barriers in what should be a borderless ecosystem.</p>\n<p><strong>Push Chain’s Fee Abstraction eliminates these digital borders, ensuring universal accessibility and removing the economic friction of owning native tokens for network fees.</strong></p>\n<ul>\n<li>\n<p><strong>Onchain Swappers</strong>: Fee contracts on every chain convert native tokens to cover fees automatically—no explicit swaps for Push Chain’s tokens are required.</p>\n</li>\n<li>\n<p><strong>Bulk Fee Payments</strong>: Lock and release fees in bulk, then send them to Push Chain directly in the transaction. This removes the bottleneck of waiting on a specific blockchain’s speed.</p>\n</li>\n<li>\n<p><strong>Delegated Fees</strong>: Wallets or web3 apps can cover fees, enabling a web2-like UX where the “website” pays for the user.</p>\n</li>\n</ul>\n<p>These mechanisms bridge web2 paradigms into web3 enabling web2 UX in a web3 world -</p>\n<ul>\n<li>\n<p><strong>Pay-for-content models</strong>: Apps like Facebook and Instagram cover user interaction fees.</p>\n</li>\n<li>\n<p><strong>Freemium models</strong>: Apps absorb user costs temporarily, enabling users to later pay in bulk for services after experiencing them for free (e.g., Spotify, Google Drive).</p>\n</li>\n</ul>\n<p>Push Chain makes these models possible, creating a frictionless experience and paving the way for building universal apps with borderless shared experiences.</p>\n<h3 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"4-wallet-abstraction\">4. Wallet abstraction<a href=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/innovations-by-push-chain#4-wallet-abstraction\" class=\"hash-link\" aria-label=\"Direct link to 4. Wallet abstraction\" title=\"Direct link to 4. Wallet abstraction\">​</a></h3>\n<p>At a higher level, there are two user personas in web3:</p>\n<ul>\n<li>\n<p><strong>Degens (aka existing web3 users)</strong> - Well accustomed to the fragmented UX, have app &amp; chain specific preferences for every on-chain activity.</p>\n</li>\n<li>\n<p><strong>Normies (aka new web3 users)</strong> - New or casual users unfamiliar with web3 complexities - Struggle with the manual and often complicated process of setting up a wallet.</p>\n</li>\n</ul>\n<p>With the rapid proliferation of L1s, L2s and L3s, the UX gap between Degens and Normies is widening, creating a disproportionate balance in user experiences.</p>\n<p><strong>Push Chain’s Wallet Abstraction diminishes this divide by creating a balanced ground for every web3 user persona.</strong></p>\n<p>Wallet abstraction provides a flexible, <strong>embeddable wallet experience</strong>, tailored to individual user journeys enabling any wallet from any chain to connect, interact and transact with Push Chain.</p>\n<p><strong>Existing Web3 Users?</strong></p>\n<p>Already using Ethereum, Solana, or another chain? Push Wallet lets you continue using your existing setup—no extra hoops. Combined with fee abstraction, transactions stay native to the source blockchain, making cross-chain use effortless.</p>\n<p><strong>New Web3 Users (Web2 Normies)?</strong></p>\n<p>Not web3-savvy? No problem. Just log in with an email or social account. Under the hood, the wallet uses sharding and pass keys to stay non-custodial but feels as simple and intuitive as web2.</p>\n<p><strong>For users logging in via email or social platforms</strong>, Push Chain ensures security and non-custodial functionality through key sharding. The user’s credentials are divided into three encrypted shards stored across the Push Backend (trusted), local storage (encrypted via a passkey), and Push Chain (also encrypted via a passkey). This approach allows key reconstruction only when accessed by the user, providing a secure yet user-friendly experience that bridges the gap between web2 familiarity and web3 security.</p>\n<h3 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"5-consumer-unordered-and-traditional-ordered-transactions\">5. Consumer (Unordered) and Traditional (Ordered) Transactions<a href=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/innovations-by-push-chain#5-consumer-unordered-and-traditional-ordered-transactions\" class=\"hash-link\" aria-label=\"Direct link to 5. Consumer (Unordered) and Traditional (Ordered) Transactions\" title=\"Direct link to 5. Consumer (Unordered) and Traditional (Ordered) Transactions\">​</a></h3>\n<p>Present web3 infra is heavily skewed towards financial apps that require strict ordering of transactions and precise state accuracy.\nHowever consumer apps, on the other hand, are inclined towards more flexible, faster and parallel transaction needs.\nConsumer apps are made of two primary elements where:</p>\n<ol>\n<li><em>Order is necessary (user payments, financial instruments) and</em></li>\n<li><em>Order is not critical (messages, comments or likes on a post, retweet, chat, email, gameplay, etc.).</em></li>\n</ol>\n<p>Traditional chains don’t provide the right experience for such use cases forcing consumer apps to make suboptimal compromises impacting their performance and usability.</p>\n<p><strong><em>Could there be a way of supporting consumer actions in an unordered, parallel and yet decentralised manner?</em></strong></p>\n<p>Absolutely yes! This is where <strong>Push Chain innovates a new transaction type - Consumer Transaction</strong>- which instantly unlocks non-financial, mixed-financial apps for web3 helping consumer apps reach faster PMF.</p>\n<p>Managing hyper-scalable apps with thousands of parallel transactions on-chain - is not easy.\nPush Chain makes it possible using its new innovation - <strong>True Scale</strong>.</p>\n<p>With True Scale, Push Chain's network capacity and its read-write throughput grow organically, as more nodes join its consensus.\nThis enables parallel execution of thousands of consumer transactions, near-instant finality and quicker information storage and retrieval.</p>\n<p>Here’s how the Push Chain achieves true scale.</p>\n<h3 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"6-true-scale-sub-second-finality-speed\">6. True Scale: Sub second finality (speed)<a href=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/innovations-by-push-chain#6-true-scale-sub-second-finality-speed\" class=\"hash-link\" aria-label=\"Direct link to 6. True Scale: Sub second finality (speed)\" title=\"Direct link to 6. True Scale: Sub second finality (speed)\">​</a></h3>\n<p>Push Chain splits the nodes into three types - <strong>Validator, Storage and Archival</strong> and enables a node governance smart contract that keeps track of all the nodes that are present in the network.</p>\n<ul>\n<li>\n<p><strong>Validator Nodes</strong> - Responsible for validating transactions.</p>\n</li>\n<li>\n<p><strong>Storage Nodes</strong> - Dynamically shard data based on the hash of blockchain-agnostic addresses and store it.</p>\n</li>\n<li>\n<p><strong>Archival Nodes</strong> - Maintain a full snapshot of all transactions on the network.</p>\n</li>\n</ul>\n<p>These role-specific nodes enable parallel validation to be done on any type of consumer transaction ensuring near-instant finality.</p>\n<p><strong>Note:</strong> All txs (write or read) are attested by random validators/storage nodes ensuring that malicious nodes result in slashing.</p>\n<p><strong>Node Registry Smart Contract:</strong> Push Chain employs a registry smart contract to register these nodes, manage dynamic sharding, set replication factors, and enable parallel validators that scale dynamically with the number of nodes in the network. This approach ensures linear scaling, allowing the network to handle increased read and write demands efficiently as it grows.</p>\n<p>Because of these different nodes and smart contract setting up parallel validators, the tx sent to the network can land on any of the <em>‘n’</em> number of parallel validators which are then instantly moved to processing (250ms block), this is what enables sub-second finality for Push Chain.</p>\n<h3 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"7-true-scale-parallel-validators-scaling-write-throughput\">7. True Scale: Parallel validators (scaling write throughput)<a href=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/innovations-by-push-chain#7-true-scale-parallel-validators-scaling-write-throughput\" class=\"hash-link\" aria-label=\"Direct link to 7. True Scale: Parallel validators (scaling write throughput)\" title=\"Direct link to 7. True Scale: Parallel validators (scaling write throughput)\">​</a></h3>\n<p>Push Chain achieves true scaling of write transactions, particularly for consumer transactions, where the consumer txs are packed in unordered blocks (or should we call them <strong>stateless blocks</strong>!? ).</p>\n<p>Allowing these transactions to be processed through any active validator node promises near-instant finality, and the write throughput (or TPS) of the chain increases linearly as the number of nodes in the network grows.</p>\n<h3 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"8-true-scale-dynamic-sharding-scaling-read-throughput\">8. True Scale: Dynamic Sharding (scaling read throughput)<a href=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/innovations-by-push-chain#8-true-scale-dynamic-sharding-scaling-read-throughput\" class=\"hash-link\" aria-label=\"Direct link to 8. True Scale: Dynamic Sharding (scaling read throughput)\" title=\"Direct link to 8. True Scale: Dynamic Sharding (scaling read throughput)\">​</a></h3>\n<p><strong>Push Chain achieves true scaling of reading transactions by implementing dynamic sharding on storage nodes.</strong></p>\n<p>Data chunks within each shard are mapped to blockchain-agnostic addresses and are dynamically redistributed as new storage nodes are added to the network.</p>\n<p>In addition, the chain introduces a node governing smart contract onto which each node (regardless of the type) is registered before getting admitted to the network. Since this node-registry smart contract knows the number of nodes in the network, it is able to dynamically shard and assign data chunks and replication factors ensuring the network is fast and becomes faster in retrieving data as new nodes are added.</p>\n<h3 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"9-push-id\">9. Push ID<a href=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/innovations-by-push-chain#9-push-id\" class=\"hash-link\" aria-label=\"Direct link to 9. Push ID\" title=\"Direct link to 9. Push ID\">​</a></h3>\n<p>In a universal chain like Push Chain - One essential element for bringing shared app experiences to users is the ability to track users’ on-chain identity - and not just their wallets.</p>\n<p>One user may have multiple wallets, spanning various chains and ecosystems whether EVM or nonEVM.\nThis led us to create the unified Push ID, giving each user one identity that spans all their wallets, both EVM and non-EVM. Instead of tying interactions strictly to a single wallet, transactions are now accredited to a user’s Push ID.</p>\n<p>The Push ID mapping allows for reverse lookups guaranteeing a consistent and unified interface for users, no matter which wallet they use. developers can fetch, index, and understand a user’s full spectrum of interactions across chains, all mapped to one identity.</p>\n<h3 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"10-shared-state-and-universal-smart-contracts\">10. Shared State and Universal Smart Contracts<a href=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/innovations-by-push-chain#10-shared-state-and-universal-smart-contracts\" class=\"hash-link\" aria-label=\"Direct link to 10. Shared State and Universal Smart Contracts\" title=\"Direct link to 10. Shared State and Universal Smart Contracts\">​</a></h3>\n<p><img loading=\"lazy\" alt=\"shared state diagram\" src=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/assets/images/image2-f0f9ca159f743240746e1fb8914950b4.webp\" width=\"1600\" height=\"1213\" class=\"img_ev3q\"></p>\n<p><strong>Shared State</strong></p>\n<p>With Push ID and Any Chain Tx, we realized that accessing a wallet’s state across different blockchains is a game changer.</p>\n<p>One thing that’s missing over here though was the ability to get the individual state of all the wallets which in essence will allow smart contracts to know the entire state of individual wallet(s) that are connected to the user. This feature is what we call a Shared state.</p>\n<p><strong>Shared state allows Push Chain to access data from its own chain as well as supported external chains!</strong></p>\n<p>With shared state, you can read wallet activities like NFTs, DeFi positions, governance participation, and so much more!</p>\n<p><strong>Universal Smart Contracts</strong></p>\n<p>A shared state chain is essential to enable shared app experiences. This chain must have the ability to read the state of wallets across other chains, facilitating universal smart contracts and creating an ecosystem where users from any chain—or even web2—can interact seamlessly. Such a chain would provide shared settlement across both EVM and non-EVM chains, ushering in an era of universal apps and shared experiences.</p>\n<p>Using shared state in VM, Push allows developers to write universal smart contracts with which universal app experiences become possible. Users, regardless of their origin—whether from any chain or ecosystem—can effortlessly interact with consumer apps that prioritize user engagement without regard to how or where they enter the system.</p>\n<p>Ultimately, <strong>Universal Smart Contracts and the ability to interact with all chains through Push Chain and represent our ultimate goal: Eliminating Web3 friction and delivering the best shared app experience possible.</strong></p>\n<h2 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"build-universal-apps\">Build Universal Apps!<a href=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/innovations-by-push-chain#build-universal-apps\" class=\"hash-link\" aria-label=\"Direct link to Build Universal Apps!\" title=\"Direct link to Build Universal Apps!\">​</a></h2>\n<p>Universal AI apps, Universal social apps, Unified Prediction markets and many more!\nWant to know the countless app innovations that you can make happen because of Push Chain?\nExplore our <a href=\"https://push.org/blog/consumer-apps-that-can-be-built-on-push-chain/\" target=\"_blank\" rel=\"noopener noreferrer\">Innovations that can be built on Push Chain Blog</a></p>\n<h3 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"next-steps\">Next Steps​👇<a href=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/innovations-by-push-chain#next-steps\" class=\"hash-link\" aria-label=\"Direct link to Next Steps​👇\" title=\"Direct link to Next Steps​👇\">​</a></h3>\n<ul>\n<li>\n<p>Check out the <a href=\"https://whitepaper.push.org/?utm_source=pushblog&amp;utm_medium=referral&amp;utm_campaign=pcgov\" target=\"_blank\" rel=\"noopener noreferrer\">Push Chain Whitepaper</a> for a detailed overview of the vision and the underlying technicalities.</p>\n</li>\n<li>\n<p>Visit the <a href=\"https://push.org/chain/?utm_source=pushblog&amp;utm_medium=referral&amp;utm_campaign=pcgov\" target=\"_blank\" rel=\"noopener noreferrer\">Push Chain Website</a> to find a one-pager explanation of the vision.</p>\n</li>\n<li>\n<p><a href=\"https://scan.push.org/home?utm_source=pushblog&amp;utm_medium=referral&amp;utm_campaign=pcgov\" target=\"_blank\" rel=\"noopener noreferrer\">Push Chain Devnet</a> is running live on Proof-of-Stake network validators, storage and archival nodes. The network already supports consumer transactions as well.</p>\n</li>\n<li>\n<p><a href=\"https://simulate.push.org/?utm_source=pushblog&amp;utm_medium=referral&amp;utm_campaign=pcgov\" target=\"_blank\" rel=\"noopener noreferrer\">Push Chain Simulate Tx</a> already provides a way for everyone to send tx from any chain using wallet abstraction.</p>\n</li>\n</ul>",
            "url": "https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/innovations-by-push-chain",
            "title": "Innovations by Push Chain",
            "summary": "Innovations by Push Chain",
            "date_modified": "2024-12-20T00:00:00.000Z",
            "author": {
                "name": "Push Protocol",
                "url": "https://twitter.com/pushprotocol"
            },
            "tags": [
                "Push Chain",
                "Shared App Experience",
                "Any Chain Tx",
                "Universal Smart Contracts",
                "Shared State Blockchain",
                "Consumer Tx",
                "Parallel Validators",
                "Dynamic Sharding"
            ]
        },
        {
            "id": "https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/evolution-of-push",
            "content_html": "<p><img loading=\"lazy\" alt=\"Cover Image of Evolution of Push\" src=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/assets/images/cover-image-a2b1ee18b9321f0e156cc7243df72278.webp\" width=\"1600\" height=\"900\" class=\"img_ev3q\"></p>\n<h2 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"summary\"><strong>Summary</strong><a href=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/evolution-of-push#summary\" class=\"hash-link\" aria-label=\"Direct link to summary\" title=\"Direct link to summary\">​</a></h2>\n<p>Push Protocol has come a long way! We’ve delivered over 140M notifications, built a community of 500K aggregate users, powered notifications for 500+ projects, and are known as the de facto leader in notifications and communications for web3.\nWe took the biggest and the most ambitious step in its history last week and have launched governance for its evolution to Push Chain, a shared state blockchain for building universal applications. It is a sharded Proof of Stake (PoS) chain built to allow developers to create user-centric app experiences and act as a shared settlement layer for multiple L1s, L2s, L3s.</p>\n<p>The journey often matters more than the destination, and we couldn’t agree more. From our beginnings at ETHGlobal 2020, to becoming an EF alumnus, ranking as a top 5 project in Gitcoin Grants, securing funding from leading VCs and angels, inventing the communication stack for web3, and now launching a consumer-centric L1 to unify web3 - each milestone has shaped our path and brought us here. Buckle up, it's time to reminisce!</p>\n<h2 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"the-beginning\">The Beginning<a href=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/evolution-of-push#the-beginning\" class=\"hash-link\" aria-label=\"Direct link to The Beginning\" title=\"Direct link to The Beginning\">​</a></h2>\n<h3 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"email-to-ethereum-foundation\">Email to Ethereum Foundation<a href=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/evolution-of-push#email-to-ethereum-foundation\" class=\"hash-link\" aria-label=\"Direct link to Email to Ethereum Foundation\" title=\"Direct link to Email to Ethereum Foundation\">​</a></h3>\n<p>We started with an idea for Push Protocol and web3. The thesis was that protocols in web3 only interact with wallet addresses and thus it made sense to build a notification and communication system that can inform these wallets.</p>\n<p>So the next time your DeFi loan is about to be liquidated, or a governance proposal comes up or your ENS is about to expire or someone comments on your web3 social, you get notified and can re-engage.</p>\n<p><img loading=\"lazy\" alt=\"First Image of Evolution of Push\" src=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/assets/images/image10-458216c30a6b7aca5a5d94ce1534f7dc.webp\" width=\"1412\" height=\"756\" class=\"img_ev3q\"></p>\n<h3 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"creating-mvp-at-ethglobal-hackmoney-2020\">Creating MVP at ETHGlobal HackMoney 2020<a href=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/evolution-of-push#creating-mvp-at-ethglobal-hackmoney-2020\" class=\"hash-link\" aria-label=\"Direct link to Creating MVP at ETHGlobal HackMoney 2020\" title=\"Direct link to Creating MVP at ETHGlobal HackMoney 2020\">​</a></h3>\n<p>We were guided by EF to go and build the project out first at ETHGlobal, which is what we did and was the best thing that ever happened for us. We have made friends that are mentors, friends that are our investors, friends that helped us connect to relevant projects and friends that geeked out together on tech.</p>\n<p>Excuse the video quality, I still hadn’t learned at this point what good quality cams or lighting could do.</p>\n<div class=\"SharedStyling__VideoContainer-sc-1enui31-32 gQKWwb\"><iframe width=\"100%\" height=\"100%\" style=\"border-radius:32px;aspect-ratio:56.25%\" src=\"https://www.youtube.com/embed/vvEpB3ddTko\" title=\"#HackMoney Group 1 Judging\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\"></iframe></div>\n<h3 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"getting-help-support-and-mentorship-from-ef\">Getting help, support and mentorship from EF<a href=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/evolution-of-push#getting-help-support-and-mentorship-from-ef\" class=\"hash-link\" aria-label=\"Direct link to Getting help, support and mentorship from EF\" title=\"Direct link to Getting help, support and mentorship from EF\">​</a></h3>\n<p>We have always said that Ethereum is where innovation has fostered traditionally and that is due to the community and the folks at Ethereum that go way beyond to help you in your journey.</p>\n<p>EF has helped us, like countless other projects in guiding through the tranches of web3, especially when you are just getting started.</p>\n<p><img loading=\"lazy\" alt=\"Second Image of Evolution of Push\" src=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/assets/images/image3-8279076011ac694e9a4985be9f60a0a4.webp\" width=\"1638\" height=\"1999\" class=\"img_ev3q\">\n</p><div class=\"SharedStyling__ImageText-sc-1enui31-28 iBTxGz\"><a href=\"https://blog.ethereum.org/2020/08/19/esp-beyond-grants\" target=\"_blank\" rel=\"noopener noreferrer\">https://blog.ethereum.org/2020/08/19/esp-beyond-grants</a></div><p></p>\n<h3 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"making-it-to-top-3-of-gitcoin-grants-round-7\">Making it to Top 3 of Gitcoin Grants (Round 7)<a href=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/evolution-of-push#making-it-to-top-3-of-gitcoin-grants-round-7\" class=\"hash-link\" aria-label=\"Direct link to Making it to Top 3 of Gitcoin Grants (Round 7)\" title=\"Direct link to Making it to Top 3 of Gitcoin Grants (Round 7)\">​</a></h3>\n<p>One of the best feelings we had was when we participated in Gitcoin Grants and the community came together to fund us out. This was in many ways the first check that we saw after we had started building Push (then EPNS).</p>\n<p>There’s serenity in making something that gets loved by the people for whom you are building and is the best feeling that any entrepreneur can have. To us, these 214 contributors is what made everything we had done so far worthwhile!</p>\n<p><img loading=\"lazy\" alt=\"Third Image of Evolution of Push\" src=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/assets/images/image8-26970ef357a1f818d9447a09899da975.webp\" width=\"1999\" height=\"1704\" class=\"img_ev3q\"></p>\n<p>Of course, the cherry on top was when Vitalik covered GR 7 in his <a href=\"https://vitalik.eth.limo/general/2020/10/18/round7.html\" target=\"_blank\" rel=\"noopener noreferrer\">blog</a>, and we among all the other top projects got a place in his blog, if not in his heart 😅.</p>\n<h3 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"getting-into-kernel-genesis-batch\">Getting into Kernel Genesis Batch<a href=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/evolution-of-push#getting-into-kernel-genesis-batch\" class=\"hash-link\" aria-label=\"Direct link to Getting into Kernel Genesis Batch\" title=\"Direct link to Getting into Kernel Genesis Batch\">​</a></h3>\n<p>Making it into Kernel was a dream come true. I still remember the joy I felt when we were selected. In our application form, there was a question: <b>What makes you special from any other project?</b> And what we wrote was <b>Every project that we have seen is special in its own ways, so nothing makes us special with respective to them but here’s why we feel we should be selected:</b> Technical and gap in communication, ux, etc</p>\n<p>We submitted this but then stressed out on if we were rude or missed the context of the question. Thankfully, Vivek, Sachin and team embraced our web3 vibe wholeheartedly.</p>\n<p><img loading=\"lazy\" alt=\"Fourth Image of Evolution of Push\" src=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/assets/images/image11-cce24a51c407e357b324d077a07141b1.webp\" width=\"1388\" height=\"1573\" class=\"img_ev3q\">\n</p><div class=\"SharedStyling__ImageText-sc-1enui31-28 iBTxGz\"><a href=\"https://x.com/harshrajat/status/1279398824729952257\" target=\"_blank\" rel=\"noopener noreferrer\">https://x.com/harshrajat/status/1279398824729952257</a></div><p></p>\n<p>This was also the place where we made so many friends that I still reach out to for help now. This was the place where I first dmed Jaun Bennett, Met Sandeep, Alok (Standard VC), Thomas Klaus and countless other folks that I look up to.</p>\n<p>This in a way completed our journey of getting onboarded to web3 as we were now part of the vibes!</p>\n<h3 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"making-awesome-friends-along-the-way\">Making awesome friends along the way!<a href=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/evolution-of-push#making-awesome-friends-along-the-way\" class=\"hash-link\" aria-label=\"Direct link to Making awesome friends along the way!\" title=\"Direct link to Making awesome friends along the way!\">​</a></h3>\n<p>During this entire journey, we made friends who just wanted to help and the only thing we had to do was ask, or tweet, or dm. This was and still is why Ethereum is always home for us!</p>\n<p><img loading=\"lazy\" alt=\"Fifth Image of Evolution of Push\" src=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/assets/images/image5-437f5cb65113d37d7bf641acc25c88d6.webp\" width=\"1388\" height=\"854\" class=\"img_ev3q\">\n</p><div class=\"SharedStyling__ImageText-sc-1enui31-28 iBTxGz\"><a href=\"https://x.com/owocki/status/1335637426392330241\" target=\"_blank\" rel=\"noopener noreferrer\">https://x.com/owocki/status/1335637426392330241</a></div><p></p>\n<p><img loading=\"lazy\" alt=\"Sixth Image of Evolution of Push\" src=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/assets/images/image4-34eb923e99adbd0c7c53d1d763102c41.webp\" width=\"1238\" height=\"706\" class=\"img_ev3q\">\n</p><div class=\"SharedStyling__ImageText-sc-1enui31-28 iBTxGz\"><a href=\"https://x.com/jason_chen998/status/1695082395505172944\" target=\"_blank\" rel=\"noopener noreferrer\">https://x.com/jason_chen998/status/1695082395505172944</a></div><p></p>\n<p><img loading=\"lazy\" alt=\"Seventh Image of Evolution of Push\" src=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/assets/images/image7-d923789161c8bfa74f1d949737b6ed07.webp\" width=\"1238\" height=\"890\" class=\"img_ev3q\">\n</p><div class=\"SharedStyling__ImageText-sc-1enui31-28 iBTxGz\"><a href=\"https://x.com/defiprime/status/1346124418192465928\" target=\"_blank\" rel=\"noopener noreferrer\">https://x.com/defiprime/status/1346124418192465928</a></div><p></p>\n<p>Push Protocol is the “Missing piece of Web3” that is required to bring the UX of Web2 to Web3.</p>\n<h2 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"the-start-of-web3-notifications\">The start of web3 notifications<a href=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/evolution-of-push#the-start-of-web3-notifications\" class=\"hash-link\" aria-label=\"Direct link to The start of web3 notifications\" title=\"Direct link to The start of web3 notifications\">​</a></h2>\n<h3 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"piloting-with-og-protocols\">Piloting with OG protocols<a href=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/evolution-of-push#piloting-with-og-protocols\" class=\"hash-link\" aria-label=\"Direct link to Piloting with OG protocols\" title=\"Direct link to Piloting with OG protocols\">​</a></h3>\n<p>The next phase of our journey was to start sending web3 notifications and we had a chicken and egg problem over here. Notifications are useful for wallets to show if popular protocols are sending them but for popular protocols to embrace web3 notifs, wallets need to integrate them 😱.</p>\n<p>We took a chance and reached out to some of the best and top protocols in the space back then, hint: they still are the leaders! They were the ones who helped us crack this chicken and egg problem and solidified our conviction on why web3 is the future - it’s because each one of them is trying to expand the boundaries of web3.</p>\n<p><img loading=\"lazy\" alt=\"Eigth Image of Evolution of Push\" src=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/assets/images/image9-143056c309dffe3ba02d82c7e9993c19.webp\" width=\"1388\" height=\"1062\" class=\"img_ev3q\">\n</p><div class=\"SharedStyling__ImageText-sc-1enui31-28 iBTxGz\"><a href=\"https://x.com/Uniswap/status/1377374973090689030\" target=\"_blank\" rel=\"noopener noreferrer\">https://x.com/Uniswap/status/1377374973090689030</a></div><p></p>\n<h3 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"getting-backed-by-people-we-adore\">Getting backed by people we adore<a href=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/evolution-of-push#getting-backed-by-people-we-adore\" class=\"hash-link\" aria-label=\"Direct link to Getting backed by people we adore\" title=\"Direct link to Getting backed by people we adore\">​</a></h3>\n<p>The momentum generated by Push till this point helped us get the attention of the best angels and VCs in the space. The success that we got due to the community, builders, web3 OGs coming and helping us together led us to secure our seed (and later series A) with folks that had some of the best mind share and vision for web3.</p>\n<p><img loading=\"lazy\" alt=\"Ninth Image of Evolution of Push\" src=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/assets/images/image12-855142e75f96a5d4b45e38ed9c619f8e.webp\" width=\"1999\" height=\"740\" class=\"img_ev3q\"></p>\n<p>♥️and shoutout to backers of Push Protocol including BalajiS, Sandeep Nailwal, Scott Moore, A.Capital, ParaFi, Binance Labs, Jump, Sino Global and so many more!</p>\n<h3 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"getting-noticed-and-spreading-the-word\">Getting noticed and spreading the word<a href=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/evolution-of-push#getting-noticed-and-spreading-the-word\" class=\"hash-link\" aria-label=\"Direct link to Getting noticed and spreading the word\" title=\"Direct link to Getting noticed and spreading the word\">​</a></h3>\n<p>Push started getting noticed by OGs of web3, we were so humbled by people who we view as mentors and thought leaders writing about us. Push has reached the point where it had a chance to terraform web3, one notif at a time</p>\n<p><img loading=\"lazy\" alt=\"Tenth Image of Evolution of Push\" src=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/assets/images/image1-001d961bb7b8213d6b45e5c533798da9.webp\" width=\"1600\" height=\"900\" class=\"img_ev3q\">\n</p><div class=\"SharedStyling__ImageText-sc-1enui31-28 iBTxGz\"><a href=\"https://balajis.com/p/why-india-should-buy-bitcoin\" target=\"_blank\" rel=\"noopener noreferrer\">Why India Should Buy Bitcoin Article by BalajiS</a>  |  <a href=\"https://x.com/balajis/status/1336367129960931329\" target=\"_blank\" rel=\"noopener noreferrer\">Excited to fund EPNS Tweet</a>  |  <a href=\"https://thedefiant.io/news/defi/unstoppable-domains-launches-token-gated-group-chats\" target=\"_blank\" rel=\"noopener noreferrer\">Unstoppable Domains Launches Gated Groups Article</a>  |  <a href=\"https://www.coindesk.com/business/2022/04/14/ethereum-push-notification-service-raises-10m-at-131m-valuation\" target=\"_blank\" rel=\"noopener noreferrer\">EPNS Raises 10M at 131M Valuation Article</a></div><p></p>\n<h2 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"building-one-of-the-first-consumer-app\">Building one of the first consumer app<a href=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/evolution-of-push#building-one-of-the-first-consumer-app\" class=\"hash-link\" aria-label=\"Direct link to Building one of the first consumer app\" title=\"Direct link to Building one of the first consumer app\">​</a></h2>\n<p>We now realize that apart from inventing the communication protocol for web3, we also were building one of the first consumer app for it which was non-financial in nature and was driven by the utility it offered to average user than the 10x other financial apps promised (and thus, user was incentivized to learn web3 broken ux).</p>\n<p>This realization helped us in paving forward an app that is useful and frictionless for the web3 user and enabled us to identify the features that we wanted as we moved towards decentralizing our notification nodes.</p>\n<h3 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"building-for-scalability-and-speed\">Building for scalability and speed<a href=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/evolution-of-push#building-for-scalability-and-speed\" class=\"hash-link\" aria-label=\"Direct link to Building for scalability and speed\" title=\"Direct link to Building for scalability and speed\">​</a></h3>\n<p>We realized very quickly that notification unlike traditional transactions needs to be scalable. It needed an infra that can scale up and maintain speed. To enable this, we built out a solution involving dynamic sharding, ensuring that the solution scales up as more notifications and wallets join in.</p>\n<h3 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"inventing-consumer-tx-by-accident\">Inventing consumer tx by accident!<a href=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/evolution-of-push#inventing-consumer-tx-by-accident\" class=\"hash-link\" aria-label=\"Direct link to Inventing consumer tx by accident!\" title=\"Direct link to Inventing consumer tx by accident!\">​</a></h3>\n<p>While building our notification nodes for write throughput, ie: handling tens of thousands of parallel notifications. We came up with the architecture of having parallel validators, since having order in notifications was not required.</p>\n<p>This paved the way for parallel validators where notifications can be sent to any validators which will then form stateless blocks (or unordered blocks). We didn’t know back then but we had unlocked a massive innovation in web3, having txs where ordering is not critical. This later formed the backbone of Push Chain’s speed and linear scalability.</p>\n<h3 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"building-for-seamless-web3-ux\">Building for seamless web3 UX<a href=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/evolution-of-push#building-for-seamless-web3-ux\" class=\"hash-link\" aria-label=\"Direct link to Building for seamless web3 UX\" title=\"Direct link to Building for seamless web3 UX\">​</a></h3>\n<p>Another thing that we wanted our notification protocol to have was a seamless onboarding process where the user can just sign in once and then, just like web2, they are not required to sign things again and again. Our Chat Protocol and PGP implementation helped us realize and solve for the most seamless web3 UX. Later on, this learning was transformed into wallet and fee abstraction for Push Chain.</p>\n<h3 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"building-for-unification-of-web3\">Building for unification of web3<a href=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/evolution-of-push#building-for-unification-of-web3\" class=\"hash-link\" aria-label=\"Direct link to Building for unification of web3\" title=\"Direct link to Building for unification of web3\">​</a></h3>\n<p>And finally, we wanted this to be the communication protocol of web3, where notifications and chat can come to Push as a universal hub. Where, protocols from Ethereum, Polygon, Solana, Aptos, or any other EVM or non-EVM are able to come together in a seamless interoperable way.</p>\n<p>This is not bridging, as bridging moves funds or assets from one chain to another. But, instead it’s unification or having a universal hub. A place where users from all chains come together. This feature is what was transformed to Push Chain as being the universal hub for all chains, where transactions from any chain are supported, where shared state of all wallets are available, where all L1s, L2s and L3s can come together and use Push as a shared settlement layer.</p>\n<h3 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"rebranding-to-become-the-communication-protocol-of-web3\">Rebranding to become the communication protocol of web3<a href=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/evolution-of-push#rebranding-to-become-the-communication-protocol-of-web3\" class=\"hash-link\" aria-label=\"Direct link to Rebranding to become the communication protocol of web3\" title=\"Direct link to Rebranding to become the communication protocol of web3\">​</a></h3>\n<p>We started building notifications for web3 under the brand of Ethereum Push Notification Service (EPNS) which made sense when we started since Apple also names their notification service as Apple Push Notification Service (APNS).</p>\n<p>But as we dived deep and started building the features for enabling notifications, chat. We quickly became aware that a non-Ethereum developer might be confused by the name EPNS. Thus, we decided to rebrand to Push, we picked this name because:</p>\n<ul>\n<li>We were now placed to become the communication protocol of web3, so <b>Ethereum</b> had to go from <b>Ethereum Push Notification Service</b>.</li>\n<li>We were not doing just notification, but instead had chat among other communication tools so <b>Notification</b> had to go from <b>Push Notification Service.</b></li>\n<li>And lastly, we were not a service but a decentralized protocol of web3, so <b>Service</b> had to go from <b>Push Service</b>.</li>\n<li>Leading us to rebrand to <b>Push</b>.</li>\n</ul>\n<p><img loading=\"lazy\" alt=\"Eleventh Image of Evolution of Push\" src=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/assets/images/image6-24b60aad49ba4a18828ebc1877062e25.webp\" width=\"1388\" height=\"1782\" class=\"img_ev3q\">\n</p><div class=\"SharedStyling__ImageText-sc-1enui31-28 iBTxGz\"><a href=\"https://x.com/pushprotocol/status/1574771582790406144\" target=\"_blank\" rel=\"noopener noreferrer\">https://x.com/pushprotocol/status/1574771582790406144</a></div><p></p>\n<h3 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"becoming-the-leading-notification-protocol-for-web3\">Becoming the leading notification protocol for web3<a href=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/evolution-of-push#becoming-the-leading-notification-protocol-for-web3\" class=\"hash-link\" aria-label=\"Direct link to Becoming the leading notification protocol for web3\" title=\"Direct link to Becoming the leading notification protocol for web3\">​</a></h3>\n<p>Push notifications protocol came a long way from its humble beginnings to now. Today, we have powered hundreds of millions of notifications sent to web3 users across the globe.</p>\n<p>We have been integrated natively in many wallets and protocols including Unstoppable, Shapeshift, Decentraland, Metamask Snap and so many more and have been powering notifications and communication for awesome protocols such as Cowswap, 1inch, dydx, hyperliquid, lens, polygon and various others.</p>\n<p><img loading=\"lazy\" alt=\"Twelfth Image of Evolution of Push\" src=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/assets/images/image2-904bacab17aabf8d20e05069e125be7f.webp\" width=\"1388\" height=\"1706\" class=\"img_ev3q\">\n</p><div class=\"SharedStyling__ImageText-sc-1enui31-28 iBTxGz\"><a href=\"https://x.com/hypurr_co/status/1851645401834959098?s=46&amp;t=iq2iJvugwsC0iZ3dI-wFOw\" target=\"_blank\" rel=\"noopener noreferrer\">https://x.com/hypurr_co/status/1851645401834959098?s=46&amp;t=iq2iJvugwsC0iZ3dI-wFOw</a></div><p></p>\n<h2 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"enters-push-chain---realization-of-what-we-actually-built-and-its-impact-on-web3\">Enters Push Chain - realization of what we actually built and it’s impact on web3<a href=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/evolution-of-push#enters-push-chain---realization-of-what-we-actually-built-and-its-impact-on-web3\" class=\"hash-link\" aria-label=\"Direct link to Enters Push Chain - realization of what we actually built and it’s impact on web3\" title=\"Direct link to Enters Push Chain - realization of what we actually built and it’s impact on web3\">​</a></h2>\n<h3 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"realization-of-the-end-game\">Realization of the end game<a href=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/evolution-of-push#realization-of-the-end-game\" class=\"hash-link\" aria-label=\"Direct link to Realization of the end game\" title=\"Direct link to Realization of the end game\">​</a></h3>\n<p>During building for our vision of the most perfect consumer app and the decentralized notification protocol and nodes out. We eventually realized that what we have built instead is far more significant and solves for the seamless web3 that we all dream of.</p>\n<p>This realization is what turned into our shared state blockchain - Push Chain, which while being an L1, is not just another L1 as it’s built to be used by users of any other chain without them needing to switch or bridge to this chain. It’s the future of web3 built for unification, consumer and universal apps and seamless onboarding.</p>\n<h3 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"launching-push-chain-proposal-and-devnet-\">Launching Push Chain proposal and Devnet 🚀<a href=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/evolution-of-push#launching-push-chain-proposal-and-devnet-\" class=\"hash-link\" aria-label=\"Direct link to Launching Push Chain proposal and Devnet 🚀\" title=\"Direct link to Launching Push Chain proposal and Devnet 🚀\">​</a></h3>\n<p>This has led us to launching our proposal of Push Chain, which just to recap is is a shared state L1 blockchain for shared app experiences. Push Chain enables txs from any chain (Solana, Eth, EVM, or non-EVM) with fast finality of &lt;1 second and can scale infinitely as nodes increase, supporting tens of thousands of parallel transactions.</p>\n<ul>\n<li>Push Chain introduces groundbreaking features including:</li>\n<li>Ability to do any chain tx</li>\n<li>Introduces a new tx type - Consumer transaction (order not important)</li>\n<li>Provides wallet and fee abstraction for a seamless user experience</li>\n<li>Enables true scale with parallel validators and dynamic sharding</li>\n<li>Able to do &lt;1 second finality</li>\n<li>Utilizes universal smart contracts - capable of accessing the state of a wallet belonging to a different chain</li>\n</ul>\n<p><img loading=\"lazy\" alt=\"Thirtheenth Image of Evolution of Push\" src=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/assets/images/image14-6eaaf73ecd74400dc1c897013ae507d0.webp\" width=\"1128\" height=\"1999\" class=\"img_ev3q\">\n</p><div class=\"SharedStyling__ImageText-sc-1enui31-28 iBTxGz\"><a href=\"https://x.com/pushprotocol/status/1867184458631405607\" target=\"_blank\" rel=\"noopener noreferrer\">https://x.com/pushprotocol/status/1867184458631405607</a></div><p></p>\n<p>The evolution and the journey has been thrilling and we would love to have you, our biggest asset, the community with us as we launch Push Chain and invite developers to build universal apps!</p>\n<p>As is the norm in web3, let’s end the article with saying in its truest sense for the future of Push - We all are just getting started!!!</p>",
            "url": "https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/evolution-of-push",
            "title": "Evolution of Push",
            "summary": "Evolution of Push",
            "date_modified": "2024-12-16T00:00:00.000Z",
            "author": {
                "name": "Richa Joshi",
                "url": "https://twitter.com/Riijo"
            },
            "tags": [
                "Push Chain",
                "Shared App Experience",
                "Shared State Blockchain"
            ]
        },
        {
            "id": "https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/consumer-apps-that-can-be-built-on-push-chain",
            "content_html": "<p><img loading=\"lazy\" alt=\"Cover Image of Consumer Apps 🫶🏽 Push Chain - Innovations that can be built on Push Chain\" src=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/assets/images/cover-image-9a8c3febf53dee1ded45bb38afdcd8a8.webp\" width=\"1600\" height=\"900\" class=\"img_ev3q\"></p>\n<p>Web 3 is growing at lightning speed!</p>\n<p>Hundreds of L1s, Thousands of L2s and soon Tens of thousands of L3s!!</p>\n<p>While striving to make systems more scalable, decentralized and secure, we risk overlooking a crucial goal - <strong>To expand the boundaries of web3 for all users.</strong></p>\n<p>And with increasing fragmentation coupled with complex pre-requisites to interact on-chain, inflexible infrastructure for consumer apps, and a lack of chain unification, the barrier to entry is rising, leading to the emergence of more closed and isolated systems.</p>\n<p>But not anymore.</p>\n<p><strong>Introducing Push Chain - A shared state blockchain for shared app experiences!</strong></p>\n<h2 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"what-is-push-chain\">What is Push Chain?<a href=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/consumer-apps-that-can-be-built-on-push-chain#what-is-push-chain\" class=\"hash-link\" aria-label=\"Direct link to What is Push Chain?\" title=\"Direct link to What is Push Chain?\">​</a></h2>\n<p>Push Chain is a Proof of Stake shared state blockchain designed to support the development of hyper-scalable, consumer-centric, universal web3 applications by unifying settlement from any L1s, L2s and L3s.</p>\n<h3 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"push-chain-superpowers-include\">Push Chain Superpowers Include:<a href=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/consumer-apps-that-can-be-built-on-push-chain#push-chain-superpowers-include\" class=\"hash-link\" aria-label=\"Direct link to Push Chain Superpowers Include:\" title=\"Direct link to Push Chain Superpowers Include:\">​</a></h3>\n<ul>\n<li><strong>Any Chain Tx (Solana, Eth, EVM, or non-EVM)</strong>⛓️&nbsp;:<!-- -->\n<ul>\n<li>Enables cross-chain transactions from EVM, Solana or any nonEVM by accepting signed payloads verified by Push validator nodes.</li>\n</ul>\n</li>\n<li><strong>Sub-second finality ⚡⏱️&nbsp;:</strong>\n<ul>\n<li>With parallel validators and parallel attestation.</li>\n</ul>\n</li>\n<li><strong>True Scale 🚀 :</strong>\n<ul>\n<li>Increases both read and write throughput as the number of nodes in the network grows.</li>\n</ul>\n</li>\n<li><strong>Fee Abstraction</strong>💰 :<!-- -->\n<ul>\n<li>Non-push chain wallets can seamlessly pay fees through native token swaps, delegation, web3 applications, or the traditional wallet-pays-fees model.</li>\n</ul>\n</li>\n<li><strong>Wallet Abstraction</strong>  🔐&nbsp;:<!-- -->\n<ul>\n<li>Simplify blockchain access by offering social logins, phone or email authentication, and secure recovery.</li>\n</ul>\n</li>\n<li><strong>Consumer tx (unordered) and Traditional tx (ordered)</strong> 🛍️:<!-- -->\n<ul>\n<li>Introduces <em>'consumer transactions'</em> for unordered, high-speed scalability, leveraging parallel execution, and dynamic sharding.</li>\n</ul>\n</li>\n<li><strong>Universal Smart Contract</strong> 🌐&nbsp;:<!-- -->\n<ul>\n<li>Smart contracts that can read the state of EVM or non-EVM wallets of other chains in the future, enabling developers to create a seamless universal app.</li>\n</ul>\n</li>\n<li><strong>Shared App Experience</strong> 🤝&nbsp;:<!-- -->\n<ul>\n<li>App experiences shared by all users of all chains</li>\n</ul>\n</li>\n</ul>\n<p><strong>Push Chain is purpose-built to power onchain AI</strong>, leveraging shared state, fast finality, dynamic sharding, and cross-chain compatibility. It supports scalable, versatile AI use cases and seamless consumer experiences, enabling AI agents, marketplaces and more, <em>check examples below.</em></p>\n<p><strong>We are building Push Chain with the vision of enabling users, irrespective of what blockchain they are on to seamlessly connect with web3 applications across any blockchain.</strong></p>\n<h2 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"push-chain-roadmap-phases-1-2-and-3\">Push Chain Roadmap: Phases 1, 2 and 3<a href=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/consumer-apps-that-can-be-built-on-push-chain#push-chain-roadmap-phases-1-2-and-3\" class=\"hash-link\" aria-label=\"Direct link to Push Chain Roadmap: Phases 1, 2 and 3\" title=\"Direct link to Push Chain Roadmap: Phases 1, 2 and 3\">​</a></h2>\n<p>Push Chain’s development follows a phased approach:</p>\n<ol>\n<li>\n<p><strong>Phase-1:</strong> Focuses on creating an infrastructure tailored for consumer-centric applications  — enables building true scale apps, supports transaction from any chain, vm for smarter / complex applications, consumer transaction (ordering is not important), fees abstraction - enabling fees from a chain of user choice or from web3 app, wallet abstraction - social login and login from any other chain.</p>\n</li>\n<li>\n<p><strong>Phase-2:</strong> Establishes seamless interoperability between blockchains, enabling instant cross-chain transactions and the transfer of value and smart contract calls. This phase introduces a solver network designed to enhance user experience by abstracting on-chain complexities by facilitating hyper-scalable and universal applications</p>\n</li>\n<li>\n<p><strong>Phase-3:</strong> Introduces Universal smart contract and shared state — enabling seamless cross-blockchain interactions and making other chain’s state accessible on Push Chain and unlocking the era of universal apps.</p>\n</li>\n</ol>\n<h2 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"push-chain-gives-you-a-billion-reasons-to-build\">Push Chain gives you a Billion Reasons to Build!<a href=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/consumer-apps-that-can-be-built-on-push-chain#push-chain-gives-you-a-billion-reasons-to-build\" class=\"hash-link\" aria-label=\"Direct link to Push Chain gives you a Billion Reasons to Build!\" title=\"Direct link to Push Chain gives you a Billion Reasons to Build!\">​</a></h2>\n<p>Push Chain is your go-to chain for building universal mixed apps!</p>\n<p>Here’s a brief glimpse of the future of web3 and the countless innovations that you can make happen because of Push Chain.</p>\n<h3 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"universal-ai-apps\">→Universal AI Apps:<a href=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/consumer-apps-that-can-be-built-on-push-chain#universal-ai-apps\" class=\"hash-link\" aria-label=\"Direct link to →Universal AI Apps:\" title=\"Direct link to →Universal AI Apps:\">​</a></h3>\n<p>Build on-chain Ai agents and platforms that are not bound to any single-chain and operate across chains autonomously using Push Chain’s shared state and Universal Smart Contract capabilies.</p>\n<p>Examples include:</p>\n<p><strong>→ Unified Data Layers for AI Agents:</strong></p>\n<ul>\n<li>Ai agents often need to access, analyze, and react to a large variety of onchain and offchain data.</li>\n<li>Using Push Chain's unified user identity (<strong>Push ID</strong>), AI agents can retrieve a user's aggregated state from multiple chains—assets, past activities, communication history, and more.</li>\n</ul>\n<p><strong>→ Chain Agnostic Autonomous Actions:</strong></p>\n<ul>\n<li>Using interoperability and knowledge of multiple user wallets across chains, an AI agent could rebalance a user's DeFi positions on Ethereum, list NFTs on Polygon, and communicate status updates to the user via a messaging app on another chain, all through one unified settlement layer.</li>\n</ul>\n<p><strong>→ Universal AI Launchpads</strong> 🚀</p>\n<ul>\n<li>One unified platform to launch agents across any chain</li>\n<li>Universal payment acceptance (any token from any chain)</li>\n<li>Can be scaled to support thousands of concurrent agent operations</li>\n</ul>\n<hr>\n<h3 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"universal-social-apps\"><strong>Universal Social Apps</strong><a href=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/consumer-apps-that-can-be-built-on-push-chain#universal-social-apps\" class=\"hash-link\" aria-label=\"Direct link to universal-social-apps\" title=\"Direct link to universal-social-apps\">​</a></h3>\n<p>Push Chain’s scalability as well as fee and wallet abstraction make it ideal for building decentralized social platforms.</p>\n<ul>\n<li><strong>Unifies all on-chain users</strong> (quite literally) spread across all chains into one shared layer.</li>\n<li><strong>Leverage Push Chain’s sub second finality</strong> to build next-generation social apps such as social investing platforms (e.g., GoFundMe or grants), decentralized alternatives to Reddit, Telegram, or TikTok, and other social networks.</li>\n<li><strong>Enable</strong> <strong>Core social app features</strong> - replies, likes, and user connections using  unordered transactions (consumer transactions).</li>\n<li><strong>Using PushID</strong> - A Polygon wallet can communicate and interact with a Solana Wallet, all under one shared state!</li>\n<li>Enable Login with any wallet or Web2 credentials (session keys)</li>\n<li><strong>Social Rewards Apps</strong>: Create apps where users earn rewards for engagement, such as likes, shares, or creating valuable content.</li>\n</ul>\n<hr>\n<h3 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"universal-prediction-markets-️\"><strong>Universal Prediction Markets</strong> ⚖️<a href=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/consumer-apps-that-can-be-built-on-push-chain#universal-prediction-markets-%EF%B8%8F\" class=\"hash-link\" aria-label=\"Direct link to universal-prediction-markets-️\" title=\"Direct link to universal-prediction-markets-️\">​</a></h3>\n<p>Prediction markets like <a href=\"https://polymarket.com/\" target=\"_blank\" rel=\"noopener noreferrer\">Polymarket</a> (native to Polygon only)- have already achieved mainstream PMF. Take it a step further and build cross-chain  Prediction markets where:</p>\n<ul>\n<li>Markets aggregate liquidity from all chains simultaneously</li>\n<li>Users participate from any wallet (ETH, SOL, etc.) without manually bridging!</li>\n<li>Fee abstraction allows platforms to cover gas costs for users.</li>\n</ul>\n<hr>\n<h3 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"universal-gaming\">Universal Gaming<a href=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/consumer-apps-that-can-be-built-on-push-chain#universal-gaming\" class=\"hash-link\" aria-label=\"Direct link to Universal Gaming\" title=\"Direct link to Universal Gaming\">​</a></h3>\n<p>Push Chain lets gaming and degen apps break free from single-chain silos.</p>\n<ul>\n<li>Build cross chain games with Push Chain to bring players from different chains together for unified tournaments or gaming sessions.</li>\n<li>Examples include poker platforms, slot games, sports betting, fantasy sports, shared lottery systems like PoolTogether, trading card platforms, and gacha games.</li>\n</ul>\n<hr>\n<h3 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"universal--defi-\">Universal  DeFi :<a href=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/consumer-apps-that-can-be-built-on-push-chain#universal--defi-\" class=\"hash-link\" aria-label=\"Direct link to Universal  DeFi :\" title=\"Direct link to Universal  DeFi :\">​</a></h3>\n<p>While Push Chain isn’t solely focused on DeFi, it supports <strong>financial applications</strong> with universal capabilities:</p>\n<ul>\n<li><strong>Unified DEXes: Enable smooth exchanges and transfers across chains.</strong>  tokens and stablecoins from any chain can be utilized to create a seamless decentralized exchange (DEX)</li>\n<li><strong>Unified Lending - Borrow Apps</strong>. Users from any chain can lend and borrow, addressing fragmented liquidity and enabling applications that act as universal liquidity hubs—taking liquidity from one chain and providing it to another.</li>\n<li><strong>Global Payment Systems</strong>: Build payment gateways where users can transact with minimal fees using tokens from any blockchain</li>\n</ul>\n<h3 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"cross-chain-analytics-and-portfolio-management\"><strong>Cross-Chain Analytics and Portfolio Management</strong><a href=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/consumer-apps-that-can-be-built-on-push-chain#cross-chain-analytics-and-portfolio-management\" class=\"hash-link\" aria-label=\"Direct link to cross-chain-analytics-and-portfolio-management\" title=\"Direct link to cross-chain-analytics-and-portfolio-management\">​</a></h3>\n<p>Leveraging Push Chain’s interoperability and shared state build powerful <strong>analytics and management tools</strong>:</p>\n<ul>\n<li><strong>Web3 Portfolios</strong>. By mapping wallets through Push ID and leveraging seamless interoperability, web3 portfolios can track balances, NFT collections, and DeFi positions and assets across multiple chains, providing users with a unified view of their holdings.</li>\n<li><strong>Analytics and Recommendations</strong>: Build analytics platforms that provide insights into user’s on-chain user behaviour, enabling personalized recommendations or investment advice.</li>\n<li><strong>Cross-Chain Governance Dashboards</strong>: Aggregate DAO governance activities across chains, providing users with a unified voting and proposal management system.</li>\n<li><strong>Universal Web3 Analytics and Recommendation.</strong> Enable analytics to track user activity and capabilities, unlocking recommendation engines, AI based decision engines, targeted promotions, and other innovative features</li>\n</ul>\n<h3 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"utility-and-productivity-applications\"><strong>Utility and Productivity Applications:</strong><a href=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/consumer-apps-that-can-be-built-on-push-chain#utility-and-productivity-applications\" class=\"hash-link\" aria-label=\"Direct link to utility-and-productivity-applications\" title=\"Direct link to utility-and-productivity-applications\">​</a></h3>\n<p>Build  <strong>utility applications with Push Chain</strong> that simplify and enhance everyday tasks:</p>\n<ul>\n<li><strong>Decentralized Email and Messaging</strong>: Build secure, blockchain-based email services where users communicate using their wallet addresses or Push IDs.</li>\n<li><strong>Web3 Blogging and Content Platforms</strong>: Create decentralized blogging platforms where users can publish, share, and monetize content without relying on centralized hosts.</li>\n<li><strong>Data Storage and Retrieval</strong>: Build applications for storing user settings, metadata, or application states, enabling decentralized profiles and preferences.</li>\n<li><strong>Utility Apps with Universal Reach.</strong> These applications thrive on combining user bases from all blockchains. Examples include email services, notifications and chat platforms, blogging tools, decentralized wikis, and internet archives. These apps benefit from a unified web3 user base, making Push Chain the perfect environment for their growth.</li>\n</ul>\n<hr>\n<h3 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"education-and-training-platforms\"><strong>Education and Training Platforms</strong><a href=\"https://push.org/blog/consumer-apps-that-can-be-built-on-push-chain/#education-and-training-platforms\" target=\"_blank\" rel=\"noopener noreferrer\"></a><a href=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/consumer-apps-that-can-be-built-on-push-chain#education-and-training-platforms\" class=\"hash-link\" aria-label=\"Direct link to education-and-training-platforms\" title=\"Direct link to education-and-training-platforms\">​</a></h3>\n<p>Push Chain supports&nbsp;<strong>decentralized education platforms</strong>&nbsp;that enhance learning experiences.</p>\n<ul>\n<li><strong>Credential Management</strong>: Verify and share academic achievements securely on the blockchain.</li>\n<li><strong>Incentivized Learning Platforms</strong>: Reward users with tokens for completing courses or achieving milestones.</li>\n<li><strong>Decentralized Knowledge Sharing</strong>: Develop platforms where users can share and monetize expertise in a peer-to-peer manner.</li>\n</ul>\n<hr>\n<p>These ideas are just the tip of the iceberg - we're merely scratching the surface!\nPush Chain gives you a <strong>Billion Reasons to Build</strong> Any App <em>for</em> Any User <em>on</em> Any Chain.</p>\n<p>Already have an idea to build? Want guidance to make it happen?</p>\n<p>Reach out to us on our <a href=\"https://discord.com/invite/pushprotocol\" target=\"_blank\" rel=\"noopener noreferrer\">Push Discord Community</a></p>\n<h2 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"so-whats-next\">So What’s next?<a href=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/consumer-apps-that-can-be-built-on-push-chain#so-whats-next\" class=\"hash-link\" aria-label=\"Direct link to So What’s next?\" title=\"Direct link to So What’s next?\">​</a></h2>\n<ol>\n<li><strong>Check out the <a href=\"https://whitepaper.push.org/?utm_source=pushblog&amp;utm_medium=referral&amp;utm_campaign=pcgov\" target=\"_blank\" rel=\"noopener noreferrer\">Push Chain Whitepaper</a></strong> for a detailed overview of the vision and the underlying technicalities.</li>\n<li>Visit the <a href=\"https://push.org/chain?utm_source=pushblog&amp;utm_medium=referral&amp;utm_campaign=pcgov\" target=\"_blank\" rel=\"noopener noreferrer\">Push Chain Website</a> to find a one-pager explanation of the vision.</li>\n<li><a href=\"https://scan.push.org/?utm_source=pushblog&amp;utm_medium=referral&amp;utm_campaign=pcgov\" target=\"_blank\" rel=\"noopener noreferrer\">Push Chain Devnet</a> is running live on Proof-of-Stake network validators, storage and archival nodes. The network already supports consumer transactions as well.</li>\n<li><a href=\"https://simulate.push.org/?utm_source=pushblog&amp;utm_medium=referral&amp;utm_campaign=pcgov\" target=\"_blank\" rel=\"noopener noreferrer\">Push Chain Simulate Tx</a> already provides a way for everyone to send tx from any chain using wallet abstraction.</li>\n</ol>",
            "url": "https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/consumer-apps-that-can-be-built-on-push-chain",
            "title": "Consumer Apps 🫶🏽 Push Chain - Innovations that can be built on Push Chain",
            "summary": "Consumer Apps 🫶🏽 Push Chain - Innovations that can be built on Push Chain",
            "date_modified": "2024-12-09T00:00:00.000Z",
            "author": {
                "name": "Push Protocol",
                "url": "https://twitter.com/pushprotocol"
            },
            "tags": [
                "Push Chain",
                "Consumer Apps",
                "Universal Apps",
                "Shared App Experience"
            ]
        },
        {
            "id": "https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/faq-push-chain",
            "content_html": "<p><img loading=\"lazy\" alt=\"Cover Image of Push Chain’s Frequently Asked Questions\" src=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/assets/images/cover-image-cd2255df54913750cccc2fe1014061eb.webp\" width=\"1600\" height=\"900\" class=\"img_ev3q\"></p>\n<h2 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"frequently-asked-questions\">Frequently Asked Questions<a href=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/faq-push-chain#frequently-asked-questions\" class=\"hash-link\" aria-label=\"Direct link to Frequently Asked Questions\" title=\"Direct link to Frequently Asked Questions\">​</a></h2>\n<p>The place to find answers to all the popular questions the community has asked about Push Chain. Crowdsourced from Push Fam 🫶 and curated by the Push team 💪.</p>\n<h2 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"overview\">Overview<a href=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/faq-push-chain#overview\" class=\"hash-link\" aria-label=\"Direct link to Overview\" title=\"Direct link to Overview\">​</a></h2>\n<hr>\n<h3 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"what-is-push-chain\">What is Push Chain?<a href=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/faq-push-chain#what-is-push-chain\" class=\"hash-link\" aria-label=\"Direct link to What is Push Chain?\" title=\"Direct link to What is Push Chain?\">​</a></h3>\n<p>Push Chain is a shared state blockchain for universal applications. It is designed to allow <strong>transactions from any chain</strong> (ETH, Solana, EVM, non-EVM), has <strong>&lt;1s fast finality</strong> and has <strong>true scalability</strong> (read and write throughput increases as the number of nodes increases).</p>\n<p>It introduces some ground breaking innovations such as <strong>consumer txs</strong> (order not important), <strong>parallel validators and dynamic sharding</strong> and <strong>universal smart contracts</strong>. The result is a layer 1 with the ability to become a shared settlement layer for all L1s 🤝 L2s 🤝 L3.</p>\n<hr>\n<h3 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"how-does-push-chain-work\">How does Push Chain work?<a href=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/faq-push-chain#how-does-push-chain-work\" class=\"hash-link\" aria-label=\"Direct link to How does Push Chain work?\" title=\"Direct link to How does Push Chain work?\">​</a></h3>\n<p><img loading=\"lazy\" alt=\"Push Chain Architecture\" src=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/assets/images/pcoverview-ef4ca9321077a31148211c9aec3f84c2.webp\" title=\"Push Chain Architecture\" width=\"1600\" height=\"1432\" class=\"img_ev3q\"></p>\n<p>Push Chain is a sharded, Proof-of-Stake (PoS) blockchain that features different types of nodes—validators, storage nodes, and archival nodes—each optimized for specific roles and responsibilities to ensure high efficiency. This design gives the chain fast finality of less than one second.</p>\n<p>In brief, <strong>Validator</strong> nodes handle the role of writing transactions and are able to do so in parallel. <strong>Storage</strong> nodes, which are dynamically sharded, fetch transactions from the network. And <strong>Archival</strong> nodes provide a complete snapshot of the blockchain.</p>\n<p>Push Chain also introduces several key innovations in web3. At launch, these include <strong>consumer transactions</strong> (these are txs where order is not critical), <strong>Push ID</strong>, which maps multiple EVM and non-EVM accounts and <strong>wallet and fees abstraction</strong>.</p>\n<p>In later phases, Push Chain will introduce <strong>shared state</strong> and <strong>universal smart contracts</strong>. These features will enable smart contracts on Push Chain to access the state of both EVM and non-EVM wallets connected to a single user.</p>\n<p>The result is <strong>universal applications</strong> for web3. In this paradigm, instead of being a user of \"Uniswap on Ethereum,\" \"Uniswap on Polygon,\" or \"Uniswap on Arbitrum,\" a person simply becomes a <strong>user of Uniswap</strong>.</p>\n<p>These innovations make Push Chain suitable for creating new experiences or cross-deploying existing consumer-centric apps tied to specific blockchains, making them accessible to any web3 user.</p>\n<hr>\n<h3 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"why-is-push-chain-unique-for-users\">Why is Push Chain unique for users?<a href=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/faq-push-chain#why-is-push-chain-unique-for-users\" class=\"hash-link\" aria-label=\"Direct link to Why is Push Chain unique for users?\" title=\"Direct link to Why is Push Chain unique for users?\">​</a></h3>\n<p>Push Chain addresses specific gaps in the existing blockchains, such as interoperability, shared app experiences, enabling new app experiences, and scalability. While existing blockchains are robust, they operate in their own eco-system and an aggregator to unite these chains are needed.</p>\n<p>Push Chain’s focus is on being a <strong>shared state chain</strong> for universal applications acting as a unifying layer where all chains can come together and use PC as universal hub or do settlement between them.</p>\n<p>PC offers a new paradigm of web3 that works from <strong>any chain.</strong> for <strong>any user.</strong> and is suitable for <strong>any app.</strong></p>\n<hr>\n<h3 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"what-are-the-core-innovations-of-push-chain\">What are the core innovations of Push Chain?<a href=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/faq-push-chain#what-are-the-core-innovations-of-push-chain\" class=\"hash-link\" aria-label=\"Direct link to What are the core innovations of Push Chain?\" title=\"Direct link to What are the core innovations of Push Chain?\">​</a></h3>\n<p><strong>Any Chain Txs and Blockchain Agnostic Wallet Addresses</strong></p>\n<p>As a shared-state blockchain, Push Chain adopts <strong>CAIP-10 standards</strong> (shoutout to <a href=\"https://x.com/pedrouid\" target=\"_blank\" rel=\"noopener noreferrer\" title=\"Follow Pedrouid on X\">@pedrouid</a>, allowing it to parse the chain, network, and address of each transaction. This ensures true interoperability across multiple blockchain ecosystems.</p>\n<p><strong>Consumer Txs (unordered) and Traditional Txs (ordered)</strong></p>\n<p>Push introduces a new type of transaction that we define as <strong>consumer transactions</strong>.</p>\n<p>When you look at consumer apps of web2, you quickly notice that they are made of two components:</p>\n<ol>\n<li><strong>Transactions where order is necessary</strong> (e.g., user payments, financial instruments).</li>\n<li><strong>Transactions where order is not critical</strong> (e.g., messages, comments or likes on a post, retweets, chats, emails, gameplay, etc.).</li>\n</ol>\n<p>These unordered actions dominate consumer apps, but traditional chains don’t provide the right experience for them.</p>\n<p>Push Chain introduces <strong>unordered transactions</strong>, where order is not critical. These transactions can be sent to any of the validators running on the network to be processed.</p>\n<p>This innovation will have a significant impact on web3, enabling consumer apps that combine financial, mixed-financial, and non-financial transactions with the same scalability and speed seen in web2.</p>\n<p><strong>Parallel Validators &amp; Dynamic Sharding</strong></p>\n<p>Push Chain uses a <strong>node governor smart contract</strong>, which registers all the different types of nodes. This governor contract not only registers nodes but also keeps track of the number of validator, storage, and archival nodes.</p>\n<ul>\n<li>It adjusts the replication factor.</li>\n<li>Assigns address chunks to shards.</li>\n<li>Enables parallel validators to process transactions, allowing the chain to scale linearly with the number of nodes added to the network.</li>\n</ul>\n<p>This approach achieves <strong>true scale</strong>.</p>\n<p><strong>Wallet and Fee Abstraction</strong></p>\n<p><strong>Wallet abstraction</strong> provides a flexible, embeddable wallet experience, tailored to individual user journeys while preserving decentralization. This abstraction simplifies the user experience (UX) for both existing and new web3 users.</p>\n<p><strong>For Existing Web3 Users</strong></p>\n<ul>\n<li>If you're already using Ethereum, Solana, or another chain, the <strong>Push Chain wallet</strong> allows you to continue using your current setup—no extra hoops.</li>\n<li>Combined with <strong>fee abstraction</strong>, transactions stay native to the source blockchain, making cross-chain use effortless.</li>\n</ul>\n<p><strong>For New Web3 Users (Web2 Normies)</strong></p>\n<ul>\n<li>Not web3-savvy? No problem. Just log in with an email or social account.</li>\n<li>Under the hood, the wallet uses sharding and passkeys to stay non-custodial but feels as simple and intuitive as web2.</li>\n</ul>\n<p><strong>Shared State and Universal Smart Contracts</strong></p>\n<p>With <strong>Push ID</strong>, the state of a non-Push wallet and multiple wallets across any chain is mapped to a single user. This ensures that the user's state across all blockchains is known.</p>\n<p>Combining this capability with <strong>universal smart contracts</strong> unlocks innovations that web3 hasn’t seen before, enabling the era of universal apps.</p>\n<hr>\n<h3 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"what-problems-does-push-chain-solve\">What problems does Push Chain solve?<a href=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/faq-push-chain#what-problems-does-push-chain-solve\" class=\"hash-link\" aria-label=\"Direct link to What problems does Push Chain solve?\" title=\"Direct link to What problems does Push Chain solve?\">​</a></h3>\n<ul>\n<li><strong>Fragmentation:</strong> Unifies app experiences across blockchains, bridging EVM and non-EVM ecosystems.</li>\n<li><strong>Scalability:</strong> Achieves true scaling through dynamic sharding, stateless blocks, and parallel block execution.</li>\n<li><strong>Interoperability:</strong> Supports transactions from any blockchain, enabling shared app states.</li>\n<li><strong>Finality:</strong> Near-instant finality (~1-2 seconds), essential for real-time app experiences.</li>\n<li><strong>User Experience:</strong> Simplifies onboarding and interaction via derived keys and unified user identities (Push ID / DID).</li>\n<li><strong>Universal Apps:</strong> Enables applications to be built that can be accessed by any user from any chain instantly.</li>\n</ul>\n<hr>\n<h3 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"what-are-the-different-phases-of-push-chain\">What are the different phases of Push Chain?<a href=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/faq-push-chain#what-are-the-different-phases-of-push-chain\" class=\"hash-link\" aria-label=\"Direct link to What are the different phases of Push Chain?\" title=\"Direct link to What are the different phases of Push Chain?\">​</a></h3>\n<p>Phase 1 lays the groundwork of building universal consumer apps focusing on introducing a scalable, chain agnostic, and unified layer capable of handling any types of consumer apps including financial but also non-financial and mixed-financial apps. The features in this phase include:</p>\n<ul>\n<li>Enabling true scale apps</li>\n<li>Allowing transactions from any chain</li>\n<li>Introducing Consumer transactions (where ordering is not important)</li>\n<li>Push VM for complex on-chain applications</li>\n<li>Fee abstraction</li>\n<li>Wallet abstraction</li>\n<li>Push ID to map multiple EVM and non-EVM wallet to a single identity</li>\n<li>Enabling PoS (Proof of Stake) with dynamic sharding and parallel validators</li>\n</ul>\n<p>Phase 2 centers on facilitating seamless interoperability between chains which is a stepping stone in enabling universal smart contracts to usher in universal apps.\nThis phase introduces a solver network capable of instant cross-chain transactions, both financial and non-financial based. The non-financial distinction is crucial as it enables all payloads to move instantly between Push-connected chains, benefiting consumer applications like:</p>\n<ul>\n<li>Social media</li>\n<li>Marketplaces</li>\n<li>Gaming</li>\n<li>Other consumer-facing use cases</li>\n</ul>\n<p>Phase 3 is about introducing shared state and the launch of universal smart contracts, enabling true shared state and universal apps.</p>\n<hr>\n<h2 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"technical\">Technical<a href=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/faq-push-chain#technical\" class=\"hash-link\" aria-label=\"Direct link to Technical\" title=\"Direct link to Technical\">​</a></h2>\n<h3 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"why-does-push-chain-need-to-be-an-l1-instead-of-an-l2-chain\">Why does Push Chain need to be an L1 instead of an L2 chain?<a href=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/faq-push-chain#why-does-push-chain-need-to-be-an-l1-instead-of-an-l2-chain\" class=\"hash-link\" aria-label=\"Direct link to Why does Push Chain need to be an L1 instead of an L2 chain?\" title=\"Direct link to Why does Push Chain need to be an L1 instead of an L2 chain?\">​</a></h3>\n<p>Push Chain is purpose-built to be a shared-state blockchain for universal, on-chain apps. To achieve this in practice, Push Chain functions as a settlement layer (L1) for multiple L1s, L2s, and L3s.</p>\n<p>This architecture enables it to accept transactions from any chain, reduce cross-chain friction through gas abstraction, and provide wallet abstraction for seamless onboarding—whether users are web3 veterans or newcomers.</p>\n<hr>\n<h3 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"is-push-chain-evm-compatible\">Is Push Chain EVM Compatible?<a href=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/faq-push-chain#is-push-chain-evm-compatible\" class=\"hash-link\" aria-label=\"Direct link to Is Push Chain EVM Compatible?\" title=\"Direct link to Is Push Chain EVM Compatible?\">​</a></h3>\n<p>Push Chain begins as EVM compatible and becomes more and more compatible with further chains as it evolves. Further information can be found in both the Push Chain <a href=\"https://whitepaper.push.org/\" target=\"_blank\" rel=\"noopener noreferrer\" title=\"Whitepaper of Push Chain\">whitepaper</a>.</p>\n<hr>\n<h3 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"will-push-chain-be-compatible-with-both-evm-and-non-evm-chains\">Will Push Chain be compatible with both EVM and non-EVM chains?<a href=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/faq-push-chain#will-push-chain-be-compatible-with-both-evm-and-non-evm-chains\" class=\"hash-link\" aria-label=\"Direct link to Will Push Chain be compatible with both EVM and non-EVM chains?\" title=\"Direct link to Will Push Chain be compatible with both EVM and non-EVM chains?\">​</a></h3>\n<p>Yes, Push Chain is designed to support both EVM and non-EVM chains, ensuring maximum interoperability.</p>\n<hr>\n<h3 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"why-create-a-new-blockchain-when-existing-ones-like-ethereum-and-solana-already-exist\">Why create a new blockchain when existing ones like Ethereum and Solana already exist?<a href=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/faq-push-chain#why-create-a-new-blockchain-when-existing-ones-like-ethereum-and-solana-already-exist\" class=\"hash-link\" aria-label=\"Direct link to Why create a new blockchain when existing ones like Ethereum and Solana already exist?\" title=\"Direct link to Why create a new blockchain when existing ones like Ethereum and Solana already exist?\">​</a></h3>\n<p>Push Chain addresses pervasive gaps in the existing blockchains; specifically interoperability, shared app experiences, and scalability. While existing blockchains are robust, they operate in silos and lack the ability to unify state across multiple blockchains. Push Chain’s focus is on being a <strong>shared state chain for universal applications</strong>, offering seamless cross-chain interactions and unparalleled scalability.</p>\n<hr>\n<h3 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"what-does-shared-state-blockchain-mean\">What does shared state blockchain mean?<a href=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/faq-push-chain#what-does-shared-state-blockchain-mean\" class=\"hash-link\" aria-label=\"Direct link to What does shared state blockchain mean?\" title=\"Direct link to What does shared state blockchain mean?\">​</a></h3>\n<p>Shared state refers to the present status of onchain data. A shared-state blockchain is one that has read-and-write access to its own state and the state of all other chains it interacts with. A shared state chain is capable of handling data, liquidity, and users from any other chain.</p>\n<hr>\n<h3 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"what-sets-push-chain-apart-from-other-shared-state-chains\">What sets Push Chain apart from other shared state chains?<a href=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/faq-push-chain#what-sets-push-chain-apart-from-other-shared-state-chains\" class=\"hash-link\" aria-label=\"Direct link to What sets Push Chain apart from other shared state chains?\" title=\"Direct link to What sets Push Chain apart from other shared state chains?\">​</a></h3>\n<ul>\n<li><strong>True Scalability:</strong> Parallel execution, dynamic sharding, and stateless blocks.</li>\n<li><strong>Interoperability:</strong> Seamless integration with EVM and non-EVM chains.</li>\n<li><strong>User-Centric Design:</strong> Derived keys and Push DID for enhanced user experiences.</li>\n</ul>\n<hr>\n<h3 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"how-does-push-chain-achieve-shared-state\">How does Push Chain achieve shared state?<a href=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/faq-push-chain#how-does-push-chain-achieve-shared-state\" class=\"hash-link\" aria-label=\"Direct link to How does Push Chain achieve shared state?\" title=\"Direct link to How does Push Chain achieve shared state?\">​</a></h3>\n<p>The term shared state means that Push Chain not only has read and write access to its own state but also has read-only access to all the other supported chains’ states. This is the final and most imperative phase of Push Chain, and it enables <strong>universal apps</strong> that seamlessly function across multiple chains.</p>\n<p><img loading=\"lazy\" alt=\"Push Chain Universal App\" src=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/assets/images/pcuniversalapp-b1592bc5a870b8a52a544d01c1702efe.webp\" title=\"Push Chain - Shared State Chain for Universal Apps\" width=\"1600\" height=\"1213\" class=\"img_ev3q\"></p>\n<p>Push Chain achieves shared state by leveraging Push ID, which maps multiple EVM and non-EVM wallets to a single identity. This allows for a single user to have a single state across all chains, enabling true shared state.</p>\n<p>The whole vision of universal apps with shared states is achieved through 4 core features:</p>\n<ul>\n<li>\n<p><strong>Fee and Wallet Abstraction:</strong>\nWith wallet abstraction, Push Chain aims to enable seamless user onboarding without going through the manual and complicated procedure of setting up a web3 wallet.\nWith fee abstraction, the chain eliminates the friction of requiring to hold native gas strictly in the wallet in use.</p>\n</li>\n<li>\n<p><strong>Seamless Interoperability:</strong>\nWith Phase 2 of its roadmap, the chain aims to establish seamless interoperability between chains to enable cross-chain features in the apps.</p>\n<p>The interoperability will be enabled using a solver network capable of instant cross-chain transactions to ensure better UX. The network will be designed to move not only value but also arbitrary payloads that seamlessly transfer smart contract calls to other chains.</p>\n</li>\n<li>\n<p><strong>Any Chain Transaction:</strong>\nWith fee abstraction layer and interoperability, the chain is then able to provide the capability for users and apps on this chain to seamlessly initiate transactions for any chain.</p>\n</li>\n<li>\n<p><strong>Unified VM:</strong>\nA unified VM that enables complex universal smart contract logic that is able to execute cross chain actions.</p>\n</li>\n</ul>\n<p>Combining these 4 main pillars, the chain aims to achieve shared app experiences and unlock a plethora of new cross-chain and universal app use cases in every domain of web3.</p>\n<hr>\n<h3 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"what-does-true-scale-mean\">What does true scale mean?<a href=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/faq-push-chain#what-does-true-scale-mean\" class=\"hash-link\" aria-label=\"Direct link to What does true scale mean?\" title=\"Direct link to What does true scale mean?\">​</a></h3>\n<p>True scale is the ability of a protocol's ecosystem to grow at both the infrastructure and user experience levels. Push Chain achieves this by enabling universal applications that users can try without worrying about complex infrastructure decisions.</p>\n<hr>\n<h2 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"token-related\">Token Related<a href=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/faq-push-chain#token-related\" class=\"hash-link\" aria-label=\"Direct link to Token Related\" title=\"Direct link to Token Related\">​</a></h2>\n<h3 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"will-there-be-a-new-token-associated-with-push-chain\">Will there be a new token associated with Push Chain?<a href=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/faq-push-chain#will-there-be-a-new-token-associated-with-push-chain\" class=\"hash-link\" aria-label=\"Direct link to Will there be a new token associated with Push Chain?\" title=\"Direct link to Will there be a new token associated with Push Chain?\">​</a></h3>\n<p>As a new layer 1, Push Chain would have its own native token with tokenomics suited to the functioning, maintenance, and security of a blockchain.</p>\n<p>The governance proposal for Push Chain introduces the layer 1 as a potential direction for the Push ecosystem. If approved, Push would then introduce tokenomics for feedback and discussion among the community.</p>\n<p>Push Chain would need a new token because an L1 token has a fundamentally different design and purpose than a token designed to incentivize the notifications protocol. A priority for Push Chain tokenomics is to ensure that all Push Protocol $PUSH holders are able to migrate their tokens to the Push Chain native token (ticker TBD).</p>\n<p><strong>Note: Push Chain mainnet is not live, nor is any token related to Push Chain besides Push Protocol <a href=\"https://coinmarketcap.com/currencies/epns/\" target=\"_blank\" rel=\"noopener noreferrer\" title=\"$PUSH on CMC\">$PUSH</a>.</strong> Any communication about Push Chain will come directly from the Push company website and X / Twitter handle.</p>\n<hr>\n<h2 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"doubts\">Doubts<a href=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/faq-push-chain#doubts\" class=\"hash-link\" aria-label=\"Direct link to Doubts\" title=\"Direct link to Doubts\">​</a></h2>\n<h3 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"what-happens-to-push-notification-and-push-chat\">What Happens to Push Notification and Push Chat?<a href=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/faq-push-chain#what-happens-to-push-notification-and-push-chat\" class=\"hash-link\" aria-label=\"Direct link to What Happens to Push Notification and Push Chat?\" title=\"Direct link to What Happens to Push Notification and Push Chat?\">​</a></h3>\n<p>Push Chain is a natural evolution of Push Protocol's vision. Current services of Push Protocol remain a priority, ensuring they continue to improve while benefiting from the new infrastructure.</p>\n<p>Today's push notification and chat protocols will benefit significantly from being built on top of Push Chain. A dedicated section of the team will focus on maintaining and enhancing these protocols, ensuring they remain the de-facto standard in their respective domains.</p>\n<p>By aligning with Push Chain, notifications and chat sent through the protocols will be processed as transactions on the chain. This integration not only enables these protocols to accrue value but also marks the beginning of a new chapter in their evolution, further enhancing their utility and impact within the web3 ecosystem.</p>\n<hr>\n<h3 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"is-this-project-a-distraction-from-improving-current-services\">Is this project a distraction from improving current services?<a href=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/faq-push-chain#is-this-project-a-distraction-from-improving-current-services\" class=\"hash-link\" aria-label=\"Direct link to Is this project a distraction from improving current services?\" title=\"Direct link to Is this project a distraction from improving current services?\">​</a></h3>\n<p>No, read ☝️ <a href=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/faq-push-chain#what-happens-to-push-notification-and-push-chat\">above</a>.</p>\n<hr>\n<h3 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"is-push-chain-a-shift-away-from-push-protocols-core-focus-on-notifications-and-chat\">Is Push Chain a shift away from Push Protocol's core focus on notifications and chat?<a href=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/faq-push-chain#is-push-chain-a-shift-away-from-push-protocols-core-focus-on-notifications-and-chat\" class=\"hash-link\" aria-label=\"Direct link to Is Push Chain a shift away from Push Protocol's core focus on notifications and chat?\" title=\"Direct link to Is Push Chain a shift away from Push Protocol's core focus on notifications and chat?\">​</a></h3>\n<p>No. Push Chain builds upon Push Protocol’s established foundation. Push Chain represents the <strong>next evolution</strong> of Push Protocol, not a departure.</p>\n<hr>\n<h3 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"how-will-the-launch-of-push-chain-affect-existing-partnerships-and-integrations\">How will the launch of Push Chain affect existing partnerships and integrations?<a href=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/faq-push-chain#how-will-the-launch-of-push-chain-affect-existing-partnerships-and-integrations\" class=\"hash-link\" aria-label=\"Direct link to How will the launch of Push Chain affect existing partnerships and integrations?\" title=\"Direct link to How will the launch of Push Chain affect existing partnerships and integrations?\">​</a></h3>\n<p>Push Chain complements existing partnerships by offering additional capabilities like cross-chain support, faster finality, and scalable solutions. It strengthens collaborations by enabling partners to build and scale universal applications.</p>\n<hr>\n<h3 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"how-will-push-chain-maintain-decentralization-while-scaling\">How will Push Chain maintain decentralization while scaling?<a href=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/faq-push-chain#how-will-push-chain-maintain-decentralization-while-scaling\" class=\"hash-link\" aria-label=\"Direct link to How will Push Chain maintain decentralization while scaling?\" title=\"Direct link to How will Push Chain maintain decentralization while scaling?\">​</a></h3>\n<p>Dynamic sharding and parallel execution enable scalability without compromising decentralization.</p>\n<hr>\n<h3 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"are-there-any-risks-of-centralization-with-push-chain\">Are there any risks of centralization with Push Chain?<a href=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/faq-push-chain#are-there-any-risks-of-centralization-with-push-chain\" class=\"hash-link\" aria-label=\"Direct link to Are there any risks of centralization with Push Chain?\" title=\"Direct link to Are there any risks of centralization with Push Chain?\">​</a></h3>\n<p><strong>No.</strong> Push Chain’s architecture emphasizes decentralization:</p>\n<ul>\n<li>Validators, storagea and archivals nodes operate independently and are incentivized and penalized through PoS. The network is designed to be robust and resilient. Our whitepaper has more details on the network design and the decentralization mechanisms used to protect and secure the network, see <a href=\"https://whitepaper.push.org/\" target=\"_blank\" rel=\"noopener noreferrer\" title=\"Handling Malicious Validators and Storage Nodes in Push Chain\">whitepaper point 7.1 (Handling Malicious Validators) and 7.2 (Handling Malicious Storage Nodes)</a>. Governance and DAO also add a layer of decentralization to the network.</li>\n</ul>\n<hr>\n<h2 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"dao-and-grants\">DAO and Grants<a href=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/faq-push-chain#dao-and-grants\" class=\"hash-link\" aria-label=\"Direct link to DAO and Grants\" title=\"Direct link to DAO and Grants\">​</a></h2>\n<h3 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"how-will-the-current-governance-system-change-when-the-new-token-launches-and-when-the-migration-is-completed\">How will the current governance system change when the new token launches and when the migration is completed?<a href=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/faq-push-chain#how-will-the-current-governance-system-change-when-the-new-token-launches-and-when-the-migration-is-completed\" class=\"hash-link\" aria-label=\"Direct link to How will the current governance system change when the new token launches and when the migration is completed?\" title=\"Direct link to How will the current governance system change when the new token launches and when the migration is completed?\">​</a></h3>\n<p>The Push DAO governance system will both evolve and expand as Push Chain launches. This is an expected process, since Push is becoming something more encompassing than the original Push Protocol. Delegates, ambassador programs, subDAOs, and everything else related to the DAO will be upgraded to reflect the key goals of achieving status as the hub for universal applications, run by all of the groups that make them possible.</p>\n<h3 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"how-do-i-get-involved-with-push-chain-grants\">How do I get involved with Push Chain Grants?<a href=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/faq-push-chain#how-do-i-get-involved-with-push-chain-grants\" class=\"hash-link\" aria-label=\"Direct link to How do I get involved with Push Chain Grants?\" title=\"Direct link to How do I get involved with Push Chain Grants?\">​</a></h3>\n<p>While we are thrilled with the early interest coming from developers to build universal apps, we are still in the governance phase for ratifying our evolution from Push Protocol to Push Chain and hence do not have a grants program now.</p>\n<p>This will change very soon once the community approves of Push Chain! Meanwhile, to frontrun other grantees, please drop us an email at <a href=\"mailto:team@push.org\"></a><a href=\"mailto:team@push.org\" target=\"_blank\" rel=\"noopener noreferrer\">team@push.org</a> with the subject line as <strong>Grant MEOW</strong> and your app idea. Or, simply follow <a href=\"https://x.com/pushprotocol\" target=\"_blank\" rel=\"noopener noreferrer\" title=\"Follow Push Protocol on X\">@pushprotocol</a> for more updates around the grants program and its release.</p>\n<hr>\n<h2 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"developers-users-and-node-operators\">Developers, Users and Node Operators<a href=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/faq-push-chain#developers-users-and-node-operators\" class=\"hash-link\" aria-label=\"Direct link to Developers, Users and Node Operators\" title=\"Direct link to Developers, Users and Node Operators\">​</a></h2>\n<h3 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"is-there-a-migration-plan-for-current-applications-and-users\">Is there a migration plan for current applications and users?<a href=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/faq-push-chain#is-there-a-migration-plan-for-current-applications-and-users\" class=\"hash-link\" aria-label=\"Direct link to Is there a migration plan for current applications and users?\" title=\"Direct link to Is there a migration plan for current applications and users?\">​</a></h3>\n<p>The current Push Protocol application will stay fully functional for all its applications, integrations, and users. Eventually, Push Protocol notifications and chat will migrate to Push Chain as one of the first universal applications live on the new layer 1.</p>\n<p>At that time, we will help apps and users using Push Protocol to migrate. However, for the time being, no migration plan is required for current applications and users.</p>\n<hr>\n<h3 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"are-there-incentives-for-early-adopters-or-node-operators-on-push-chain\">Are there incentives for early adopters or node operators on Push Chain?<a href=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/faq-push-chain#are-there-incentives-for-early-adopters-or-node-operators-on-push-chain\" class=\"hash-link\" aria-label=\"Direct link to Are there incentives for early adopters or node operators on Push Chain?\" title=\"Direct link to Are there incentives for early adopters or node operators on Push Chain?\">​</a></h3>\n<p>Validators and relayers will earn staking rewards. Early adopters and existing Push Protocol $PUSH holders will be eligible for a token migration from the original $PUSH to the Push Chain token (ticker TBD).</p>\n<hr>\n<h3 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"what-benefits-does-push-chain-offer-to-developers-and-users\">What benefits does Push Chain offer to developers and users?<a href=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/faq-push-chain#what-benefits-does-push-chain-offer-to-developers-and-users\" class=\"hash-link\" aria-label=\"Direct link to What benefits does Push Chain offer to developers and users?\" title=\"Direct link to What benefits does Push Chain offer to developers and users?\">​</a></h3>\n<ul>\n<li><strong>For Developers:</strong>: A unified platform for cross-chain app development, scalability, and easy onboarding. Push Chain lets developers build applications that can be used by any users on any chain.</li>\n</ul>\n<p><strong>For Users</strong>: Simplified interactions, seamless onboarding with derived keys, and faster transactions with 1-2s finality.</p>\n<hr>\n<h3 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"how-can-developers-start-building-on-push-chain\">How can developers start building on Push Chain?<a href=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/faq-push-chain#how-can-developers-start-building-on-push-chain\" class=\"hash-link\" aria-label=\"Direct link to How can developers start building on Push Chain?\" title=\"Direct link to How can developers start building on Push Chain?\">​</a></h3>\n<p>Push Chain will offer developer tools, an SDK, and comprehensive documentation. Keep tabs on our site and our main social handles for all related updates. Sign up to our email on <a title=\"Push Chain Email Signup\" href=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/chain/\">/chain</a> to stay up to date with available resources.</p>\n<h3 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"where-can-i-find-more-information-and-stay-updated-on-push-chains-progress\">Where can I find more information and stay updated on Push Chain's progress?<a href=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/faq-push-chain#where-can-i-find-more-information-and-stay-updated-on-push-chains-progress\" class=\"hash-link\" aria-label=\"Direct link to Where can I find more information and stay updated on Push Chain's progress?\" title=\"Direct link to Where can I find more information and stay updated on Push Chain's progress?\">​</a></h3>\n<p>The best way to stay on top of Push Chain’s progress is through the official Push channels: website, <a href=\"https://x.com/pushprotocol\" target=\"_blank\" rel=\"noopener noreferrer\" title=\"Push Protocol on X\">Twitter/X</a>, <a href=\"https://t.me/epnsproject\" target=\"_blank\" rel=\"noopener noreferrer\" title=\"Push Protocol on Telegram\">Telegram</a>, and <a href=\"https://discord.gg/pushprotocol\" target=\"_blank\" rel=\"noopener noreferrer\" title=\"Push Protocol on Discord\">Discord</a>.</p>\n<p>Always remain cautious of phishing links, websites or any scam links asking you for your crypto. All official communications will go out from our official Push handles.</p>",
            "url": "https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/faq-push-chain",
            "title": "Push Chain’s Frequently Asked Questions",
            "summary": "Push Chain’s Frequently Asked Questions",
            "date_modified": "2024-12-09T00:00:00.000Z",
            "author": {
                "name": "Push Protocol",
                "url": "https://twitter.com/pushprotocol"
            },
            "tags": [
                "Push Chain",
                "Push Chain FAQs"
            ]
        },
        {
            "id": "https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/parallel-validators-and-dynamic-sharding",
            "content_html": "<p><img loading=\"lazy\" alt=\"Cover Image of Benchmarking Push Chain : Scaling with Validator Nodes\" src=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/assets/images/cover-image-6113608a2ad3b73e9016d5eb7c399257.webp\" width=\"1600\" height=\"900\" class=\"img_ev3q\"></p>\n<h2 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"introduction\">Introduction<a href=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/parallel-validators-and-dynamic-sharding#introduction\" class=\"hash-link\" aria-label=\"Direct link to Introduction\" title=\"Direct link to Introduction\">​</a></h2>\n<p>The Push Chain Network, a Proof-of-Stake (PoS) blockchain designed for consumer-centric applications, offers an innovative approach to scalability and usability in the decentralized space. By leveraging features like dynamic sharding, parallel block execution, and true scale, Push Chain promises a seamless environment for universal applications. This blog explores the benchmarking results of Push Chain under varying node configurations, providing insights into how the network behaves and scales as the number of nodes increases.</p>\n<hr>\n<h2 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"node-types-and-roles\">Node Types and Roles<a href=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/parallel-validators-and-dynamic-sharding#node-types-and-roles\" class=\"hash-link\" aria-label=\"Direct link to Node Types and Roles\" title=\"Direct link to Node Types and Roles\">​</a></h2>\n<ul>\n<li><strong>Validator Nodes:</strong> Responsible for handling transaction validation and serving as the primary interface for client interactions.</li>\n<li><strong>Storage Nodes:</strong> Tasked with storing validated transactions in a sharded manner for optimized data access and storage efficiency.</li>\n<li><strong>Archival Nodes:</strong> Maintain a comprehensive record of all network transactions, enabling historical data access and providing support for applications like blockchain explorers.</li>\n</ul>\n<blockquote>\n<p>💡 Note: While the roles described above provide a high-level overview, nodes in the Push Chain Network perform significantly more complex tasks, including dynamic sharding, transaction propagation, and ensuring data consistency across the network.</p>\n</blockquote>\n<hr>\n<h2 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"benchmarking-setup\">Benchmarking Setup<a href=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/parallel-validators-and-dynamic-sharding#benchmarking-setup\" class=\"hash-link\" aria-label=\"Direct link to Benchmarking Setup\" title=\"Direct link to Benchmarking Setup\">​</a></h2>\n<p>The benchmarking tests were conducted in controlled environments with different node configurations:</p>\n<h3 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"environment-configurations\">Environment Configurations<a href=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/parallel-validators-and-dynamic-sharding#environment-configurations\" class=\"hash-link\" aria-label=\"Direct link to Environment Configurations\" title=\"Direct link to Environment Configurations\">​</a></h3>\n<ol>\n<li><strong>Configuration 1</strong>:<!-- -->\n<ul>\n<li><strong>5 Validator Nodes</strong>, <strong>8 Storage Nodes</strong>, <strong>5 Archival Nodes</strong>.</li>\n<li><strong>2 CPU cores</strong> allocated.</li>\n</ul>\n</li>\n<li><strong>Configuration 2</strong>:<!-- -->\n<ul>\n<li><strong>10 Validator Nodes</strong>, <strong>8 Storage Nodes</strong>, <strong>5 Archival Nodes</strong>.</li>\n<li><strong>4 CPU cores</strong> allocated.</li>\n</ul>\n</li>\n<li><strong>Configuration 3</strong>:<!-- -->\n<ul>\n<li><strong>20 Validator Nodes</strong>, <strong>8 Storage Nodes</strong>, <strong>5 Archival Nodes</strong>.</li>\n<li><strong>8 CPU cores</strong> allocated.</li>\n</ul>\n</li>\n</ol>\n<p>The benchmarks primarily evaluate the performance of the <strong>validator nodes</strong>, which serve as the gateway for client interactions. However, since validator nodes interact with storage nodes and archival nodes internally, the results effectively reflect the performance of the entire network.</p>\n<blockquote>\n<p>⚡ <strong>Note on</strong> <strong>Controlled Environment:</strong> All of these benchmarks were performed in a controlled internal network environment. As a result, any network lags or latency typically observed in real-world public networks were kept to a minimum, ensuring that the results reflect the network’s inherent capabilities rather than external factors. This setup allows for more accurate measurement of the Push Chain Network’s performance under varying configurations without the interference of significant network delays.</p>\n</blockquote>\n<blockquote>\n<p>📊 <strong>Note on CPU Scaling:</strong> In order to simulate a decentralized network more realistically, the number of CPU cores allocated scales proportionally with the number of nodes. For instance, 2 CPU cores are allocated for 5 validator nodes, 4 CPU cores for 10 nodes, and 8 CPU cores for 20 nodes. This approach mirrors how resources would likely be distributed in a decentralized system, where each node operator contributes computational resources to the network.</p>\n</blockquote>\n<blockquote>\n<p>⚙️ <strong>Note on Node Configuration:</strong> For simplicity and consistency, the number of <strong>Storage Nodes</strong> and <strong>Archival Nodes</strong> is kept constant at <strong>8</strong> and <strong>5</strong>, respectively, across all configurations. This ensures that the focus remains on evaluating the performance of the <strong>Validator Nodes</strong> and their interactions with the network, without introducing additional variables.</p>\n</blockquote>\n<p>The benchmarks primarily evaluate the performance of the <strong>validator nodes</strong>, which serve as the gateway for client interactions. However, since validator nodes interact with storage nodes and archival nodes internally, the results effectively reflect the performance of the entire network.</p>\n<hr>\n<h2 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"benchmark-results\">Benchmark Results<a href=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/parallel-validators-and-dynamic-sharding#benchmark-results\" class=\"hash-link\" aria-label=\"Direct link to Benchmark Results\" title=\"Direct link to Benchmark Results\">​</a></h2>\n<p>The following tests were conducted to measure the performance of the Push Chain Network under varying configurations, focusing on the behavior of <strong>validator nodes</strong> as the number of nodes increases. Each test was performed using multiple parallel threads, simulating real-world scenarios where multiple users interact with the network simultaneously.</p>\n<h3 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"1-ping-validator-test\">1. Ping Validator Test<a href=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/parallel-validators-and-dynamic-sharding#1-ping-validator-test\" class=\"hash-link\" aria-label=\"Direct link to 1. Ping Validator Test\" title=\"Direct link to 1. Ping Validator Test\">​</a></h3>\n<p>This test measures the round-trip time taken by multiple threads to select and ping a random validator node, simulating basic connectivity under increasing load.</p>\n<table><thead><tr><th><strong>Threads</strong></th><th><strong>Configuration 1</strong></th><th><strong>Configuration 2</strong></th><th><strong>Configuration 3</strong></th></tr></thead><tbody><tr><td>10</td><td>21.72 ms</td><td>27.96 ms</td><td>26.43 ms</td></tr><tr><td>50</td><td>296.98 ms</td><td>94.45 ms</td><td>124.54 ms</td></tr><tr><td>100</td><td>371.32 ms</td><td>137.20 ms</td><td>151.44 ms</td></tr><tr><td>250</td><td>396.70 ms</td><td>232.06 ms</td><td>209.23 ms</td></tr><tr><td>500</td><td>497.69 ms</td><td>342.74 ms</td><td>287.24 ms</td></tr><tr><td>1000</td><td>785.19 ms</td><td>705.11 ms</td><td>545.10 ms</td></tr><tr><td>2000</td><td>1498.14 ms</td><td>1245.16 ms</td><td>1085.70 ms</td></tr><tr><td>5000</td><td>5608.33 ms</td><td>3637.42 ms</td><td>3297.24 ms</td></tr><tr><td>10000</td><td><strong>Errored Out</strong></td><td><strong>Errored Out</strong></td><td><strong>Errored Out</strong></td></tr></tbody></table>\n<p><strong>Observations:</strong></p>\n<ul>\n<li>As the number of validator nodes increases, the network handles higher traffic more efficiently, as seen in <strong>Configuration 3</strong>, which consistently shows the lowest response times across all thread counts.</li>\n<li>Traffic is split among more validator nodes in configurations with higher node counts, reducing the load on individual nodes and improving overall response times.</li>\n<li>At <strong>10,000 threads</strong>, all configurations errored out, indicating the upper limit of the network under the current setup. However, <strong>Configuration 3</strong> demonstrated the highest capacity before encountering errors, highlighting the benefits of increased validator nodes for scalability.</li>\n</ul>\n<h3 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"2-get-token-validator-test\">2. Get Token Validator Test<a href=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/parallel-validators-and-dynamic-sharding#2-get-token-validator-test\" class=\"hash-link\" aria-label=\"Direct link to 2. Get Token Validator Test\" title=\"Direct link to 2. Get Token Validator Test\">​</a></h3>\n<p>This test measures the time taken for multiple threads to request an access token from a random validator node. Access tokens are essential for sending transactions and performing other write operations on the network.</p>\n<table><thead><tr><th><strong>Threads</strong></th><th><strong>Configuration 1</strong></th><th><strong>Configuration 2</strong></th><th><strong>Configuration 3</strong></th></tr></thead><tbody><tr><td>10</td><td>250.46 ms</td><td>253.37 ms</td><td>170.53 ms</td></tr><tr><td>50</td><td>969.38 ms</td><td>855.97 ms</td><td>427.89 ms</td></tr><tr><td>100</td><td>1540.05 ms</td><td>1294.32 ms</td><td>638.69 ms</td></tr><tr><td>250</td><td>2855.72 ms</td><td>2108.26 ms</td><td>1325.33 ms</td></tr><tr><td>500</td><td>4869.79 ms</td><td>3645.61 ms</td><td>3033.06 ms</td></tr><tr><td>1000</td><td>7850.41 ms</td><td>6541.31 ms</td><td>5036.91 ms</td></tr><tr><td>2000</td><td>21562.69 ms</td><td>12378.07 ms</td><td>7839.82 ms</td></tr><tr><td>5000</td><td>62539.38 ms</td><td>37642.91 ms</td><td>22250.88 ms</td></tr><tr><td>10000</td><td><strong>Errored Out</strong></td><td><strong>Errored Out</strong></td><td><strong>Errored Out</strong></td></tr></tbody></table>\n<p><strong>Observations:</strong></p>\n<ul>\n<li>As the number of validator nodes increases, the network demonstrates significantly improved performance under higher thread counts. <strong>Configuration 3</strong> consistently shows the lowest response times, benefiting from better load distribution.</li>\n<li>At lower thread counts (e.g., 10 or 50), the differences between configurations are minimal since the traffic does not fully utilize the network's capacity. However, at higher thread counts (e.g., 500 or more), <strong>Configuration 3</strong> outperforms the others due to its ability to handle a higher volume of concurrent requests.</li>\n<li>At <strong>10,000 threads</strong>, all configurations errored out, indicating the network’s throughput limit under the current setup. However, <strong>Configuration 3</strong> reached significantly higher performance thresholds before encountering errors.</li>\n</ul>\n<h3 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"3-send-transactions-to-validator-test\">3. Send Transactions to Validator Test<a href=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/parallel-validators-and-dynamic-sharding#3-send-transactions-to-validator-test\" class=\"hash-link\" aria-label=\"Direct link to 3. Send Transactions to Validator Test\" title=\"Direct link to 3. Send Transactions to Validator Test\">​</a></h3>\n<p>This test measures the time taken for multiple threads to send transactions to validator nodes. Each transaction submission involves the following steps:</p>\n<ol>\n<li>Retrieving an <strong>access token</strong> from a validator node.</li>\n<li>Sending the transaction as an <strong>RPC request</strong> to the validator node using the retrieved token.</li>\n</ol>\n<p>Additionally, each transaction validation requires attestations from a subset of validator nodes.</p>\n<blockquote>\n<p>🔗 Note on Attestations: Each transaction validation includes attestations from N validator nodes, where N is a dynamic variable. For this test, N was kept constant at 4 to ensure consistent results.</p>\n</blockquote>\n<table><thead><tr><th><strong>Threads</strong></th><th><strong>Configuration 1</strong></th><th><strong>Configuration 2</strong></th><th><strong>Configuration 3</strong></th></tr></thead><tbody><tr><td>10</td><td>1052.11 ms</td><td>726.95 ms</td><td>481.58 ms</td></tr><tr><td>50</td><td>7059.86 ms</td><td>5783.53 ms</td><td>4866.28 ms</td></tr><tr><td>100</td><td>17140.02 ms</td><td>14252.35 ms</td><td>10992.26 ms</td></tr><tr><td>250</td><td><strong>Errored Out</strong></td><td>38932.29 ms</td><td>30432.74 ms</td></tr><tr><td>500</td><td><strong>Errored Out</strong></td><td><strong>Errored Out</strong></td><td><strong>Errored Out</strong></td></tr></tbody></table>\n<p><strong>Observations:</strong></p>\n<ul>\n<li>The network’s performance improves with an increasing number of validator nodes, as seen in <strong>Configuration 3</strong>, which consistently shows the best results under higher thread counts.</li>\n<li>At lower thread counts (e.g., 10 or 50), the differences between configurations are smaller due to minimal load. However, at higher thread counts, <strong>Configuration 3</strong> handles a significantly larger volume of transactions before encountering errors.</li>\n<li>Errors such as timeouts occurred at <strong>250 threads</strong> for <strong>Configuration 1</strong> and <strong>500 threads</strong> for <strong>Configuration 2</strong>, highlighting the limits of these setups. <strong>Configuration 3</strong> demonstrated a higher capacity before reaching its threshold.</li>\n</ul>\n<h3 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"4-get-transactions-test\">4. Get Transactions Test<a href=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/parallel-validators-and-dynamic-sharding#4-get-transactions-test\" class=\"hash-link\" aria-label=\"Direct link to 4. Get Transactions Test\" title=\"Direct link to 4. Get Transactions Test\">​</a></h3>\n<p>This test measures the time required for threads to retrieve transaction data of a particular blockchain address from validator nodes, simulating a typical query load where users request information about transactions. The process involves the following steps:</p>\n<ol>\n<li>The validator node determines the <strong>shard</strong> corresponding to the requested address.</li>\n<li>The validator then identifies the <strong>storage nodes</strong> responsible for that shard and queries them for the transaction data.</li>\n</ol>\n<p>Since the number of storage nodes remains constant across configurations, the performance at higher thread counts is influenced by this dependency.</p>\n<table><thead><tr><th><strong>Threads</strong></th><th><strong>Configuration 1</strong></th><th><strong>Configuration 2</strong></th><th><strong>Configuration 3</strong></th></tr></thead><tbody><tr><td>10</td><td>1727.71 ms</td><td>949.33 ms</td><td>1108.42 ms</td></tr><tr><td>50</td><td>2893.36 ms</td><td>2252.80 ms</td><td>1750.41 ms</td></tr><tr><td>100</td><td>4483.29 ms</td><td>3436.79 ms</td><td>2884.57 ms</td></tr><tr><td>250</td><td>10896.20 ms</td><td>8963.94 ms</td><td>8788.58 ms</td></tr><tr><td>500</td><td>28982.37 ms</td><td>15828.90 ms</td><td>15184.05 ms</td></tr><tr><td>1000</td><td><strong>Errored Out</strong></td><td><strong>Errored Out</strong></td><td><strong>Errored Out</strong></td></tr></tbody></table>\n<p><strong>Observations:</strong></p>\n<ul>\n<li>With an increasing number of validator nodes, traffic is distributed more efficiently among the nodes, leading to better response times in <strong>Configuration 3</strong>, particularly under moderate thread counts (e.g., 50–250).</li>\n<li>At lower thread counts (e.g., 10 or 50), the performance differences are less pronounced since the network does not experience significant load. However, as thread counts increase, <strong>Configuration 3</strong> handles requests more effectively due to its ability to distribute load better across a higher number of validator nodes.</li>\n<li>Errors at <strong>1000 threads</strong> in all configurations highlight the scalability limitations imposed by the constant number of storage nodes. Increasing the number of storage nodes could improve performance at these higher thread counts.</li>\n</ul>\n<h3 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"5-get-push-id-info-test\">5. Get Push ID Info Test<a href=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/parallel-validators-and-dynamic-sharding#5-get-push-id-info-test\" class=\"hash-link\" aria-label=\"Direct link to 5. Get Push ID Info Test\" title=\"Direct link to 5. Get Push ID Info Test\">​</a></h3>\n<p>This test measures the time required for threads to retrieve Push ID information from validator nodes for a given blockchain address, simulating a typical query load where users request mappings of Push IDs. The process involves the following steps:</p>\n<ol>\n<li>The validator node identifies the <strong>shard</strong> corresponding to the requested address or Push ID.</li>\n<li>It then queries the <strong>storage nodes</strong> responsible for that shard to fetch the required data.</li>\n</ol>\n<p>As with other tests, the number of storage nodes remains constant, which impacts performance at higher thread counts.</p>\n<table><thead><tr><th><strong>Threads</strong></th><th><strong>Configuration 1</strong></th><th><strong>Configuration 2</strong></th><th><strong>Configuration 3</strong></th></tr></thead><tbody><tr><td>10</td><td>1589.68 ms</td><td>1180.90 ms</td><td>1062.32 ms</td></tr><tr><td>50</td><td>1551.96 ms</td><td>1924.95 ms</td><td>1139.00 ms</td></tr><tr><td>100</td><td>3168.10 ms</td><td>2280.93 ms</td><td>2784.76 ms</td></tr><tr><td>250</td><td>6141.76 ms</td><td>5376.59 ms</td><td>5170.25 ms</td></tr><tr><td>500</td><td>13462.41 ms</td><td>10437.36 ms</td><td>8337.95 ms</td></tr><tr><td>1000</td><td>23817.09 ms</td><td>18082.24 <strong>ms</strong></td><td>15132.23 ms</td></tr><tr><td>2000</td><td>59157.55 ms</td><td>42868.81 ms</td><td>35978.39 ms</td></tr><tr><td>5000</td><td><strong>Errored Out</strong></td><td>104845.75 ms</td><td>77467.87 ms</td></tr><tr><td>10000</td><td><strong>Errored Out</strong></td><td><strong>Errored Out</strong></td><td><strong>Errored Out</strong></td></tr></tbody></table>\n<p><strong>Observations:</strong></p>\n<ul>\n<li>As the number of validator nodes increases, the load on each individual vnode decreases, improving performance in <strong>Configuration 3</strong>, especially under moderate thread counts (e.g., 50–500).</li>\n<li>At higher thread counts (e.g., 1000 or more), the dependency on storage nodes becomes the primary bottleneck, leading to errors or significantly increased retrieval times. Increasing the number of storage nodes would help alleviate these limitations at scale.</li>\n<li><strong>Configuration 3</strong> consistently shows the best results at all thread counts before errors occur, showcasing the benefits of distributing the load across more validator nodes.</li>\n</ul>\n<hr>\n<h2 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"conclusions\"><strong>Conclusions</strong><a href=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/parallel-validators-and-dynamic-sharding#conclusions\" class=\"hash-link\" aria-label=\"Direct link to conclusions\" title=\"Direct link to conclusions\">​</a></h2>\n<ul>\n<li><strong>Scalability:</strong> As the number of nodes increased, the Push Chain Network demonstrated significantly improved scalability, particularly in <strong>Configuration 3</strong>. This configuration exhibited the best performance across most tests, showcasing the network’s ability to scale efficiently without sacrificing speed. The benefits of <strong>dynamic sharding</strong> ensured that even as the network grew, the system maintained fast response times, handling multiple concurrent threads effectively.</li>\n<li><strong>Performance Bottlenecks:</strong> While performance remained strong as the node count grew, the network did experience timeouts and errors at higher thread counts. This indicates that, although the system can scale, there are throughput limits at extreme loads. However, <strong>Configuration 3</strong> was able to handle a larger volume of requests compared to smaller configurations, validating the advantages of scaling up the number of validator nodes. Given that the <strong>goal of the Push Chain Network</strong> is to scale up to <strong>100,000 validator nodes</strong>, the throughput limits observed at high thread counts are just the beginning. As the network grows, these limits would become significantly larger, making the network capable of handling a vastly higher volume of requests.</li>\n<li><strong>Real-World Application:</strong> The results illustrate how the Push Chain Network becomes more scalable as nodes are added, making it a robust solution for future consumer-centric applications where network demands will increase.</li>\n</ul>\n<p>These benchmarks offer valuable insights into the scaling behaviour of the Push Chain Network, demonstrating its readiness to support growing adoption and demanding workloads. Moving forward, continued optimizations in areas like transaction propagation, parallel processing, and sharding will further enhance the network’s performance, enabling it to handle even higher loads.</p>\n<hr>",
            "url": "https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/parallel-validators-and-dynamic-sharding",
            "title": "Benchmarking Push Chain : Scaling with Validator Nodes",
            "summary": "Benchmarking Push Chain : Scaling with Validator Nodes",
            "date_modified": "2024-12-09T00:00:00.000Z",
            "author": {
                "name": "Push Protocol",
                "url": "https://twitter.com/pushprotocol"
            },
            "tags": [
                "Push Chain",
                "Push Chain Benchmark",
                "Parallel Validators",
                "Dynamic Sharding"
            ]
        },
        {
            "id": "https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/randomized-node-selection-push-chain",
            "content_html": "<p><img loading=\"lazy\" alt=\"Cover Image of 👋 Randomized Parallel Validators of Push Chain\" src=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/assets/images/cover-image-c65e48013a7422b4d8c7bb468b531331.webp\" width=\"1600\" height=\"900\" class=\"img_ev3q\"></p>\n<h2 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"introduction\">Introduction<a href=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/randomized-node-selection-push-chain#introduction\" class=\"hash-link\" aria-label=\"Direct link to Introduction\" title=\"Direct link to Introduction\">​</a></h2>\n<p>One of the defining aspects of decentralized networks is their lack of a central authority to govern how they operate. Instead, these networks rely on a set of rules and systems to securely communicate and reach consensus on the overall state of the network.</p>\n<p>Achieving this is no small task. It involves many essential components that ensure the network remains secure and fair, and among the most critical of these is <strong>randomness</strong>.</p>\n<p>At its core, randomness is the absence of patterns or predictability in events. It's what makes a dice roll uncertain, ensures fairness in games, and strengthens the cryptographic algorithms that secure modern systems. In decentralized networks, randomness serves as a cornerstone of security and fairness, helping to prevent bias and manipulation.</p>\n<p>In this article, we delve into the importance of randomness in decentralized networks and explore how Push Nodes use randomness to bolster the security of the Push Chain.</p>\n<h2 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"why-do-we-need-randomness\">Why do we need Randomness?<a href=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/randomized-node-selection-push-chain#why-do-we-need-randomness\" class=\"hash-link\" aria-label=\"Direct link to Why do we need Randomness?\" title=\"Direct link to Why do we need Randomness?\">​</a></h2>\n<p>To begin with, let’s explore why randomness is so important in decentralized networks.</p>\n<p>As mentioned earlier, decentralized networks lack a central authority. Instead, they rely on a distributed group of nodes spread across the globe. These nodes are responsible for performing various actions to ensure the network remains operational.</p>\n<p>For the network to stay secure and fair, the selection of nodes for specific tasks must happen in a decentralized and unbiased manner. This is where <strong>randomness</strong> becomes crucial.</p>\n<p>In decentralized systems, randomness ensures unpredictability in key processes, such as selecting validators or generating cryptographic keys. This unpredictability is vital to prevent malicious actors from manipulating the system or gaining undue control. For example, in consensus mechanisms like Proof of Stake, the random selection of validators ensures that no single participant can dominate the process, preserving the network's decentralized nature.</p>\n<p>Randomness also strengthens the resilience of blockchains by making it harder for attackers to predict or influence outcomes. This unpredictability guards against attacks like <strong>Sybil attacks</strong> (where adversaries create fake identities) or <strong>collusion</strong> (where groups conspire to take control of the network).</p>\n<p>Additionally, randomness plays a key role in promoting fairness. It ensures that every participant in the network has an equal chance to contribute and benefit, regardless of their resources or influence.</p>\n<p>With this understanding of how crucial randomness is, let’s explore how Push Nodes leverage randomness to enhance the security and fairness of the Push Chain.</p>\n<h2 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"a-glance-at-push-nodes\">A Glance at Push Nodes<a href=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/randomized-node-selection-push-chain#a-glance-at-push-nodes\" class=\"hash-link\" aria-label=\"Direct link to A Glance at Push Nodes\" title=\"Direct link to A Glance at Push Nodes\">​</a></h2>\n<p><a href=\"https://push.org/blog/explaining-push-nodes/\" target=\"_blank\" rel=\"noopener noreferrer\">Push Nodes</a>&nbsp;are a significant step towards the decentralized infrastructure for web3’s leading communication layer, Push Network. This network is designed to facilitate secure and efficient movement of web3 notifications.</p>\n<p>The Push Chain comprises different types of nodes such as Validator Nodes, Storage Nodes, and Archival Nodes. A smart contract guards the network to maintain node staking and slashing. This is where the PUSH token is used.</p>\n<h2 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"how-randomness-is-used-to-enhance-the-security-of-push-chain\">How Randomness Is Used to Enhance the Security of Push Chain<a href=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/randomized-node-selection-push-chain#how-randomness-is-used-to-enhance-the-security-of-push-chain\" class=\"hash-link\" aria-label=\"Direct link to How Randomness Is Used to Enhance the Security of Push Chain\" title=\"Direct link to How Randomness Is Used to Enhance the Security of Push Chain\">​</a></h2>\n<p>In this section, we will specifically understand the complete mechanism of how a transaction is submitted onto Push Chain and the role of randomness involved in the process.</p>\n<p>In the Push Chain, the role of randomization is incorporated at multiple levels which allows the network to prevent centralization while ensuring that it remains resilient against a variety of attacks.</p>\n<p>A crucial security mechanism of the Push Chain is the randomized selection of validators for transaction validation or block production. This mechanism leverages cryptographic randomness to ensure an unpredictable selection of validators &amp;&nbsp;attestants (who verify whether or not a transaction is legit) to enhance the network’s resilience and fairness.</p>\n<p><strong>A brief overview of the process looks something like this:</strong></p>\n<ul>\n<li>To send a transaction to the network, the SDK/sender must attach a randomly generated token number to the transaction.</li>\n<li>To fetch this token, the SDK can request the same from any validator.</li>\n<li>Once received, the SDK attaches this token to the transaction and sends it to the network.</li>\n<li>The network then uses this random token to cryptographically decide the specific validator to verify the particular transaction for further processing.</li>\n<li>Additionally, the validator also randomly decides the validator set responsible for attesting to the transaction.</li>\n</ul>\n<h2 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"now-lets-dive-deeper-into-the-randomness-of-the-push-chain\">Now, let’s dive deeper into the Randomness of the Push Chain:<a href=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/randomized-node-selection-push-chain#now-lets-dive-deeper-into-the-randomness-of-the-push-chain\" class=\"hash-link\" aria-label=\"Direct link to Now, let’s dive deeper into the Randomness of the Push Chain:\" title=\"Direct link to Now, let’s dive deeper into the Randomness of the Push Chain:\">​</a></h2>\n<p>The Push SDK selects a random validator (VR1) to generate a special signed (RANDX) hex token.</p>\n<p>The generation is performed as follows:</p>\n<h3 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"1-generation-of-a-random-token\">1. <strong>Generation of a Random Token:</strong><a href=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/randomized-node-selection-push-chain#1-generation-of-a-random-token\" class=\"hash-link\" aria-label=\"Direct link to 1-generation-of-a-random-token\" title=\"Direct link to 1-generation-of-a-random-token\">​</a></h3>\n<p>The network is designed to ensure that a random token cannot merely be generated by a single validator. Instead, it must be a combined effort as every random token is ideally a collection of digitally signed pieces of random numbers provided by specific validators in the network.</p>\n<p>To determine the exact number of such pieces required to form the token, the Validator.sol smart contract defines a parameter called&nbsp;<code>required_random_number</code>. This indicates the number of required random peers whose signed values each validator must hold, at a given time. Additionally, the contract also defines an&nbsp;<code>expiration_time</code>&nbsp;parameter that defines the expiry time for these tokens which helps ensure that only freshly created tokens can be used for the creation of random tokens.</p>\n<p>It should be kept in mind that validators in the network periodically ping their peers to collect and exchange signed random values. The collected value from each validator is a combination of the random value itself and the validator's signature, ensuring it can be verifiable.</p>\n<div class=\"language-jsx codeBlockContainer_Ckt0 theme-code-block\" style=\"--prism-color:#F8F8F2;--prism-background-color:#282A36\"><div class=\"codeBlockContent_biex\"><pre tabindex=\"0\" class=\"prism-code language-jsx codeBlock_bY9V thin-scrollbar\" style=\"color:#F8F8F2;background-color:#282A36\"><code class=\"codeBlockLines_e6Vv\"><span class=\"token-line\" style=\"color:#F8F8F2\"><span class=\"token plain\">signedRandomValue </span><span class=\"token operator\">=</span><span class=\"token plain\"> value </span><span class=\"token operator\">+</span><span class=\"token plain\"> validatorSignature</span><span class=\"token punctuation\" style=\"color:rgb(248, 248, 242)\">;</span><br></span></code></pre><div class=\"buttonGroup__atx\"><button type=\"button\" aria-label=\"Copy code to clipboard\" title=\"Copy\" class=\"clean-btn\"><span class=\"copyButtonIcons_eSgA\" aria-hidden=\"true\"><svg viewBox=\"0 0 24 24\" class=\"copyButtonIcon_y97N\"><path fill=\"currentColor\" d=\"M19,21H8V7H19M19,5H8A2,2 0 0,0 6,7V21A2,2 0 0,0 8,23H19A2,2 0 0,0 21,21V7A2,2 0 0,0 19,5M16,1H4A2,2 0 0,0 2,3V17H4V3H16V1Z\"></path></svg><svg viewBox=\"0 0 24 24\" class=\"copyButtonSuccessIcon_LjdS\"><path fill=\"currentColor\" d=\"M21,7L9,19L3.5,13.5L4.91,12.09L9,16.17L19.59,5.59L21,7Z\"></path></svg></span></button></div></div></div>\n<p>As a result, at any given moment the validators should have a collection of signed random values by their peers, i.e.,&nbsp;<strong><code>signedRandomValue[].</code></strong></p>\n<p>Once a validator has accumulated the necessary signed random values, it can generate the random token. This token is derived from the network's collective randomness using the following formula:</p>\n<div class=\"language-jsx codeBlockContainer_Ckt0 theme-code-block\" style=\"--prism-color:#F8F8F2;--prism-background-color:#282A36\"><div class=\"codeBlockContent_biex\"><pre tabindex=\"0\" class=\"prism-code language-jsx codeBlock_bY9V thin-scrollbar\" style=\"color:#F8F8F2;background-color:#282A36\"><code class=\"codeBlockLines_e6Vv\"><span class=\"token-line\" style=\"color:#F8F8F2\"><span class=\"token maybe-class-name\">RANDX_Token</span><span class=\"token plain\"> </span><span class=\"token operator\">=</span><span class=\"token plain\"> </span><span class=\"token constant\" style=\"color:rgb(189, 147, 249)\">XOR</span><span class=\"token punctuation\" style=\"color:rgb(248, 248, 242)\">(</span><span class=\"token function\" style=\"color:rgb(80, 250, 123)\">sha</span><span class=\"token punctuation\" style=\"color:rgb(248, 248, 242)\">(</span><span class=\"token plain\">signedRandomValue</span><span class=\"token punctuation\" style=\"color:rgb(248, 248, 242)\">[</span><span class=\"token plain\">i</span><span class=\"token punctuation\" style=\"color:rgb(248, 248, 242)\">]</span><span class=\"token punctuation\" style=\"color:rgb(248, 248, 242)\">)</span><span class=\"token punctuation\" style=\"color:rgb(248, 248, 242)\">)</span><span class=\"token keyword control-flow\" style=\"color:rgb(189, 147, 249);font-style:italic\">for</span><span class=\"token plain\"> all i</span><br></span><span class=\"token-line\" style=\"color:#F8F8F2\"><span class=\"token plain\" style=\"display:inline-block\"></span><br></span></code></pre><div class=\"buttonGroup__atx\"><button type=\"button\" aria-label=\"Copy code to clipboard\" title=\"Copy\" class=\"clean-btn\"><span class=\"copyButtonIcons_eSgA\" aria-hidden=\"true\"><svg viewBox=\"0 0 24 24\" class=\"copyButtonIcon_y97N\"><path fill=\"currentColor\" d=\"M19,21H8V7H19M19,5H8A2,2 0 0,0 6,7V21A2,2 0 0,0 8,23H19A2,2 0 0,0 21,21V7A2,2 0 0,0 19,5M16,1H4A2,2 0 0,0 2,3V17H4V3H16V1Z\"></path></svg><svg viewBox=\"0 0 24 24\" class=\"copyButtonSuccessIcon_LjdS\"><path fill=\"currentColor\" d=\"M21,7L9,19L3.5,13.5L4.91,12.09L9,16.17L19.59,5.59L21,7Z\"></path></svg></span></button></div></div></div>\n<h3 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"2-the-sdk-requests-for-a-random-token\">2. <strong>The SDK Requests for a Random Token</strong><a href=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/randomized-node-selection-push-chain#2-the-sdk-requests-for-a-random-token\" class=\"hash-link\" aria-label=\"Direct link to 2-the-sdk-requests-for-a-random-token\" title=\"Direct link to 2-the-sdk-requests-for-a-random-token\">​</a></h3>\n<p>Next, now let’s understand what happens when the SDK requests for a random token.</p>\n<p>As previously mentioned, before sending any transaction to the network, the SDK&nbsp;requests for a random token that must be attached with the transaction being sent.</p>\n<p>Now, since a random token value has already been generated (as mentioned in step 1), any validator can provide this random token to the SDK.</p>\n<p>The SDK then attaches this random token to the transaction payloads and sends the transaction to the network.</p>\n<h3 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"3-randomized-selection-of-validators\">3. <strong>Randomized Selection of Validators</strong><a href=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/randomized-node-selection-push-chain#3-randomized-selection-of-validators\" class=\"hash-link\" aria-label=\"Direct link to 3-randomized-selection-of-validators\" title=\"Direct link to 3-randomized-selection-of-validators\">​</a></h3>\n<p>This random token attached to the transaction plays a crucial role in randomly deciding which validator will process the transaction. With this token, the SDK deciphers the validator ID, to whom it must send the transaction for further processing.</p>\n<div class=\"language-jsx codeBlockContainer_Ckt0 theme-code-block\" style=\"--prism-color:#F8F8F2;--prism-background-color:#282A36\"><div class=\"codeBlockContent_biex\"><pre tabindex=\"0\" class=\"prism-code language-jsx codeBlock_bY9V thin-scrollbar\" style=\"color:#F8F8F2;background-color:#282A36\"><code class=\"codeBlockLines_e6Vv\"><span class=\"token-line\" style=\"color:#F8F8F2\"><span class=\"token plain\">validator_id </span><span class=\"token operator\">=</span><span class=\"token plain\"> </span><span class=\"token function\" style=\"color:rgb(80, 250, 123)\">f</span><span class=\"token punctuation\" style=\"color:rgb(248, 248, 242)\">(</span><span class=\"token plain\"> </span><span class=\"token constant\" style=\"color:rgb(189, 147, 249)\">RANDX_TOKEN</span><span class=\"token punctuation\" style=\"color:rgb(248, 248, 242)\">,</span><span class=\"token plain\"> contract_defaults</span><span class=\"token punctuation\" style=\"color:rgb(248, 248, 242)\">)</span><span class=\"token plain\"></span><br></span><span class=\"token-line\" style=\"color:#F8F8F2\"><span class=\"token plain\" style=\"display:inline-block\"></span><br></span><span class=\"token-line\" style=\"color:#F8F8F2\"><span class=\"token plain\"></span><span class=\"token comment\" style=\"color:rgb(98, 114, 164)\">//OUTPUT looks like:</span><span class=\"token plain\"></span><br></span><span class=\"token-line\" style=\"color:#F8F8F2\"><span class=\"token plain\">validator_id </span><span class=\"token operator\">=</span><span class=\"token plain\"> v1</span><br></span><span class=\"token-line\" style=\"color:#F8F8F2\"><span class=\"token plain\" style=\"display:inline-block\"></span><br></span><span class=\"token-line\" style=\"color:#F8F8F2\"><span class=\"token plain\">where contractdefault parameters could be</span><span class=\"token operator\">:</span><span class=\"token plain\"></span><br></span><span class=\"token-line\" style=\"color:#F8F8F2\"><span class=\"token plain\">a</span><span class=\"token punctuation\" style=\"color:rgb(248, 248, 242)\">.</span><span class=\"token plain\"> </span><span class=\"token property-access\">min</span><span class=\"token plain\"> required quantity </span><span class=\"token keyword\" style=\"color:rgb(189, 147, 249);font-style:italic\">of</span><span class=\"token plain\"> random numbers</span><span class=\"token punctuation\" style=\"color:rgb(248, 248, 242)\">,</span><span class=\"token plain\"></span><br></span><span class=\"token-line\" style=\"color:#F8F8F2\"><span class=\"token plain\">b</span><span class=\"token punctuation\" style=\"color:rgb(248, 248, 242)\">.</span><span class=\"token plain\"> </span><span class=\"token property-access\">expiration</span><span class=\"token plain\"> time</span><span class=\"token punctuation\" style=\"color:rgb(248, 248, 242)\">,</span><span class=\"token plain\"></span><br></span><span class=\"token-line\" style=\"color:#F8F8F2\"><span class=\"token plain\">c</span><span class=\"token punctuation\" style=\"color:rgb(248, 248, 242)\">.</span><span class=\"token plain\"> </span><span class=\"token property-access\">a</span><span class=\"token plain\"> minimum number </span><span class=\"token keyword\" style=\"color:rgb(189, 147, 249);font-style:italic\">of</span><span class=\"token plain\"> peers that acknowledge the validator's online status</span><span class=\"token punctuation\" style=\"color:rgb(248, 248, 242)\">.</span><span class=\"token plain\"></span><br></span><span class=\"token-line\" style=\"color:#F8F8F2\"><span class=\"token plain\" style=\"display:inline-block\"></span><br></span></code></pre><div class=\"buttonGroup__atx\"><button type=\"button\" aria-label=\"Copy code to clipboard\" title=\"Copy\" class=\"clean-btn\"><span class=\"copyButtonIcons_eSgA\" aria-hidden=\"true\"><svg viewBox=\"0 0 24 24\" class=\"copyButtonIcon_y97N\"><path fill=\"currentColor\" d=\"M19,21H8V7H19M19,5H8A2,2 0 0,0 6,7V21A2,2 0 0,0 8,23H19A2,2 0 0,0 21,21V7A2,2 0 0,0 19,5M16,1H4A2,2 0 0,0 2,3V17H4V3H16V1Z\"></path></svg><svg viewBox=\"0 0 24 24\" class=\"copyButtonSuccessIcon_LjdS\"><path fill=\"currentColor\" d=\"M21,7L9,19L3.5,13.5L4.91,12.09L9,16.17L19.59,5.59L21,7Z\"></path></svg></span></button></div></div></div>\n<p>Upon receiving the transaction, the validator checks the random token in the transaction’s payload and validates it to confirm that it has been correctly assigned the role of handling this transaction.</p>\n<p>In case the validator identifies that it has been wrongly chosen,&nbsp;<strong><em>it can reject the transaction.</em></strong></p>\n<p>Once the accurate assignment of the validator is confirmed, the validator now creates a similar randomized process for creating a list of validators who must attest to the transaction being processed.</p>\n<div class=\"language-jsx codeBlockContainer_Ckt0 theme-code-block\" style=\"--prism-color:#F8F8F2;--prism-background-color:#282A36\"><div class=\"codeBlockContent_biex\"><pre tabindex=\"0\" class=\"prism-code language-jsx codeBlock_bY9V thin-scrollbar\" style=\"color:#F8F8F2;background-color:#282A36\"><code class=\"codeBlockLines_e6Vv\"><span class=\"token-line\" style=\"color:#F8F8F2\"><span class=\"token plain\">vlist </span><span class=\"token operator\">=</span><span class=\"token plain\"> </span><span class=\"token function\" style=\"color:rgb(80, 250, 123)\">f</span><span class=\"token punctuation\" style=\"color:rgb(248, 248, 242)\">(</span><span class=\"token maybe-class-name\">RANDX_Token_2nd</span><span class=\"token punctuation\" style=\"color:rgb(248, 248, 242)\">,</span><span class=\"token plain\"> contract_defaults</span><span class=\"token punctuation\" style=\"color:rgb(248, 248, 242)\">)</span><span class=\"token punctuation\" style=\"color:rgb(248, 248, 242)\">;</span><span class=\"token plain\"></span><br></span><span class=\"token-line\" style=\"color:#F8F8F2\"><span class=\"token plain\" style=\"display:inline-block\"></span><br></span><span class=\"token-line\" style=\"color:#F8F8F2\"><span class=\"token plain\"></span><span class=\"token comment\" style=\"color:rgb(98, 114, 164)\">// Output looks like this:</span><span class=\"token plain\"></span><br></span><span class=\"token-line\" style=\"color:#F8F8F2\"><span class=\"token plain\"></span><span class=\"token punctuation\" style=\"color:rgb(248, 248, 242)\">(</span><span class=\"token plain\">vlist </span><span class=\"token operator\">=</span><span class=\"token plain\"> </span><span class=\"token constant\" style=\"color:rgb(189, 147, 249)\">V2</span><span class=\"token punctuation\" style=\"color:rgb(248, 248, 242)\">)</span><span class=\"token punctuation\" style=\"color:rgb(248, 248, 242)\">,</span><span class=\"token plain\"> </span><span class=\"token constant\" style=\"color:rgb(189, 147, 249)\">V50</span><span class=\"token punctuation\" style=\"color:rgb(248, 248, 242)\">,</span><span class=\"token plain\"> </span><span class=\"token constant\" style=\"color:rgb(189, 147, 249)\">V11</span><span class=\"token punctuation\" style=\"color:rgb(248, 248, 242)\">,</span><span class=\"token plain\"> </span><span class=\"token constant\" style=\"color:rgb(189, 147, 249)\">V8</span><span class=\"token punctuation\" style=\"color:rgb(248, 248, 242)\">,</span><span class=\"token plain\"> </span><span class=\"token constant\" style=\"color:rgb(189, 147, 249)\">V38</span><span class=\"token punctuation\" style=\"color:rgb(248, 248, 242)\">,</span><span class=\"token plain\"> </span><span class=\"token constant\" style=\"color:rgb(189, 147, 249)\">V17</span><span class=\"token punctuation\" style=\"color:rgb(248, 248, 242)\">,</span><span class=\"token plain\"> </span><span class=\"token constant\" style=\"color:rgb(189, 147, 249)\">V29</span><span class=\"token punctuation\" style=\"color:rgb(248, 248, 242)\">;</span><br></span></code></pre><div class=\"buttonGroup__atx\"><button type=\"button\" aria-label=\"Copy code to clipboard\" title=\"Copy\" class=\"clean-btn\"><span class=\"copyButtonIcons_eSgA\" aria-hidden=\"true\"><svg viewBox=\"0 0 24 24\" class=\"copyButtonIcon_y97N\"><path fill=\"currentColor\" d=\"M19,21H8V7H19M19,5H8A2,2 0 0,0 6,7V21A2,2 0 0,0 8,23H19A2,2 0 0,0 21,21V7A2,2 0 0,0 19,5M16,1H4A2,2 0 0,0 2,3V17H4V3H16V1Z\"></path></svg><svg viewBox=\"0 0 24 24\" class=\"copyButtonSuccessIcon_LjdS\"><path fill=\"currentColor\" d=\"M21,7L9,19L3.5,13.5L4.91,12.09L9,16.17L19.59,5.59L21,7Z\"></path></svg></span></button></div></div></div>\n<p>This list of validators is also responsible for verifying its&nbsp;<strong>legitimacy.</strong></p>\n<h2 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"summary\">Summary<a href=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/randomized-node-selection-push-chain#summary\" class=\"hash-link\" aria-label=\"Direct link to Summary\" title=\"Direct link to Summary\">​</a></h2>\n<p>To summarize, the entire process detailed above adds a security layer with the inclusion of randomization at multiple levels, i.e.:</p>\n<ul>\n<li><strong>1st Level:</strong>&nbsp;The initial randomization starts with the SDK choosing any random validator to request for a token to be attached to the transaction.</li>\n<li><strong>2nd Level: A token is generated</strong>&nbsp;using digitally signed pieces of random values from multiple random validators instead of relying on any single actor.</li>\n<li><strong>3rd Level: A specific validator is randomly selected</strong>&nbsp;to create the token to be attached before the transaction occurs.</li>\n<li><strong>4th Level:</strong>&nbsp;The final level of randomization determines which specific validator (VR2) will process a transaction and which validator set will act as attestants to verify the transaction.</li>\n</ul>\n<p>This multi-level randomness ensures that at every step, the network is secure, and fair, while continuing to operate in a completely decentralized fashion.</p>\n<hr>",
            "url": "https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/randomized-node-selection-push-chain",
            "title": "👋 Randomized Parallel Validators of Push Chain",
            "summary": "👋 Randomized Parallel Validators of Push Chain",
            "date_modified": "2024-12-09T00:00:00.000Z",
            "author": {
                "name": "Push Protocol",
                "url": "https://twitter.com/pushprotocol"
            },
            "tags": [
                "Push Chain",
                "Push Chain Nodes",
                "Parallel Validators"
            ]
        },
        {
            "id": "https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/understand-proof-of-stake-and-push-chain",
            "content_html": "<p><img loading=\"lazy\" alt=\"Cover Image of Understand Proof of Stake (POS) and Push Chain PoS\" src=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/assets/images/cover-image-0e557c865dc3ac84a6be9e2670ebe6cb.webp\" width=\"1600\" height=\"900\" class=\"img_ev3q\"></p>\n<h2 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"introduction\">Introduction<a href=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/understand-proof-of-stake-and-push-chain#introduction\" class=\"hash-link\" aria-label=\"Direct link to Introduction\" title=\"Direct link to Introduction\">​</a></h2>\n<p>In a globally distributed computing environment, achieving collective agreement on the true state of the system has always been a complex challenge.</p>\n<p>Fortunately, there are algorithms (<em>specialized instructions</em>) that assist in preserving this ‘single-truth-state’ while balancing network security, long-term sustainability, and economic incentives.</p>\n<p>Such algorithms in the web3 space, are popularly known as Consensus Algorithms.</p>\n<p>This article is the only guide you will need to know about - What Proof of Stake is, its significance and how does it work.</p>\n<h2 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"proof-of-stake---a-quick-overview\">Proof of Stake - A quick overview:<a href=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/understand-proof-of-stake-and-push-chain#proof-of-stake---a-quick-overview\" class=\"hash-link\" aria-label=\"Direct link to Proof of Stake - A quick overview:\" title=\"Direct link to Proof of Stake - A quick overview:\">​</a></h2>\n<p>Proof of Stake is a consensus algorithm used to secure blockchain networks where block producers (validators) are chosen based on the number of tokens they're willing to \"stake\" or lock up as collateral.</p>\n<p>Validators are incentivised to act honestly, since, any malicious behaviour would result in them losing their staked assets.</p>\n<p><img loading=\"lazy\" alt=\"First Image of Understand Proof of Stake (POS) and Push Chain PoS\" src=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/assets/images/image1-e1c9d431f7518c55fbfe2c3aa7dea283.webp\" width=\"2396\" height=\"824\" class=\"img_ev3q\"></p>\n<p>Validators are nodes responsible for securing the network by performing two key actions:</p>\n<ul>\n<li>Proposing new blocks - containing transactions.</li>\n<li>Attestation - Examining and voting on the blocks proposed by other validators</li>\n</ul>\n<p>Now that we have a basic understanding about the PoS, lets go down the rabbit hole to know more about it.</p>\n<h2 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"why-do-we-need-pos\">Why do we need PoS?<a href=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/understand-proof-of-stake-and-push-chain#why-do-we-need-pos\" class=\"hash-link\" aria-label=\"Direct link to Why do we need PoS?\" title=\"Direct link to Why do we need PoS?\">​</a></h2>\n<p>Each network is based on some foundational philosophies.</p>\n<p>Bitcoin popularly known for its PoW (Proof of Work) algorithm is based on the principal of earning the right to validate by demonstrating computational work.</p>\n<p>Chains like Ethereum, Solana and Push Chain are predominantly based on the philosophies of “Proving value to validate and earn incentives at the risk of commitment and economic loss”</p>\n<p>This proves your commitment towards the network by staking tokens to participate in network’s consensus with the risk of being penalized for jeopardizing the network’s security.</p>\n<h3 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"ease-of-entry\">Ease of Entry:<a href=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/understand-proof-of-stake-and-push-chain#ease-of-entry\" class=\"hash-link\" aria-label=\"Direct link to Ease of Entry:\" title=\"Direct link to Ease of Entry:\">​</a></h3>\n<p>Staking makes it easier for individuals to participate in securing the network, promoting decentralization.</p>\n<p>An Ethereum validator node could be easily run on a normal laptop.</p>\n<h3 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"energy-efficiency\">Energy Efficiency:<a href=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/understand-proof-of-stake-and-push-chain#energy-efficiency\" class=\"hash-link\" aria-label=\"Direct link to Energy Efficiency:\" title=\"Direct link to Energy Efficiency:\">​</a></h3>\n<ul>\n<li>\n<p>PoS networks are highly energy efficient in terms of cost of operations and compute consumption.</p>\n</li>\n<li>\n<p>PoS eliminates the energy-intensive mining computations of PoW, replacing them with a stake-based validator selection process that requires only basic network communication and transaction validation operations.</p>\n</li>\n</ul>\n<p><img loading=\"lazy\" alt=\"Second Image of Understand Proof of Stake (POS) and Push Chain PoS\" src=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/assets/images/image2-2b56c897259d738781e5f1fb68be0df5.webp\" width=\"1150\" height=\"606\" class=\"img_ev3q\"></p>\n<p><img loading=\"lazy\" alt=\"Third Image of Understand Proof of Stake (POS) and Push Chain PoS\" src=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/assets/images/image3-49ccdc1dd96fd6f73e515c8626772db6.webp\" width=\"1838\" height=\"1412\" class=\"img_ev3q\"></p>\n<h3 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"stake-to-participate\">Stake to participate:<a href=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/understand-proof-of-stake-and-push-chain#stake-to-participate\" class=\"hash-link\" aria-label=\"Direct link to Stake to participate:\" title=\"Direct link to Stake to participate:\">​</a></h3>\n<p>In PoS networks, influence is tied to economical commitment instead of computational power.</p>\n<p>Participants (validators) pledge their assets (stake) in exchange for the right to participate in the network’s consensus.</p>\n<p>Thus, creating a relationship that equally benefits the interests of the validators as well as the collective network.</p>\n<p><em>The equation only stands true until the validators stay true to their commitments.</em></p>\n<h3 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"skin-in-the-game\">Skin in the game:<a href=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/understand-proof-of-stake-and-push-chain#skin-in-the-game\" class=\"hash-link\" aria-label=\"Direct link to Skin in the game:\" title=\"Direct link to Skin in the game:\">​</a></h3>\n<p>The success of a PoS network hinges on the honesty of its validators.</p>\n<p>Validators are required to deposit (stake) the networks native currency in adequate quantities to participate in the block creation.</p>\n<p>Validators risk losing their staked assets <em>(getting slashed</em> *) if they attempt to game the system for their personal gains by :</p>\n<ul>\n<li>Approving fraudulent transactions</li>\n<li>Censoring incoming transactions.</li>\n<li>Failing to participate</li>\n<li>Sending conflicting attestations</li>\n<li>Proposing multiple blocks in a single slot (aka Equivocating)</li>\n</ul>\n<p>As the network grows, the cost to attack it increases proportionally.</p>\n<p>The amount of tokens slashed varies with every network.</p>\n<p>To know about slashing values for Push Chain - visit the <a href=\"https://gov.push.org/\" target=\"_blank\" rel=\"noopener noreferrer\">Push Chain Governance Proposal</a>.</p>\n<h3 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"scalability\">Scalability:<a href=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/understand-proof-of-stake-and-push-chain#scalability\" class=\"hash-link\" aria-label=\"Direct link to Scalability:\" title=\"Direct link to Scalability:\">​</a></h3>\n<p>In PoS the block creation is a process of “<strong>probabilistic election</strong>” rather than “<strong>computation competition</strong>”.</p>\n<p>Since time taken to elect a validator is significantly less, block creation frequency is (arguably) much higher than PoW networks, significantly boosting transaction speeds and scalability.</p>\n<h3 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"security-and-resilience\">Security and Resilience:<a href=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/understand-proof-of-stake-and-push-chain#security-and-resilience\" class=\"hash-link\" aria-label=\"Direct link to Security and Resilience:\" title=\"Direct link to Security and Resilience:\">​</a></h3>\n<p>As highlighted earlier, in a PoS network, the cost to attack increases proportionally with the network’s growth.</p>\n<p>A 51% attack—where malicious actors gain control of 51% of staked coins to reverse transactions and manipulate block confirmations becomes increasingly impractical and expensive as the network grows and the token prices rises (ideally).</p>\n<p>Dominic Williams, Founder of ICP, outlines three critical elements of Sybil resistance in his paper</p>\n<p>‘<a href=\"https://docs.google.com/document/d/1eRTAe3szuIoZEloHvRMtZlrU7t2un4UVQ8LarpU3LNk/edit?tab=t.0\" target=\"_blank\" rel=\"noopener noreferrer\">Sybil-resistant Network Identities From Dedicated Hardware</a>’</p>\n<ul>\n<li><strong>Entry Cost:</strong> The expense required to participate.</li>\n<li><strong>Existence Cost</strong>: Ongoing costs to maintain participation.</li>\n<li><strong>Exit Penalty</strong>: The penalties for leaving or misbehaving</li>\n</ul>\n<p><img loading=\"lazy\" alt=\"Fourth Image of Understand Proof of Stake (POS) and Push Chain PoS\" src=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/assets/images/image4-d459feb3f4515572fcf2fdb1662ef77e.webp\" width=\"2002\" height=\"1338\" class=\"img_ev3q\"></p>\n<p>PoW chains like Bitcoin does not have an Exit Penalty mechanism to punish the validators for deterring the integrity of network. But PoS chains, like Push Chain cover all the bases, ensuring stricter sybil resistance.</p>\n<h2 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"how-does-proof-of-stake-work\">How does Proof of Stake work?<a href=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/understand-proof-of-stake-and-push-chain#how-does-proof-of-stake-work\" class=\"hash-link\" aria-label=\"Direct link to How does Proof of Stake work?\" title=\"Direct link to How does Proof of Stake work?\">​</a></h2>\n<p>The Proof of Stake (PoS) process operates in three key phases:</p>\n<ol>\n<li><strong>Validator Selection</strong></li>\n<li><strong>Block Creation and Validation</strong></li>\n<li><strong>Finalization</strong></li>\n</ol>\n<h3 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"validator-selection\"><strong>Validator Selection:</strong><a href=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/understand-proof-of-stake-and-push-chain#validator-selection\" class=\"hash-link\" aria-label=\"Direct link to validator-selection\" title=\"Direct link to validator-selection\">​</a></h3>\n<p><img loading=\"lazy\" alt=\"Fifth Image of Understand Proof of Stake (POS) and Push Chain PoS\" src=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/assets/images/image5-d24488a5c3075314c38e3ecbbcaaa89f.webp\" width=\"2180\" height=\"506\" class=\"img_ev3q\"></p>\n<p>Validator Selection forms the backbone of PoS, where nodes participate by staking the network’s native currency into a deposit contract. The staked amount must meet or exceed a predetermined threshold or lowerbound (e.g., 32 ETH for Ethereum).</p>\n<p>To propose a block, the probability of validators getting elected is directly proportional to the staked amount relative to the total coins staked across the network.</p>\n<h3 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"block-creation\"><strong>Block creation:</strong><a href=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/understand-proof-of-stake-and-push-chain#block-creation\" class=\"hash-link\" aria-label=\"Direct link to block-creation\" title=\"Direct link to block-creation\">​</a></h3>\n<p>Timekeeping is critical in PoS, structured through two key units: <strong>Slot</strong> and <strong>Epoch.</strong></p>\n<ul>\n<li>A slot - is a fixed duration of time that varies network to network (1 slot = 12 sec in Ethereum and 400ms in Solana).</li>\n<li><strong>Epoch</strong>: A cycle comprising multiple slots (e.g., 32 slots in Ethereum)</li>\n</ul>\n<p>Slots are sequential and occur one after other in a linear manner.</p>\n<p>(<em>But not in case of Push Chain - More on this later</em>)</p>\n<p>Each slot is assigned to a randomly chosen validator, selected through specialized algorithms like RANDAO in Ethereum and VDF - Verifiable Delay Function in Solana.</p>\n<p>Within their slot duration, validators are responsible for tasks:</p>\n<ul>\n<li>Package transactions into a block</li>\n<li>Verify their validity</li>\n<li>Initiate the process of propagating the block across the network.</li>\n</ul>\n<p><img loading=\"lazy\" alt=\"Sixth Image of Understand Proof of Stake (POS) and Push Chain PoS\" src=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/assets/images/image6-0fd256ac49bf1f3d8395831e6a10a2f9.webp\" width=\"2618\" height=\"700\" class=\"img_ev3q\"></p>\n<h3 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"validation-and-finalization\"><strong>Validation and Finalization</strong><a href=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/understand-proof-of-stake-and-push-chain#validation-and-finalization\" class=\"hash-link\" aria-label=\"Direct link to validation-and-finalization\" title=\"Direct link to validation-and-finalization\">​</a></h3>\n<p>Once a block is proposed, a committee of a defined number of validators is randomly chosen to vote on the validity of the block by careful examining of its contents - This process is called as attestation.</p>\n<p><strong>Attestation Weight</strong>: Each vote is weighted based on the validator’s stake.</p>\n<p><strong>Confirmation</strong>: A block is finalized when at least 2/3 of the total staked tokens sign off on its validity, ensuring a strong consensus.</p>\n<p><img loading=\"lazy\" alt=\"Seventh Image of Understand Proof of Stake (POS) and Push Chain PoS\" src=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/assets/images/image7-9088a84eb87b61c54a7b46adf9154fe6.webp\" width=\"1542\" height=\"424\" class=\"img_ev3q\"></p>\n<h3 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"edge-cases\">Edge cases:<a href=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/understand-proof-of-stake-and-push-chain#edge-cases\" class=\"hash-link\" aria-label=\"Direct link to Edge cases:\" title=\"Direct link to Edge cases:\">​</a></h3>\n<ul>\n<li><strong>Missed Blocks</strong> - Instances when a validator fails to propose a block within their slot, it results in a missed block.</li>\n<li><strong>Orphaned Blocks</strong> - These occur when a block is rejected by the validating committee or during a chain fork. Orphaned blocks represent alternative versions of chain history that are not followed by majority of network.</li>\n</ul>\n<p>In summary, this is how the entire process would look like:</p>\n<p><img loading=\"lazy\" alt=\"Eigth Image of Understand Proof of Stake (POS) and Push Chain PoS\" src=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/assets/images/image8-c154f786db3f95363f5fc1249d19805c.webp\" width=\"1278\" height=\"1372\" class=\"img_ev3q\"></p>\n<h2 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"how-push-nodes-use-pos\">How Push Nodes use PoS?<a href=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/understand-proof-of-stake-and-push-chain#how-push-nodes-use-pos\" class=\"hash-link\" aria-label=\"Direct link to How Push Nodes use PoS?\" title=\"Direct link to How Push Nodes use PoS?\">​</a></h2>\n<p>Push Chain - is a Proof of Stake shared state blockchain for shared app experiences designed to support the development of <strong>hyper-scalable, consumer-centric, universal web3 applications.</strong></p>\n<p>Push Chain enables txs from any chain (Solana, Eth, EVM, or non-EVM) with fast finality of &lt; 1 second. It has the ability to scale infinitely as nodes increase, supporting tens of thousands of parallel transactions</p>\n<ul>\n<li>Any Chain Tx ⛓️</li>\n<li>Fee &amp; Wallet Abstraction 💰&nbsp;🔐</li>\n<li>Parallel Validation and Dynamic Sharding 🛠️</li>\n<li>Consumer tx (unordered) and Traditional tx (ordered)</li>\n<li>Universal Smart Contract 🌐</li>\n<li>Shared App Experience 🤝</li>\n</ul>\n<p>Push Chain uses an innovative approach towards tweaking its consensus mechanism in order to incorporate its multi-node architecture and ability to support both, ordered and un-ordered blocks with parallel validation.</p>\n<p>Push Chain distributes responsibilities across three specialized node types:</p>\n<p><strong>Validator Nodes</strong> - Forms the backbone of the network, handling transaction validation and block production.</p>\n<p><strong>Storage Nodes</strong> - Manage the network's data through dynamic sharding, enabling efficient distribution and retrieval. Storage Nodes work in sync with validators to ensure data availability and decentralization.</p>\n<p><strong>Archival Nodes</strong> - Serve as the network's historical record keepers, storing complete transaction logs and providing WebSocket functionality for real-time data access and analytics.</p>\n<p>Optimised for hyper scalable consumer apps - Push Chain introduces <strong>stateless blocks</strong> with parallel execution for faster processing and validation of non-value consumer data transactions.</p>\n<p>For selecting block validators - the system uses a multi-level randomization process to avoid validator collusion during parallel block processing.</p>\n<p>More details about the randomization mechanism can be found in the <a href=\"https://whitepaper.push.org/\" target=\"_blank\" rel=\"noopener noreferrer\">Push Chain Whitepaper</a>.</p>\n<p>To maintain the network’s economical integrity Push Chain has a modified penalising mechanism which includes the act of ‘Reporting’. It acts like a warning to correct the node’s behaviour instead of simply slashing and banning the node instantly.</p>\n<p><img loading=\"lazy\" alt=\"Ninth Image of Understand Proof of Stake (POS) and Push Chain PoS\" src=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/assets/images/image9-7595d8391a6ccd4625d8891809817751.webp\" width=\"1082\" height=\"1008\" class=\"img_ev3q\"></p>\n<p>There are a lot more novel and interesting elements that make Push Chain a powerful choice for building Universal Apps. Read <a href=\"https://whitepaper.push.org/\" target=\"_blank\" rel=\"noopener noreferrer\">Push Whitepaper</a> to know more!</p>",
            "url": "https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/understand-proof-of-stake-and-push-chain",
            "title": "Understand Proof of Stake (POS) and Push Chain PoS",
            "summary": "Understand Proof of Stake (POS) and Push Chain PoS",
            "date_modified": "2024-12-09T00:00:00.000Z",
            "author": {
                "name": "Push Protocol",
                "url": "https://twitter.com/pushprotocol"
            },
            "tags": [
                "Push Chain",
                "Proof of Stake",
                "Push Chain Nodes"
            ]
        },
        {
            "id": "https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/why-push-chain",
            "content_html": "<p><img loading=\"lazy\" alt=\"Cover Image of Why Push Chain\" src=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/assets/images/cover-image-cc026e92debc8378450504a05e2a3ff2.webp\" width=\"1600\" height=\"900\" class=\"img_ev3q\"></p>\n<h2 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"introduction\">Introduction<a href=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/why-push-chain#introduction\" class=\"hash-link\" aria-label=\"Direct link to Introduction\" title=\"Direct link to Introduction\">​</a></h2>\n<p>Push Protocol recently announced its <a href=\"https://gov.push.org/t/introducing-push-chain-a-shared-state-l1-for-universal-apps/1991\" target=\"_blank\" rel=\"noopener noreferrer\">governance proposal</a> of launching Push Chain.</p>\n<p>Push Protocol envisions the creation of Push Chain which enables a shared state L1 chain designed to support truly scalable consumer applications and universal applications.</p>\n<p>This article explains why Push Chain is needed and why it matters.</p>\n<p>We will dive deep into each of the concerns that exist in web3 today and the solutions that Push Chain offers for each one of them.</p>\n<p>In order to understand what Push Chain offers, let’s first get a good understanding of the concerns in today’s web3 world that is a blocker for consumer apps and universal/unified applications.</p>\n<h2 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"the-major-concerns-in-web3-today\">The Major Concerns in Web3 Today<a href=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/why-push-chain#the-major-concerns-in-web3-today\" class=\"hash-link\" aria-label=\"Direct link to The Major Concerns in Web3 Today\" title=\"Direct link to The Major Concerns in Web3 Today\">​</a></h2>\n<h3 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"web3-is-not-well-equipped-for-building-truly-scalable-consumer-centric-adoption\">Web3 is not well-equipped for building truly scalable consumer-centric adoption<a href=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/why-push-chain#web3-is-not-well-equipped-for-building-truly-scalable-consumer-centric-adoption\" class=\"hash-link\" aria-label=\"Direct link to Web3 is not well-equipped for building truly scalable consumer-centric adoption\" title=\"Direct link to Web3 is not well-equipped for building truly scalable consumer-centric adoption\">​</a></h3>\n<p>Fundamentally, web3 should be unbiased towards a peculiar industry use case. However, practically, there’s an evident misalignment where today’s web3 infrastructure is more optimized for financial use cases.</p>\n<p>Financial apps and consumer-centric apps (<em>e.g. social, gaming, etc</em>) inherently have different infrastructure needs:</p>\n<p>Finance-specific apps require:</p>\n<ul>\n<li><em>A high level of security,</em></li>\n<li><em>Strict transaction and block ordering,</em></li>\n<li><em>Prioritization of state accuracy and finality over speed, etc.</em></li>\n</ul>\n<p>On the flip side consumer apps require more flexible models that emphasize:</p>\n<ul>\n<li><em>Hyper scalability</em></li>\n<li><em>Low latency</em></li>\n<li><em>Simplified UX</em></li>\n<li><em>Affordability</em></li>\n<li><em>Support for both ordered and unordered transactions ( a.k.a, consumer transactions, as we call it )</em></li>\n</ul>\n<p>Web3 ecosystem is heavily skewed towards financial applications. The bias is evident in the rise of projects centered around trading, lending, staking, perps, and similar use cases.</p>\n<p>Such finance-centric infrastructure forces consumer apps to make suboptimal compromises impacting their performance and usability.</p>\n<p>Even the advent of app-specific chains hasn’t fully resolved these tradeoffs.</p>\n<p>For instance, the <a href=\"https://a16zcrypto.com/posts/article/state-of-crypto-report-2024/\" target=\"_blank\" rel=\"noopener noreferrer\"><strong>State of Crypto 2024</strong></a> report by a16z highlights how on-chain games running on dedicated rollups are struggling to keep up with the increasing user demand, straining the network and as a result consuming multifolds of M/gas (<em>mega gas per second</em>) as compared to Ethereum.</p>\n<p><img loading=\"lazy\" alt=\"First Image of Why Push Chain\" src=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/assets/images/image1-eb0b7729b82e747edaacd4830a051f72.webp\" width=\"1536\" height=\"864\" class=\"img_ev3q\"></p>\n<p>Consumer-centric apps, which could appeal to broader audiences, are still in their infancy compared to the much more mature and sophisticated DeFi sector.</p>\n<p>This focus on finance has led to a situation where the average user might view web3 as a playground for traders and investors rather than a tool for everyday life.</p>\n<p>The report from a16z also provides another key insight:</p>\n<p><img loading=\"lazy\" alt=\"Second Image of Why Push Chain\" src=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/assets/images/image2-c5b67901ce12b97c3fbf39b8cd9a5f02.webp\" width=\"1868\" height=\"1558\" class=\"img_ev3q\"></p>\n<p><strong>Out of ~617 million global crypto users, only 5-10% (30-60 million) users actively transact!</strong></p>\n<p>Barriers to entry, the dilemma of choosing the right chain, and multiple points of friction in UX could reasonably be attributed as causes of the growing share of dormant users.</p>\n<p><img loading=\"lazy\" alt=\"Third Image of Why Push Chain\" src=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/assets/images/image3-2751b46496c5642278c8ebdb04b5df65.webp\" width=\"2408\" height=\"1000\" class=\"img_ev3q\"></p>\n<p>Vitalik in his <a href=\"https://youtu.be/ei3tDRMjw6k?si=w1kYuzgR0ho-90Eb&amp;t=1775\" target=\"_blank\" rel=\"noopener noreferrer\">recent talk at Devcon</a> (timestamp: 29:35) emphasized the need for building both non-financial and mixed financial applications.</p>\n<h3 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"fragmentation-of-chains-is-a-major-blocker-towards-overall-web3-ux-improvement\"><strong>Fragmentation of chains is a major blocker towards overall web3 UX improvement</strong><a href=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/why-push-chain#fragmentation-of-chains-is-a-major-blocker-towards-overall-web3-ux-improvement\" class=\"hash-link\" aria-label=\"Direct link to fragmentation-of-chains-is-a-major-blocker-towards-overall-web3-ux-improvement\" title=\"Direct link to fragmentation-of-chains-is-a-major-blocker-towards-overall-web3-ux-improvement\">​</a></h3>\n<p>With Vitalik’s conception of the <em>Rollup-Centric Roadmap, back in 2020,</em> Ethereum pivoted towards rollups as their scaling strategy - as <strong>bundling multiple transactions</strong>&nbsp;<strong>into batches</strong>&nbsp;significantly increased&nbsp;<strong><em>transaction throughput</em></strong>&nbsp;and&nbsp;<strong><em>reduced transaction costs.</em></strong></p>\n<p>This solved Ethereum’s scalability issues effectively and led to an abundance of <em>L2 and L3 chains.</em></p>\n<p>However, the joyous ride is now hitting some rough bumps.</p>\n<h3 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"ux-fragmentation\">UX Fragmentation<a href=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/why-push-chain#ux-fragmentation\" class=\"hash-link\" aria-label=\"Direct link to UX Fragmentation\" title=\"Direct link to UX Fragmentation\">​</a></h3>\n<p><em>Clutter is the Enemy of Clarity.</em></p>\n<p>With each additional step spent completing an action, including switching between networks, time spent in choosing the right chain, protocol, or wallet, decreases <a href=\"https://andrewchen.com/psychd-funnel-conversion/\" target=\"_blank\" rel=\"noopener noreferrer\"><em>Psych</em> - a unit of measure for motivation to complete an action.</a></p>\n<p>Here is a quick glance at what a typical web3 user needs to deal with in this multi-chain universe:</p>\n<ul>\n<li>Managing multiple wallets,</li>\n<li>Managing multiple native tokens/assets in their multiple wallets,</li>\n<li>Understanding the nuances of each network,</li>\n<li>Navigating multiple networks to perform simple tasks,</li>\n<li>Interacting with complicated dapp UIs with frequent network switching</li>\n<li>Navigate through inconsistent user interfaces</li>\n<li>Relying on the risky route of cross-chain bridging between chains</li>\n<li>Experiencing difficulty in maintaining a consistent cross-chain identity due to the multi-chain ecosystem</li>\n<li>Dealing with the lack of standardization between networks, protocols, etc</li>\n<li>Dealing with the learning curve of understanding different networks, each with its own set of rules, interfaces, and requirements.</li>\n</ul>\n<p>Remember that this is just a glance at the UX problem.</p>\n<p>There are undoubtedly more issues for a web3 user daily. The list is even longer when it comes to newbie web3 users.</p>\n<p><img loading=\"lazy\" alt=\"Fourth Image of Why Push Chain\" src=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/assets/images/image4-1ffdae2ec53d35c95e7f47f4c1f0acbe.webp\" width=\"2128\" height=\"1140\" class=\"img_ev3q\"></p>\n<h3 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"user-retention-challenges\">User Retention Challenges<a href=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/why-push-chain#user-retention-challenges\" class=\"hash-link\" aria-label=\"Direct link to User Retention Challenges\" title=\"Direct link to User Retention Challenges\">​</a></h3>\n<p>Poor UX can directly impact user retention.</p>\n<p>Truth be told, it already is impacting user retention.</p>\n<p>When users encounter difficulties in navigating the web3 ecosystem, they are less likely to return to it. High-profile dApps that have struggled with user retention due to UX issues serve as cautionary tales for new projects entering the space. Complex interfaces, slow transaction times, and confusing wallet setups have all contributed to a decline in user engagement and adoption.</p>\n<h3 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"security-and-trust-concerns\"><strong>Security and Trust Concerns</strong><a href=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/why-push-chain#security-and-trust-concerns\" class=\"hash-link\" aria-label=\"Direct link to security-and-trust-concerns\" title=\"Direct link to security-and-trust-concerns\">​</a></h3>\n<p>The complexity of managing multiple chains also introduces security risks.</p>\n<p>Users must ensure that they are interacting with the correct chain, using the right wallet, and understanding the implications of each transaction. This complexity increases the likelihood of user errors, such as sending assets to the wrong address or falling victim to phishing attacks.</p>\n<p>Furthermore, the process of bridging assets between these chains is quite often cumbersome and fraught with risks. Users must rely on various bridging protocols, which not only add to the complexity but also introduce potential security vulnerabilities. For instance, a user willing to move tokens from Ethereum to an L2 solution must navigate multiple steps, including wrapping and unwrapping tokens, which can be a deterrent for new users.</p>\n<h3 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"increased-complexity-for-builders\"><strong>Increased Complexity for Builders:</strong><a href=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/why-push-chain#increased-complexity-for-builders\" class=\"hash-link\" aria-label=\"Direct link to increased-complexity-for-builders\" title=\"Direct link to increased-complexity-for-builders\">​</a></h3>\n<p>Each chain often has its own development tools, SDKs, and environments that developers must learn &amp; adapt to, which can be time-consuming and lead to inconsistencies in development practices. Maintaining applications that operate across multiple chains requires managing multiple codebases or conditional code paths. This can lead to significant maintenance overhead, especially when chains update their protocols or APIs.</p>\n<p>Each additional chain integrated into an application introduces new potential vulnerabilities. Developers must ensure that the security of cross-chain interactions is robust, as any weakness could lead to exploits or hacks.</p>\n<p>Furthermore, developing for a multi-chain ecosystem that still lacks adequate standardization - is costly. It requires more time and resources, as developers need to learn and implement different protocols, test on multiple platforms, and ensure compatibility across the whole environment involved. The additional cost of extensive security audits makes the process of building &amp; maintaining apps even more difficult.</p>\n<p>There is no one size fits all solution, nor is there a way to restrict the proliferation of chains.</p>\n<p><strong><em>But what if there was a way to unify every fragmented state under one shared state?</em></strong></p>\n<h3 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"a-shared-state-chain-is-needed-that-can-enable-shared-app-experiences\"><strong>A shared state chain is needed that can enable shared app experiences</strong><a href=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/why-push-chain#a-shared-state-chain-is-needed-that-can-enable-shared-app-experiences\" class=\"hash-link\" aria-label=\"Direct link to a-shared-state-chain-is-needed-that-can-enable-shared-app-experiences\" title=\"Direct link to a-shared-state-chain-is-needed-that-can-enable-shared-app-experiences\">​</a></h3>\n<p>Let’s dive a bit further into the complexities of multi-chain web3 world.</p>\n<p>While fragmented UX is definitely a concern, there are more.</p>\n<p>There are over 30 Layer 1s, 120 Layer 2s and soon thousands of Layer 3 chains.\nImagine the sheer number of DApps deployed on all of these chains!</p>\n<p>Newer chains have led to the rise of siloed environments having limited or zero awareness of each others state - even Ethereum!</p>\n<p>The majority of these apps still operate within closed systems. Contracts pertaining to each chain store states in an isolated manner leaving little opportunity for users for a unified experience. Siloed environments in turn add more interop complexities forcing developers to <strong>shift price-sensitive apps</strong> to app-sensitive infrastructure, further affecting the UX and escalating fragmentation.</p>\n<p>Here is a quick look at Vitalik and Justin Drake talking about the same issues:</p>\n<p><img loading=\"lazy\" alt=\"Fifth Image of Why Push Chain\" src=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/assets/images/image5-ba2bb43ea96df9a072e6e0f8c40fc82c.webp\" width=\"1226\" height=\"1452\" class=\"img_ev3q\"></p>\n<p><img loading=\"lazy\" alt=\"Sixth Image of Why Push Chain\" src=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/assets/images/image6-dd608dd464b88b7015a73445fab636b2.webp\" width=\"1528\" height=\"766\" class=\"img_ev3q\"></p>\n<p>With such an extent of liquidity, state and UX fragmentation, it becomes troublesome for web3 apps/users to seamlessly interact with apps on multiple chains. In fact, in order to move assets or payloads between chains, a user is often exposed to the on-chain intricacies and risks to achieve simple tasks.</p>\n<p>For instance, a use with governance token on chain A cannot vote on any proposal of the same protocol on chain B as there is no unified system to support this activity. As a result, every app on a specific chain becomes its own siloed state.</p>\n<p>This leads to an issue where there is no unified infra for apps to be built on. And there is a shared app experience for users to just use apps without having to worry about the underlying chains, finality risks, bridging or facing complicated UX.</p>\n<p>So far, we have discussed the concerns.</p>\n<p>Let’s now understand what is Push Chain and how it helps us resolve these concerns.</p>\n<h2 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"enter-push-chain\">Enter Push Chain<a href=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/why-push-chain#enter-push-chain\" class=\"hash-link\" aria-label=\"Direct link to Enter Push Chain\" title=\"Direct link to Enter Push Chain\">​</a></h2>\n<p>Push Chain is a shared state blockchain for shared app experience.</p>\n<p>It is a Proof of Stake (PoS) chain built to allow developers to create scalable and universal apps and act as a shared settlement layer for multiple L1s, L2s and L3s. It is designed to allow transactions from any chain, use fee abstraction to avoid the strict requirement of native gas tokens for multiple chains and provide wallet abstraction for seamless onboarding and signing for any user.</p>\n<p>It also introduces a new transaction type which we define as consumer transactions (where ordering is not important) to enable non-financial apps to have the speed and scalability which any consumer app requires. It leverages new mechanisms like parallel block execution and dynamic sharding to enable true scaling, and providing the perfect environment for any consumer app or universal app to thrive in the era of fragmented chains.</p>\n<p><img loading=\"lazy\" alt=\"Seventh Image of Why Push Chain\" src=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/assets/images/image7-a27f77c2896dc4553c78bb2717a94e90.webp\" width=\"1034\" height=\"920\" class=\"img_ev3q\"></p>\n<p>Push chain aims to solve some of the critical concerns in web3 today, as previously explained, and it plans to solve them in 3 specific phases. Each of these phases tackle a particular problem and eventually leads us to our core vision of achieving a shared app experience for web3 and enable universal apps with enhanced UX.</p>\n<p>Mentioned below are the 3 main phases:</p>\n<ol>\n<li><strong>Phase-1:</strong> To enable consumer-centric apps with hyper scalability, fee abstraction, wallet abstraction and any chain transactions.</li>\n<li><strong>Phase-2:</strong> To enable seamless interoperability between chains for apps and users.<br>\n<!-- -->(<em>An intermediary phase to enable the universal smart contracts and shared state</em>)</li>\n<li><strong>Phase-3:</strong> To enable universal smart contracts and shared state in order to make other chain’s state accessible on Push Chain and unlocking the era of universal apps.</li>\n</ol>\n<p>Now, let’s understand each of the above-mentioned concerns and explore how Push Chain aims to resolve them.</p>\n<ol>\n<li>\n<p><strong>The Concerns with Consumer-Specific App</strong></p>\n<p>So far we have explored why building and using consumer-specific web3 apps is difficult.</p>\n<p>However, let’s now dive deep to first understand what exactly does a consumer-app required and how Push Chain completes those requirements.</p>\n<p>Some of the main requirements of a consumer-centric applications are:</p>\n<ol>\n<li>\n<p><strong>Simplified User-Onboarding:</strong> Apps required seamless onboarding and intuitive user interface. In simpler terms, this indicates that applications should be so easy to use that the user should never have to learn the intricacies of the underlying technology stack.</p>\n<p>However, its not the case in web3. The intuitiveness ends the moment users are required to <em>set up a web3 wallet and remember the mnemonics</em>. This means the very first step a user is required to do for using web3 apps will most likely be the most difficult step in itself.</p>\n<p>Once the user enters the rabbit hole of using a web3 app, they are then required to either <em>choose a chain, sign a transaction, collect and manage native gas tokens of the respective chain, switch between different chains, bridge tokens, etc.</em> The list goes on and <strong><em>the further you explore, the harder the UX.</em></strong></p>\n<p>With Wallet Abstraction, Push Chain aims to enable seamless user onboarding without going through the manual and complicated procedure of setting up a web3 wallet.</p>\n<p><img loading=\"lazy\" alt=\"Eigth Image of Why Push Chain\" src=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/assets/images/image8-70c78f84636ce3306181274bed509f46.webp\" width=\"1036\" height=\"898\" class=\"img_ev3q\"></p>\n<p>Wallet abstraction addresses challenges by removing the need for direct mnemonic management. Instead, Push Chain allows users to authenticate using familiar methods like <em>social logins, email, or phone numbers.</em> This system abstracts away the complexity of mnemonic custody by securely managing a master key pair on behalf of the user, while still ensuring they retain ultimate control.</p>\n<p>The Push wallet can dynamically derive blockchain-specific keys from the master key pair, enabling seamless interaction across multiple blockchain networks. By simplifying wallet operations and providing a unified experience, wallet abstraction reduces friction, enhances usability, and makes blockchain technology more accessible without compromising security.</p>\n<blockquote>\n<p><em>The whitepaper explains the Key Management and technical aspects around keys in greater detail. Check it out here</em></p>\n</blockquote>\n</li>\n<li>\n<p><strong>Instant Finality &amp; Scalability:</strong> A consumer-centric app needs to support a large number of users without compromising performance. Additionally, it needs to support instant finality so that users experience a similar speed as in traditional apps.</p>\n<p>Although layer 2 solutions and rollups aim to address scalability, the current state of web3 still struggles to match the speed and efficiency of traditional centralized systems. For a consumer-centric app, any delay in processing or finalizing transactions will lead to a poor user experience.</p>\n<p><strong>Push Chain</strong> is designed to solve this with its instant finality as well as its support for unordered transactions, a.k.a, consumer transactions.</p>\n<p>A consumer transaction can be defined as the type of transaction that doesn't benefit from the strict ordering as seen in traditional web3 transactions where strict ordering with a nonce is mandatory. These can also be categorized as transfers of consumer data like notifications, emails, blogs, etc that do not require a strict order to be executed.</p>\n<p>Since there is no state change for such transactions, they don’t need to change the merkle root of the network and thus can be called <strong>orderless transactions.</strong></p>\n<p>Examples of these transactions can be emails sent from one user to another, posting on social media, writing blogs, creating content, defining user settings for an app, defining user meta-data, storing soft state data for gaming among others.</p>\n<p>The chain is designed to facilitate a wide range of consumer transactions, providing a robust and scalable platform for decentralized applications. The transaction model in the Push Chain is tailored to support high-throughput, low-latency operations, ensuring that various applications can interact seamlessly.</p>\n<p><strong>Since scalability is crucial for any application, phase 1</strong> of the Push Chain roadmap includes the development of new optimization such as <strong>parallel block execution and dynamic sharding</strong> to create the true scaling of web3 apps, enabling read and write capabilities that scale as the number of nodes in the network scales, which provides an infrastructure that can handle the needs of thousands of applications related to speed and scalability.</p>\n</li>\n<li>\n<p><strong>Affordability:</strong> A major pain point of using any app is the associated cost. If an app requires a user to spend a high as well as indeterministic cost every time he/she wishes to use the app - the user will most likely never use it.</p>\n<p>Consumers expect low or no fees for transactions within apps, especially non-monetary ones. Gas fees, while necessary to secure the network, are a major barrier to consumer adoption. In web3, transaction fees are often too high for the average consumer; even more so during network congestion. However, solving this has been difficult as there is a always gas fees/network fees associated with any and every action a user might want to take.</p>\n<p><strong>With Push Chain’s Fee Abstraction feature,</strong> we eliminate this problem to a greater extent.</p>\n<p>Fee Abstraction is a key feature of this chain that eliminates the friction of requiring to hold native gas strictly in the wallet in use.</p>\n<p>Furthermore, a sustainable decentralized network needs to be present in order to ensure the long-term viability of the project. To do this, we propose including a mechanism for having a fee quota.</p>\n<p>A user is able to purchase fees in bulk that can then be used by them, delegated to other users / wallets or can even be paid by web3 applications. The key idea behind locking fees in bulk is to ensure that the transaction coming from whatever blockchain network is not limited by the speed of that particular blockchain’s TPS.</p>\n<p>Additionally, there is a fallback mechanism that does a graceful conversion using swapper contracts which takes the native token of a specific blockchain and swaps it for Push Chain’s fees.</p>\n<p>This ensures that in the event a different chain user doesn’t have enough fees, even then the network is still able to fallback and use that particular blockchain’s native token for the conversion and eventual processing of the transaction. This mechanism ensures that even running out of quota is not a barrier to transaction creation, providing flexibility in payment methods.</p>\n</li>\n</ol>\n</li>\n<li>\n<p><strong>The Concerns with Multi-Chain Navigation &amp; Fragmented Ecosystem</strong></p>\n<p>As previously stated, a core reason behind difficult UX in web3 is the existence of multiple different chains. Each of these chains offers some key feature but eventually leads to a fragmented ecosystem.</p>\n<p>If we observe the space as whole, carefully, it is quite evident that there are two main requirements for apps to navigate such an ecosystem:</p>\n<ul>\n<li>Fast and reliable movement of value and messages between chains ( <em>for both apps and users )</em></li>\n<li>A shared state infrastructure that allows building apps that appear to work seamlessly in a unified fashion and give a <strong>shared app experience</strong> to the user - completely eradicating the complexity of navigating multiple chains for using apps.</li>\n</ul>\n<p>If an infrastructure achieves both of these for the apps built on top of it, it can ideally resolve the most difficult UX problem that exists in web3 apps today.</p>\n<p>That’s exactly what Push Chain aims to solve in its Phase 2 and 3.</p>\n<p><strong>With Phase 2</strong> of its roadmap, the chain aims to establish seamless interoperability between chains to enable cross-chain features in the apps. The interoperability shall be enabled using a solver network capable of instant cross-chain transactions to ensure better UX. The network shall be designed to move not just value but also arbitrary payloads that seamlessly transfer smart contract calls to other chains.</p>\n<p>The main goals of this phase is to:</p>\n<ul>\n<li>Enable fast and reliable movement of messages/assets between chain</li>\n<li>Delegate on-chain intricacies and risks from users to solvers ( <em>specialized on-chain actors )</em></li>\n</ul>\n<p>At the point in which both of these goals are accomplished, we will achieve a win for both the users and the apps on top of Push Chain.</p>\n<p><strong>With Phase 3,</strong> we achieve the shared state L1 chain that is capable of supporting universal apps. Most importantly, this phase establishes one of the key features of Push Chain, i.e., <strong>shared app experiences</strong> (with Shared State).</p>\n<p>Shared state allows Push Chain to access data from its own chain as well as supported external chains. Combining this with Push ID enables universal smart contracts wherein the smart contracts on Push Chain have access to the state of all of the wallets of the user even if those wallets belong to other chain(s). This enables developers to understand the user and build universal smart contracts to fulfill the user’s need irrespective of what chain(s) the user state is on which ushers countless innovations.</p>\n<p><img loading=\"lazy\" alt=\"Ninth Image of Why Push Chain\" src=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/assets/images/image9-0277bcf4353ad392efa0adcf75fb3894.webp\" width=\"1364\" height=\"1006\" class=\"img_ev3q\"></p>\n<p>The feature opens up the entire web3 userbase to be available for a web3 application enabling shared app experiences no matter from what blockchain the user accesses the application. It also makes Push Chain the shared settlement layer for all other chains (EVM / Non-EVM).</p>\n<p>This enables developers to completely abstract away any learning from the user, creating an era where a user does not use Uniswap “on Ethereum” or Uniswap “on Polygon” or Uniswap “on Arbitrum” — but rather simply <strong>uses Uniswap</strong> for its features.</p>\n</li>\n</ol>\n<hr>\n<h2 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"conclusion\">Conclusion<a href=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/why-push-chain#conclusion\" class=\"hash-link\" aria-label=\"Direct link to Conclusion\" title=\"Direct link to Conclusion\">​</a></h2>\n<p>This article was an extensive guide to understanding the need for Push Chain, what it offers, and how it benefits the overall web3 ecosystem.</p>\n<p>It is quite evident how the above-mentioned concerns with web3 today is a major blocker behind the growth of consumer-centric web3 apps.</p>\n<p>With Push Chain, we aim to resolve each of these blockers and provide an infrastructure dedicated to building and supporting top-notch web3 apps with hyper scalability, enhanced user onboarding, better UX with wallet and fee abstraction, and a shared state L1 chain designed to build universal apps with shared app experience.</p>\n<h2 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"next-steps\">Next Steps<a href=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/why-push-chain#next-steps\" class=\"hash-link\" aria-label=\"Direct link to Next Steps\" title=\"Direct link to Next Steps\">​</a></h2>\n<ol>\n<li><strong>Check out the <a href=\"https://whitepaper.push.org/?utm_source=pushblog&amp;utm_medium=referral&amp;utm_campaign=pcgov\" target=\"_blank\" rel=\"noopener noreferrer\">Push Chain Whitepaper</a></strong> for a detailed overview of the vision and the underlying technicalities.</li>\n<li>Visit the <a href=\"https://push.org/chain?utm_source=pushblog&amp;utm_medium=referral&amp;utm_campaign=pcgov\" target=\"_blank\" rel=\"noopener noreferrer\">Push Chain Website</a> to find a one-pager explanation of the vision.</li>\n<li><a href=\"https://scan.push.org/?utm_source=pushblog&amp;utm_medium=referral&amp;utm_campaign=pcgov\" target=\"_blank\" rel=\"noopener noreferrer\">Push Chain Devnet</a> is running live on Proof-of-Stake network validators, storage and archival nodes. The network already supports consumer transactions as well.</li>\n<li><a href=\"https://simulate.push.org/?utm_source=pushblog&amp;utm_medium=referral&amp;utm_campaign=pcgov\" target=\"_blank\" rel=\"noopener noreferrer\">Push Chain Simulate Tx</a> already provides a way for everyone to send tx from any chain using wallet abstraction.</li>\n</ol>",
            "url": "https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/why-push-chain",
            "title": "Why PUSH Chain?",
            "summary": "Why PUSH Chain?",
            "date_modified": "2024-12-09T00:00:00.000Z",
            "author": {
                "name": "Push Protocol",
                "url": "https://twitter.com/pushprotocol"
            },
            "tags": [
                "Push Chain",
                "Shared App Experience",
                "Any Chain Tx",
                "Universal Smart Contracts",
                "Shared State Blockchain",
                "Consumer Tx",
                "Parallel Validators",
                "Dynamic Sharding"
            ]
        },
        {
            "id": "https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/how-push-enhances-privacy-in-on-chain-communications",
            "content_html": "<p><img loading=\"lazy\" alt=\"Cover Image of How Push Enhances Privacy in On-Chain Communications\" src=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/assets/images/cover-image-46e5069477dd11a8d4139816c39aebab.webp\" width=\"1920\" height=\"1080\" class=\"img_ev3q\"></p>\n<p>While privacy is fundamental to blockchain technology, communicating on-chain poses distinct challenges. Because wallet addresses are public by design, users face risks from unsolicited messages, data mining, and phishing attempts. This challenge requires a secure, private communication layer that preserves the decentralized nature of the blockchain. An effective solution must give users complete control over their data while allowing smooth, private interactions. Push Protocol addresses this need by enhancing privacy in on-chain communications without compromising usability or security.</p>\n<h3 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"end-to-end-encryption-ensuring-message-privacy\"><strong>End-to-End Encryption: Ensuring Message Privacy</strong><a href=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/how-push-enhances-privacy-in-on-chain-communications#end-to-end-encryption-ensuring-message-privacy\" class=\"hash-link\" aria-label=\"Direct link to end-to-end-encryption-ensuring-message-privacy\" title=\"Direct link to end-to-end-encryption-ensuring-message-privacy\">​</a></h3>\n<p>Push ensures that every message exchanged between users remains private, leveraging robust end-to-end encryption. This encryption ensures that only the sender and recipient can access the content, effectively safeguarding sensitive information from prying eyes.</p>\n<p>When users register with Push Chat using their wallet, a unique public-private key pair is generated. This method removes the need for usernames or passwords, ensuring privacy by design. The private key stays securely within the user’s wallet, while the public key allows others to encrypt messages intended for them. For example, when User A sends a message to User B, the message is encrypted with User B's public key, ensuring that only User B—holding the corresponding private key—can decrypt and read it.</p>\n<p>This process, powered by asymmetric cryptography, guarantees that no third party can intercept or decipher the communication. By placing security and privacy at the core of its design, Push empowers user privacy, even in a decentralized environment.</p>\n<h3 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"pgp-key-security-your-private-key-your-privacy\"><strong>PGP Key Security: Your Private Key, Your Privacy</strong><a href=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/how-push-enhances-privacy-in-on-chain-communications#pgp-key-security-your-private-key-your-privacy\" class=\"hash-link\" aria-label=\"Direct link to pgp-key-security-your-private-key-your-privacy\" title=\"Direct link to pgp-key-security-your-private-key-your-privacy\">​</a></h3>\n<p>Push takes a decentralized approach to key management by generating and encrypting PGP keys locally on users' devices. These keys are protected using advanced encryption methods, ensuring only the user can access them. These private keys never leave the user’s control, ensuring that their communication remains secure. This commitment to decentralization ensures that privacy is not a feature to be toggled but a default guarantee for all Push users. Think of it as having your personal safe: only you hold the key, and no one else, not even Push, can open it.</p>\n<h3 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"anonymous-communication-no-personal-information-required\"><strong>Anonymous Communication: No Personal Information Required</strong><a href=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/how-push-enhances-privacy-in-on-chain-communications#anonymous-communication-no-personal-information-required\" class=\"hash-link\" aria-label=\"Direct link to anonymous-communication-no-personal-information-required\" title=\"Direct link to anonymous-communication-no-personal-information-required\">​</a></h3>\n<p>Unlike traditional platforms that require personal identifiers like email addresses or phone numbers, Push enables wallet-to-wallet messaging. This innovation allows users to communicate anonymously, relying solely on their Web3 wallets for identity. By removing the need for personal identifiers, Push eliminates the common risks of data breaches and misuse of personal information. This feature not only enhances privacy but also aligns with the principles of pseudonymity and anonymity by offering valuable protections and can be used to enhance privacy and security on the blockchain.</p>\n<h3 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"decentralized-storage-with-ipfs\"><strong>Decentralized Storage with IPFS</strong><a href=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/how-push-enhances-privacy-in-on-chain-communications#decentralized-storage-with-ipfs\" class=\"hash-link\" aria-label=\"Direct link to decentralized-storage-with-ipfs\" title=\"Direct link to decentralized-storage-with-ipfs\">​</a></h3>\n<p>Push stores messages securely on the InterPlanetary File System (IPFS), a decentralized storage solution that ensures data integrity and security. Using IPFS, Push ensures that data is distributed across multiple nodes, making it nearly impossible for hackers to tamper with or breach.</p>\n<p>Push’s decentralized infrastructure minimizes security risks like data breaches while providing faster access to data and greater resilience. This approach ensures that even if one node fails, user messages remain accessible and secure, offering uninterrupted service.</p>\n<h3 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"spam-prevention-for-better-privacy\"><strong>Spam Prevention for Better Privacy</strong><a href=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/how-push-enhances-privacy-in-on-chain-communications#spam-prevention-for-better-privacy\" class=\"hash-link\" aria-label=\"Direct link to spam-prevention-for-better-privacy\" title=\"Direct link to spam-prevention-for-better-privacy\">​</a></h3>\n<p>Spam and unwanted messages can be significant privacy concerns. Push mitigates this with chat requests and opt-in notifications, empowering users to control who can contact them. Chat requests allow users to preview messages before accepting them, while opt-in notifications ensure that only chosen channels can send updates. This spam prevention mechanism ensures that users’ communication remains meaningful and free from unnecessary intrusion.</p>\n<h3 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"privacy-in-nft-and-token-gated-groups\"><strong>Privacy in NFT and Token-Gated Groups</strong><a href=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/how-push-enhances-privacy-in-on-chain-communications#privacy-in-nft-and-token-gated-groups\" class=\"hash-link\" aria-label=\"Direct link to privacy-in-nft-and-token-gated-groups\" title=\"Direct link to privacy-in-nft-and-token-gated-groups\">​</a></h3>\n<p>Push goes beyond one-on-one messaging by enabling private group chats for NFT and token holders. Access to these groups is determined by ownership of specific NFTs or tokens, creating exclusive spaces for members. This functionality allows users to participate in exclusive communities without revealing personal information. Whether it’s an NFT club or a DAO working group, Push ensures that privacy is maintained across all interactions.</p>\n<h3 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"cross-chain-privacy\"><strong>Cross-Chain Privacy</strong><a href=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/how-push-enhances-privacy-in-on-chain-communications#cross-chain-privacy\" class=\"hash-link\" aria-label=\"Direct link to cross-chain-privacy\" title=\"Direct link to cross-chain-privacy\">​</a></h3>\n<p>As Web3 grows increasingly multi-chain, Push ensures seamless and private communication across blockchain networks. This is achieved using advanced encryption and decentralized architecture, ensuring messages remain secure no matter the blockchain. This cross-chain capability fosters decentralized collaboration while upholding privacy principles in diverse ecosystems.</p>\n<h3 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"the-future-of-onchain-communication\"><strong>The Future of Onchain Communication</strong><a href=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/how-push-enhances-privacy-in-on-chain-communications#the-future-of-onchain-communication\" class=\"hash-link\" aria-label=\"Direct link to the-future-of-onchain-communication\" title=\"Direct link to the-future-of-onchain-communication\">​</a></h3>\n<p>Push is setting new standards for privacy in on-chain communications. With powerful end-to-end encryption, decentralized storage, and anonymous messaging, Push delivers secure communication for all users. As Web3 grows, Push remains dedicated to empowering users with privacy tools that make their experience better.</p>\n<p>In a world where data is currency, Push protects what matters most—your privacy.</p>",
            "url": "https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/how-push-enhances-privacy-in-on-chain-communications",
            "title": "How Push Enhances Privacy in On-Chain Communications",
            "summary": "How Push Enhances Privacy in On-Chain Communications",
            "date_modified": "2024-11-28T00:00:00.000Z",
            "author": {
                "name": "SixtyKeys",
                "url": "https://x.com/sixty_keys"
            },
            "tags": [
                "Technical",
                "Push Tech"
            ]
        },
        {
            "id": "https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/monthly-recap-october-2024",
            "content_html": "<p><img loading=\"lazy\" alt=\"Cover Image of Push Protocol Monthly Updates - October\" src=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/assets/images/cover-image-6ae55e926f07684f8a74fc31883e8de3.webp\" width=\"1600\" height=\"840\" class=\"img_ev3q\"></p>\n<p>October has been another outstanding month for Push Protocol, showcasing significant advancements across development, integrations, and community engagement. As we move forward, we’re excited to share key highlights from the month that underscore our continued commitment to driving Web3 communication and community growth.</p>\n<p>Here’s a recap of our latest updates 👇</p>\n<h2 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"protocol-milestones\"><strong>Protocol Milestones:</strong><a href=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/monthly-recap-october-2024#protocol-milestones\" class=\"hash-link\" aria-label=\"Direct link to protocol-milestones\" title=\"Direct link to protocol-milestones\">​</a></h2>\n<h3 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"push-points-program-launch-\"><strong>Push Points Program Launch 🚀</strong><a href=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/monthly-recap-october-2024#push-points-program-launch-\" class=\"hash-link\" aria-label=\"Direct link to push-points-program-launch-\" title=\"Direct link to push-points-program-launch-\">​</a></h3>\n<p>October saw the launch of the&nbsp;<a href=\"https://push.org/blog/introducing-the-push-points-program/\" target=\"_blank\" rel=\"noopener noreferrer\"><strong>Push Points Program</strong></a>, a reputation-based system designed to reward our community members and reinforce ties with our ecosystem partners. This initiative strengthens user engagement and incentivizes active participation in our ecosystem, adding a new layer of value to our protocol.</p>\n<h3 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"user-growth-and-notification-achievements-\"><strong>User Growth and Notification Achievements 📈</strong><a href=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/monthly-recap-october-2024#user-growth-and-notification-achievements-\" class=\"hash-link\" aria-label=\"Direct link to user-growth-and-notification-achievements-\" title=\"Direct link to user-growth-and-notification-achievements-\">​</a></h3>\n<p>Push Protocol continues to witness incredible traction:</p>\n<ul>\n<li><strong>34,094</strong>&nbsp;new subscribers, reaching a total of&nbsp;<strong>279,270 subscribers</strong>.</li>\n<li><strong>9.12 million new notifications</strong>&nbsp;were sent, reaching a cumulative&nbsp;<strong>128.59 million</strong>&nbsp;since launch.</li>\n<li><strong>40,373 users</strong>&nbsp;are actively engaging in&nbsp;<strong>Push Chat</strong>&nbsp;(+86.9% MoM) with&nbsp;<strong>7,300 active users</strong>.</li>\n</ul>\n<p>These metrics are a testament to the growing interest in secure, on-chain communication, and we’re excited to bring in even more innovative updates in the coming months.</p>\n<h3 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"development-highlights\"><strong>Development Highlights:</strong><a href=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/monthly-recap-october-2024#development-highlights\" class=\"hash-link\" aria-label=\"Direct link to development-highlights\" title=\"Direct link to development-highlights\">​</a></h3>\n<p><strong>Push DApp</strong></p>\n<ul>\n<li><strong>The <a href=\"https://app.push.org/points\" target=\"_blank\" rel=\"noopener noreferrer\">Push Points Program</a></strong>&nbsp;launched.</li>\n<li><strong>A new <a href=\"https://app.push.org/channels?chain=1&amp;category=All\" target=\"_blank\" rel=\"noopener noreferrer\">UI</a> for channel listings</strong>&nbsp;and an improved channel dashboard were moved to the review and testing phases.</li>\n<li>The&nbsp;<strong>‘Reply to’</strong>&nbsp;feature on Push Chat was released, making interactions more seamless.</li>\n<li><strong>In-app notifications, as a feature, was</strong> sent to the testing phase.</li>\n<li>Several&nbsp;<strong>UI enhancements and fixes</strong>&nbsp;were completed, further refining the user experience.</li>\n</ul>\n<p><strong>Mobile App</strong></p>\n<ul>\n<li>An&nbsp;<strong>Android-optimized version was released to</strong> improve accessibility.</li>\n<li>A new engineer was onboarded to the team to drive further mobile app enhancements.</li>\n</ul>\n<p><strong>Website Updates</strong></p>\n<ul>\n<li>We published comprehensive&nbsp;<strong>Push Points Program <a href=\"https://push.org/docs/rewards/\" target=\"_blank\" rel=\"noopener noreferrer\">documentation</a></strong>.</li>\n<li>We released several blog posts on topics like&nbsp;<a href=\"https://push.org/blog/introducing-the-push-points-program/\" target=\"_blank\" rel=\"noopener noreferrer\">**Push Points</a>, <a href=\"https://push.org/blog/abstracting-chains-for-better-dapp-ux/\" target=\"_blank\" rel=\"noopener noreferrer\">CCR Features</a>**, <a href=\"https://push.org/blog/what-is-decentralized-social-media/\" target=\"_blank\" rel=\"noopener noreferrer\">decentralized social media</a>, and <a href=\"https://push.org/blog/\" target=\"_blank\" rel=\"noopener noreferrer\">consumer crypto themes</a>, contributed by community members.</li>\n<li>We enhanced review and testing with the deploy preview functionality and migrated the production build from Vercel to the GitHub pages for improved efficiency.</li>\n</ul>\n<p><strong>SDK &amp; Backend Updates</strong></p>\n<ul>\n<li><strong>The chat Reply Feature</strong>&nbsp;implementation was completed and sent to testing.</li>\n<li>We updated the&nbsp;<strong>notification card UI</strong>&nbsp;and finished priority bug fixes.</li>\n<li>Backend improvements for&nbsp;<strong>scalability and stability</strong>&nbsp;were made to accommodate higher traffic, with horizontal scaling and new project integrations.</li>\n</ul>\n<p><strong>Smart Contract Developments</strong></p>\n<ul>\n<li>We completed testing, scripts, and changes to the&nbsp;<strong>Rust Smart Contract</strong>.</li>\n<li><strong>Push Core V3</strong>&nbsp;underwent its first implementation and review.</li>\n<li>We progressed with the&nbsp;<strong>CCR development</strong>&nbsp;with mainnet preparations and conducted audits on&nbsp;<strong>Cairo contracts</strong>&nbsp;to ensure robust security.</li>\n</ul>\n<h3 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"ecosystem-growth\"><strong>Ecosystem Growth</strong><a href=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/monthly-recap-october-2024#ecosystem-growth\" class=\"hash-link\" aria-label=\"Direct link to ecosystem-growth\" title=\"Direct link to ecosystem-growth\">​</a></h3>\n<p>November saw major ecosystem updates in this sphere, with exciting integrations and partnerships that amplify our protocol’s reach:</p>\n<p><strong>Integration Milestones</strong></p>\n<ul>\n<li><a href=\"https://app.push.org/channels/0x65bB67c2416186aE3107F7c2C6728b272a579e3d\" target=\"_blank\" rel=\"noopener noreferrer\"><strong>Revoke Cash</strong></a>&nbsp;now sends real-time alerts for token approvals, ensuring users have timely prompts to revoke approvals as needed.</li>\n<li><a href=\"https://app.push.org/channels/0xf1A1542Ca902AE861B59bffE77D92E8CD76146f1\" target=\"_blank\" rel=\"noopener noreferrer\"><strong>HyperLiquid</strong></a>&nbsp;integrated&nbsp;<strong>Push notifications</strong>&nbsp;to offer real-time updates on liquidations and position changes.</li>\n<li><a href=\"https://x.com/pushprotocol/status/1846784886457184359\" target=\"_blank\" rel=\"noopener noreferrer\">DePerp Labs</a> integrated Push Chat making the DePerp experience far richer than ever before.</li>\n<li><a href=\"https://x.com/unstoppableweb/status/1839653386339107064\" target=\"_blank\" rel=\"noopener noreferrer\"><strong>Unstoppable Domains</strong></a>&nbsp;(UD) wallet now supports&nbsp;<strong>end-to-end encrypted messaging</strong>&nbsp;between domain owners, leveraging Push for more secure communication.</li>\n<li>Contributors at Cartesi created an <a href=\"https://push.org/blog/how-developers-can-integrate-cartesi-and-push-protocol/\" target=\"_blank\" rel=\"noopener noreferrer\">integration template</a> for developers to leverage web3 notifications for Cartesi DApps enabling DApps built on Cartesi to integrate Push’s notification services within 5 minutes or less.</li>\n<li><a href=\"https://news.fuse.io/fuse-partners-with-push-protocol-to-enhance-communication-for-web3-dapps/\" target=\"_blank\" rel=\"noopener noreferrer\">Fuse Network</a> kicked off their partnership with Push for enabling wallet-to-wallet messaging in addition to structuring and launching Push notifications for applications built on Fuse.</li>\n</ul>\n<p><strong>Push Points Partner Collaborations</strong></p>\n<p>Push Points rolled out collaborations with&nbsp;<a href=\"https://app.push.org/channels/0xf198eBCc8dB86F707bAdDdBa236aB5b619c59D3c\" target=\"_blank\" rel=\"noopener noreferrer\">**QuickSwap</a>, <a href=\"https://app.push.org/channels/0x90A48D5CF7343B08dA12E067680B4C6dbfE551Be\" target=\"_blank\" rel=\"noopener noreferrer\">ShapeShift</a>, <a href=\"https://app.push.org/channels/0xBc28359C93cA00A5724fe398606f27e43007C22D\" target=\"_blank\" rel=\"noopener noreferrer\">Cyber</a>, <a href=\"https://app.push.org/channels/0x991552E1C2A96D0Ae72E19552b08A1889aebCF53\" target=\"_blank\" rel=\"noopener noreferrer\">PWN</a>, <a href=\"https://app.push.org/channels/0x65bB67c2416186aE3107F7c2C6728b272a579e3d\" target=\"_blank\" rel=\"noopener noreferrer\">Revoke Cash</a>,**&nbsp;and&nbsp;<a href=\"https://app.push.org/channels/0xdbBc2Ac8cb8D02B26F165b4BC120fd4b14DA6cDA\" target=\"_blank\" rel=\"noopener noreferrer\">**Unstoppable Domains**</a>&nbsp;to bring Push Points to life and ensure that it scales as a program.</p>\n<p><strong>Channel Growth Highlights</strong></p>\n<ul>\n<li><a href=\"https://app.push.org/channels/0x983110309620D911731Ac0932219af06091b6744\" target=\"_blank\" rel=\"noopener noreferrer\"><strong>ENS Domains</strong></a>&nbsp;achieved a new milestone with&nbsp;<strong>7,500+ subscribers</strong>.</li>\n<li><a href=\"https://app.push.org/channels/0xf198eBCc8dB86F707bAdDdBa236aB5b619c59D3c\" target=\"_blank\" rel=\"noopener noreferrer\"><strong>QuickSwap</strong></a>&nbsp;saw rapid growth, surpassing&nbsp;<strong>1,500 subscribers</strong>.</li>\n<li><a href=\"https://app.push.org/channels/0x90A48D5CF7343B08dA12E067680B4C6dbfE551Be\" target=\"_blank\" rel=\"noopener noreferrer\">Shapeshift</a> and <a href=\"https://app.push.org/channels/0x57cD6665e725232123F5250328E35Db6ABf6d80C\" target=\"_blank\" rel=\"noopener noreferrer\">Rekt</a> also hit major milestones of 30,000+ subscribers and 2,100+ subscribers respectively.</li>\n</ul>\n<h3 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"dao-updates\"><strong>DAO Updates</strong><a href=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/monthly-recap-october-2024#dao-updates\" class=\"hash-link\" aria-label=\"Direct link to dao-updates\" title=\"Direct link to dao-updates\">​</a></h3>\n<p>Push Protocol’s DAO initiatives reflect our dedication to community-driven growth and strategic transparency:</p>\n<p><strong>Strategic and Operational Developments</strong></p>\n<ul>\n<li><strong>Push Grants</strong>&nbsp;saw an all-time high in applications, with <a href=\"https://app.charmverse.io/push-dao/proposals?viewId=all\" target=\"_blank\" rel=\"noopener noreferrer\">over 30 inbound applications.</a></li>\n<li>We secured 5 soft commitments for 2025’s app-focused Push Grants program.</li>\n<li>We increased the contributor base by&nbsp;<strong>8x</strong>&nbsp;since March 2024.</li>\n</ul>\n<p><strong>Governance &amp; Transparency</strong></p>\n<ul>\n<li>We published the DAO’s <a href=\"https://gov.push.org/t/push-dao-2024-q3-transparency-report/1945\" target=\"_blank\" rel=\"noopener noreferrer\">first quarterly&nbsp;<strong>transparency report</strong>.</a></li>\n<li>We passed a&nbsp;<strong>Sybil resistance</strong>&nbsp;upgrade proposal, strengthening DAO governance.</li>\n<li>We began establishing a strategic framework for 2025, some of which has already begun to show <a href=\"https://gov.push.org/\" target=\"_blank\" rel=\"noopener noreferrer\">in proposals on the forum</a>.</li>\n</ul>\n<p><strong>Community Initiatives</strong></p>\n<ul>\n<li>We partnered with&nbsp;<strong>Unstoppable Domains</strong>&nbsp;as a Push Points partner.</li>\n<li>We architected the strategy and sourced the tooling needed for the launch of the&nbsp;<strong>PushCast podcast</strong>&nbsp;(launching in November).</li>\n<li>We supported two Devcon attendees through our&nbsp;<a href=\"https://devcon.org/en/\" target=\"_blank\" rel=\"noopener noreferrer\">**Devcon</a> Scholar Initiative**.</li>\n<li>We began developing more transparent contributor pathways for 2025, showcasing how contributors can grow within the ecosystem. As with all Push DAO strategy changes for 2025, we’ll share the frameworks publicly in their final form, in December.</li>\n</ul>\n<p><strong>Workshops and Events</strong></p>\n<p>Our commitment to Web3 education and ecosystem expansion continued through November with several events and speaking engagements:</p>\n<p><strong>Major Events &amp; Sponsorships</strong></p>\n<ul>\n<li>We sponsored the&nbsp;<a href=\"https://x.com/pushprotocol/status/1842082904999903367\" target=\"_blank\" rel=\"noopener noreferrer\">Invisible Gardens</a> camp&nbsp;in Chiang Mai, Thailand, showcasing how to build consumer-ready apps with Push Protocol SDKs.</li>\n<li>Harsh Rajat represented Push on a panel at&nbsp;<a href=\"https://www.binanceblockchainweek.com/event/b7fbe2af-9ab6-4bb2-b78b-486c4d1fa80f/websitePage:9ec1ee53-cbdd-4234-8f04-fb70d6f7ad2e\" target=\"_blank\" rel=\"noopener noreferrer\"><strong>Binance Blockchain Week</strong></a>&nbsp;in Dubai.</li>\n</ul>\n<p><strong>Community Education &amp; Developer Evangelism</strong></p>\n<ul>\n<li>We conducted an&nbsp;<a href=\"https://www.youtube.com/watch?v=60t101ro2uM\" target=\"_blank\" rel=\"noopener noreferrer\"><strong>Ekolance Workshop</strong></a>, a grantee-hosted session on building Web3 DApps with Push tech.</li>\n<li>Our DAO Lead, Ian LeViness, participated in a&nbsp;<a href=\"https://x.com/pushprotocol/status/1849401395147055525\" target=\"_blank\" rel=\"noopener noreferrer\"><strong>SocialFi panel</strong></a>&nbsp;on X alongside partners such as&nbsp;<strong>Conflux</strong>&nbsp;and&nbsp;<strong>Unstoppable Domains</strong>.</li>\n<li>Ian also represented the ecosystem on several podcasts, including&nbsp;<a href=\"https://www.youtube.com/watch?v=Mc_wp_4zNvQ&amp;list=PLu0fIscp1uLKza4WMSCl76C5VdK9l0Tll&amp;index=49\" target=\"_blank\" rel=\"noopener noreferrer\">**The Silicon Dreams</a> Podcast**&nbsp;and&nbsp;<a href=\"https://www.youtube.com/watch?v=Ysy-jV0tiUU\" target=\"_blank\" rel=\"noopener noreferrer\">**Jax Dwyer’s</a> Podcast**, promoting Push’s vision and community.</li>\n<li>We also booked several more podcast appearances for November and December, which will be included in the following reports.</li>\n</ul>\n<h3 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"looking-ahead\"><strong>Looking Ahead</strong><a href=\"https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/monthly-recap-october-2024#looking-ahead\" class=\"hash-link\" aria-label=\"Direct link to looking-ahead\" title=\"Direct link to looking-ahead\">​</a></h3>\n<p>With many exciting updates on our <a href=\"https://push.org/docs/roadmap/\" target=\"_blank\" rel=\"noopener noreferrer\">roadmap</a>, we’re thrilled to push the boundaries of Web3 communication as we approach the new year. Stay tuned for December updates as we continue to innovate and enhance our ecosystem. Your support drives us forward!</p>\n<p>Let’s keep pushing! 🌍🚀</p>",
            "url": "https://push-protocol.github.io/push-website/pr-preview/pr-965/blog/monthly-recap-october-2024",
            "title": "Push Protocol Monthly Updates - October",
            "summary": "Push Protocol Monthly Updates - October",
            "date_modified": "2024-11-15T00:00:00.000Z",
            "author": {
                "name": "Push Protocol",
                "url": "https://twitter.com/pushprotocol"
            },
            "tags": [
                "Updates",
                "Announcements",
                "Community & Ecosystem"
            ]
        }
    ]
}