{
    "version": "https://jsonfeed.org/version/1",
    "title": "Push | The Communication Protocol of Web3 Blog",
    "home_page_url": "https://push.org/blog",
    "description": "Push | The Communication Protocol of Web3 Blog",
    "items": [
        {
            "id": "https://push.org/blog/cold-start-solutions-scaling-consumer-crypto",
            "content_html": "<p><img loading=\"lazy\" alt=\"Cover Image of Cold Start Solutions: Scaling Consumer Crypto\" src=\"https://push.org/assets/images/cover-image-d6b3f4c7b0a309b6fa28467819b2461d.webp\" width=\"1920\" height=\"1080\" class=\"img_ev3q\"></p>\n<p>We’ve gone from wen moon to wen widespread adoption? We, as builders, stick around in this wild, wonderful space we call home because we envision a more transparent, fairer, and overall better internet.</p>\n<p>We want social networks that we’re never actually locked into. We want user-run apps. We envision a world in which we truly own what we share online, whether that’s our messages, our photos, or simply, our data.</p>\n<p>Ownership of the internet by the collective rather than the few is and always will be a key part of what we’re all doing here. Still, why do 95% of consumers know what crypto is but only 22% actively use anything that constitutes a “crypto application?” How do we reach an age in which Dapps are just apps and in which web3 is just “the internet?”</p>\n<p>How do we unify the world under one banner?</p>\n<p>To even begin to answer any of these questions, we need to both understand why we haven’t quite crossed the chasm. We’ve redefined what the financial system and, the internet as a whole can be, but we haven’t gotten the greater global population to buy in.</p>\n<p>By looking at how different projects, networks, and platforms, both in and outside of crypto, have overcome the \"cold start problem,\" you can piece together a playbook to set your Dapp up to cross the chasm to widespread adoption.</p>\n<p>For our purposes, we’ll be examining all cases under the umbrella of platforms, since almost every popular app, Dapp, or network today has turned out to be one.</p>\n<h3 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"what-is-the-cold-start-problem-and-why-should-anyone-care\">What is the Cold Start Problem and why should anyone care?<a href=\"https://push.org/blog/cold-start-solutions-scaling-consumer-crypto#what-is-the-cold-start-problem-and-why-should-anyone-care\" class=\"hash-link\" aria-label=\"Direct link to What is the Cold Start Problem and why should anyone care?\" title=\"Direct link to What is the Cold Start Problem and why should anyone care?\">​</a></h3>\n<p>You’ve built an app. You believe it’s the next place where everyone will gather to connect and share content online. It’s going to be the next member of the “billion users club.”</p>\n<p>Everything’s in place technically and yet, there’s one problem. You don’t have any users and you don’t have anything for them to share.</p>\n<p>If you’ve built an Airbnb without listings and users, a YouTube without videos, or a social network without content and users, then you’ve faced the cold start problem. Trying to figure out how to set the right baseline of producers(or just content) and consumers to set your app(or platform) up for success means solving the cold start problem.</p>\n<p>In the context of web3, a cold start refers to launching a Dapp that has no user base yet. Alternatively, it can be defined as determining how to attract an initial user base that will engage with the Dapp in the exact ways needed to scale it from 0 to a wide audience.</p>\n<p>Knowing how to address the cold start problem requires understanding how others have already done so and there’s no better place to begin than with some of web2’s most explosive successes.</p>\n<h3 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"zoom-its-easy-and-it-just-works\">Zoom: It’s easy and it just works<a href=\"https://push.org/blog/cold-start-solutions-scaling-consumer-crypto#zoom-its-easy-and-it-just-works\" class=\"hash-link\" aria-label=\"Direct link to Zoom: It’s easy and it just works\" title=\"Direct link to Zoom: It’s easy and it just works\">​</a></h3>\n<p>There’s something to be said for a product that’s dedicated to being as reliable as possible and as easy as possible to use. When Zoom rose to prominence during the pandemic, some claimed that its meteoric growth was simply due to luck and timing.</p>\n<p>This, however, is only half of the truth.</p>\n<p>They had both the right timing and the right product.</p>\n<p>On the surface, Zoom appeared to be just another videoconferencing option, but two key actors prepared it to become the giant it is today. First, it was and continues to be dedicated to making every aspect of the user experience radically simple. You could and can still join a meeting just by clicking a link. Everything from reacting to a speaker to sending a message to changing your background, to integrating your planned meetings with your calendar was made as easy as possible to do.</p>\n<p>During a time when we were more desperate than ever to connect with people, it became the most reliable option. The fact that it continued to run nearly seamlessly for up to 100 users per meeting via the free tier and 300+ on the higher tiers only added to its popularity.</p>\n<p>Perhaps you’ll find Zoom’s example to be inspiring and perhaps not. Admittedly, Zoom has now also faced its share of issues. Even so, web3 builders can still learn from its team’s dedication to facilitating seamless onboarding and making the product “just work” above all else.</p>\n<p><strong>Key takeaways from Zoom’s example:</strong></p>\n<ul>\n<li>Reducing the number of signatures required for sign-up to your Dapp</li>\n<li>Simplifying the process of initiating transactions</li>\n<li>Integrating solutions similar to <a href=\"https://push.org/blog/cross-chain-requests-pre-pip/\" target=\"_blank\" rel=\"noopener noreferrer\">Push’s Cross Chain Requests</a> to take the hassle of bridging and related actions away from the end-user</li>\n<li>Stripping away complexity that could cause performance issues in the early days and focusing on the core functionalities that are explicitly needed</li>\n<li>Beta testing, through multiple iterations in a gamified fashion with points or even tokens to ensure your MVP just works</li>\n<li>Releasing your MVP once it’s clear it will run without major issues</li>\n<li>Adding new features with direct user input through community calls, surveys, and other direct methods like the governance process, as your Dapp’s user base grows</li>\n</ul>\n<p>With a list such as the above, you’ll be off to a good start. Still, having a killer product is only one piece of the puzzle. Solving the cold start problem also means having the right mix of users in place, or, as Alexis Ohanian puts it, “the minimum viable community,” from day one.</p>\n<h3 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"bank-of-america-and-bitcoin-atomic-networks-lead-to-hyperscaling\">Bank of America and Bitcoin: Atomic Networks Lead to Hyperscaling<a href=\"https://push.org/blog/cold-start-solutions-scaling-consumer-crypto#bank-of-america-and-bitcoin-atomic-networks-lead-to-hyperscaling\" class=\"hash-link\" aria-label=\"Direct link to Bank of America and Bitcoin: Atomic Networks Lead to Hyperscaling\" title=\"Direct link to Bank of America and Bitcoin: Atomic Networks Lead to Hyperscaling\">​</a></h3>\n<p>To define “minimum viable community,” and why it matters, let’s begin by considering the invention of the consumer credit card. On September 18, 1958, Bank of America mailed the first credit cards to 60,000 residents of Fresno, California. These cards were pre-loaded with $300-$500 of credit and required no application process.</p>\n<p>In one day, 60,000 cardholders came into being. This resulted in 300 Fresno-based merchants signing up to support Bank of America’s new network. In just over a year, that network grew to 2 million cardholders and 20,000 merchants.</p>\n<p>Bank of America’s gamble worked because it wasn’t a gamble. Their first cardholders weren’t randomly selected. At the time of the launch, 45% of Fresno residents had some sort of relationship with the bank, making Fresno the ideal spot for the first atomic network for their new credit card.</p>\n<p>With their experience with Fresno in hand, the bank was able to repeat the same success repeatedly leading to their meteoric rise to prominence in the nascent space of consumer credit.</p>\n<p>This is an atomic network, a unique, intentional matching of consumers and producers that just works and can be repeated to scale a networked product.</p>\n<p>All successful platforms started in this manner. Still, the atomic network is only one part of the battle. Without a killer product to drive to it, your chances of scaling are virtually non-existent.</p>\n<p>Take Bitcoin, for example.</p>\n<p>In 2009, when it launched, it already had pre-set users. The cypherpunk community. These individuals believed in widespread financial freedom, the right to privacy, and every other aspect of what is still the wind beneath the wings of the crypto industry. With the cypherpunks as its first atomic network, Bitcoin launched and continued to scale without a central authority.</p>\n<p><strong>Key takeaways from Bank of America and Bitcoin itself:</strong></p>\n<ul>\n<li>Starting with a specific area or online community where people need what you're offering</li>\n<li>Zeroing in on that using similar approaches to how Bank of America built out its credit network and how Bitcoin built out its initial atomic network for future scale</li>\n<li>Making sure your product addresses a need expressed in the values of the group or groups involved</li>\n<li>Determining through your initial connection with that group or groups what features address a real need for them</li>\n<li>Launching with a small set of features that directly address what this initial atomic network or MVC needs</li>\n<li>Iterating and expanding based on user feedback and direct usage patterns that arise in your MVC</li>\n<li>Using your initial atomic network or MVC as a model for growth into new markets and leveraging the same messaging and overall values that attracted your pioneers</li>\n</ul>\n<p>Killer products with the right atomic networks can set a Dapp up for explosive growth but you won’t gain and retain your initial atomic network without solving for the power users first.</p>\n<p>Whether we’re speaking about a web2 app like Zoom or Bitcoin, the digital gold itself, the principle remains the same.</p>\n<h3 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"wikipedia-ethereum-and-daos-solve-for-the-core-contributors-first\">Wikipedia, Ethereum, and DAOs: Solve for the Core Contributors First<a href=\"https://push.org/blog/cold-start-solutions-scaling-consumer-crypto#wikipedia-ethereum-and-daos-solve-for-the-core-contributors-first\" class=\"hash-link\" aria-label=\"Direct link to Wikipedia, Ethereum, and DAOs: Solve for the Core Contributors First\" title=\"Direct link to Wikipedia, Ethereum, and DAOs: Solve for the Core Contributors First\">​</a></h3>\n<p>Last but not least, let’s say you have a killer, easy-to-use product and a potential atomic network, but you’re struggling with attracting your first creators.</p>\n<p>“Creator,” in this context, may be considered synonymous with “producer.”  Youtubers, Bitcoin miners, developers, or even Wikipedia editors, it’s all the same in this respect. In today’s day and age where we’re trending more and more towards every app involving a two-sided exchange, it’s never been more crucial to attract and retain the right creators from the get-go.</p>\n<p>For instance, Wikipedia is largely maintained by 0.02% of its users, who create and edit articles for free. They do so both because they deeply connect with Wikipedia’s vision of “free access to all human knowledge,” and because of the relative prestige their work gains them within their community.</p>\n<p>In short, they join the effort and stay with it because they need to see the vision realized. DAOs work in the same manner. So do many crypto projects, including Ethereum itself which has consistently been able to attract and retain builders from all over the world due to its commitment to being the world computer that anyone can build on.</p>\n<p>The vision rules. The core contributors create the environment for ideal collaboration which scales the network to new heights.</p>\n<p>Wikipedia found its core contributors through sharing its vision across communities that were most likely to resonate with it, like Nupedia, and Slashdot. DAOs tend to publish manifestos, constitutions, or similar documents from day one to do the same. Ethereum used its early technical papers and its ICO, together with memorable appearances at industry events, as jump-off points.</p>\n<p>In all of these cases, the founding teams led with incredible attention to detail related to who their initial target market was.</p>\n<p>Still, creating an environment that incentivizes consistent growth is incredibly difficult.</p>\n<p>Some Dapps will choose to start by surveying their core community and creating a shared vision and set of values as a collective. Some will do so via a delegation representing the whole community. Others won’t need decentralized governance of any kind until the later stages of their development.</p>\n<p>While there’s no one-size-fits-all approach to attracting and keeping the first producers or “core contributors” to your Dapp’s growth, there are principles that tend to work across the board.</p>\n<p>The below is an attempt at mapping out the steps of that effort.</p>\n<p><strong>Key takeaways from Wikipedia, Ethereum, and DAOs:</strong></p>\n<ul>\n<li>Creating an impactful vision and using successful vision-driven projects as jump-offs or inspirations for doing so</li>\n<li>Aligning your project's vision with the values of your most active users</li>\n<li>Publishing a manifesto or a similar document indicating what you stand for and why people should care about what you are doing</li>\n<li>Creating an environment that fosters collaboration and innovation</li>\n<li>Implementing governance structures and incentives that encourage long-term commitment</li>\n<li>Ensuring that any change or new effort you put into place is a value add for your core contributors</li>\n<li>Making paths to further growth clear to every community member, whether that’s how an ambassador rises to core status or something else entirely</li>\n<li>Opening up growth paths to anyone and having them stewarded by your initial core members</li>\n<li>Iterating with community sentiment and realizing that no aspect of your community, even your initial vision, is set in stone forever</li>\n</ul>\n<h3 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"the-consumer-crypto-playbook-a-starting-point\">The Consumer Crypto Playbook: A Starting Point<a href=\"https://push.org/blog/cold-start-solutions-scaling-consumer-crypto#the-consumer-crypto-playbook-a-starting-point\" class=\"hash-link\" aria-label=\"Direct link to The Consumer Crypto Playbook: A Starting Point\" title=\"Direct link to The Consumer Crypto Playbook: A Starting Point\">​</a></h3>\n<p>We’re at a tipping point.</p>\n<p>Both in and outside of the crypto space, almost all popular apps are platforms. Some sort of supplier is meeting some sort of demand. The rise of Bitcoin, Ethereum, and the industry we hold dear today shifted everything further towards this point. Today, crypto-based applications are starting to break through to the mainstream, but we haven’t yet had our breakout moment.</p>\n<p>For now, we’re still sitting on the edge of the chasm towards widespread consumer usage.</p>\n<p>To make our way across, we need the right playbook for scaling Dapps which focuses on simplicity reigning across the user experience, growth beginning and consistently centering on the atomic network, and the hard side being solved from the earliest days.</p>\n<p>Our discussion here today is an in-roads. How you address the cold start problem is highly context-specific to what your Dapp’s niche is. With all of the above takeaways at your fingertips, you have the foundation for an early-growth playbook that gets you off to a solid start.</p>\n<p>As you think about any of the areas that we’ve covered here, consider the following questions to help guide you even further:</p>\n<ul>\n<li>How can you abstract away complexity from your networked product to make the user experience as easy as possible from day one?</li>\n<li>What's the deep purpose of the network you're launching?</li>\n<li>Why should people care about that purpose?</li>\n<li>Who are the groups in which you’ll find those people who will become your minimum viable community?</li>\n<li>Where do those groups gather, online or offline?</li>\n<li>How can you most effectively reach them in a way that won’t turn them off from what you’re offering?</li>\n<li>Once you’ve got your minimum viable community, what will keep them involved?</li>\n<li>What incentives will you offer to show in practice that you’re dedicated to your earliest users?</li>\n<li>How will you take in community feedback and how will you show you’re using it in practice?</li>\n<li>How will your product be led over time?</li>\n<li>Will you DAOify or simply decentralize a part of your product?</li>\n</ul>\n<p>We, at Push, envision a world in which the on-chain experience is seamless and Universal Apps negate the need to understand the complexity of switching between chains. For that to happen, we need all hands working together towards the same goal. If you’re a builder who is focused on the nascent area of consumer crypto, consider reaching out to us on our socials and even <a href=\"https://app.charmverse.io/push-dao/proposals\" target=\"_blank\" rel=\"noopener noreferrer\">applying for our grants program</a>, where we’re already shepherding the pioneers towards a future that champions the everyday user.</p>",
            "url": "https://push.org/blog/cold-start-solutions-scaling-consumer-crypto",
            "title": "Cold Start Solutions: Scaling Consumer Crypto",
            "summary": "Cold Start Solutions: Scaling Consumer Crypto",
            "date_modified": "2024-08-30T00:00:00.000Z",
            "author": {
                "name": "Push Protocol",
                "url": "https://twitter.com/pushprotocol"
            },
            "tags": [
                "Push Protocol",
                "Web3",
                "Blockchain Technology"
            ]
        },
        {
            "id": "https://push.org/blog/the-role-of-randomness-in-push-nodes",
            "content_html": "<p><img loading=\"lazy\" alt=\"Cover Image of The Role of Randomness in Push Nodes \" src=\"https://push.org/assets/images/cover-image-4f0c05c1273995c7ca8bf139ed4b9a0b.webp\" width=\"2000\" height=\"1125\" class=\"img_ev3q\"></p>\n<p>One important aspect of decentralized networks is that they don’t have any central authority that governs their working mechanism. This means, the network must create a system and rules that allows them to not just securely communicate but to also form a consensus on the overall state of the network.</p>\n<p>While it's a complicated task and there exists a plethora of imperative ingredients that enable security and fairness in a decentralized network, one of the most significant ones is randomness.</p>\n<p>Randomness, in its simplest form, refers to the lack of pattern or predictability in events. It's a concept that plays a crucial role in various fields, from mathematics and computer science to nature itself. Randomness is what makes a dice roll unpredictable, ensures fairness in games, and powers the algorithms behind secure cryptographic systems. In technology, especially within decentralized networks, randomness serves as a fundamental building block that underpins security and fairness, ensuring that processes are free from bias and manipulation.</p>\n<p>In this article, we explore the significance of randomness in decentralized networks and how Push nodes incorporate randomness to enhance the security of the Push network.</p>\n<h3 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"why-do-we-even-need-randomness\">Why do we even need Randomness?<a href=\"https://push.org/blog/the-role-of-randomness-in-push-nodes#why-do-we-even-need-randomness\" class=\"hash-link\" aria-label=\"Direct link to Why do we even need Randomness?\" title=\"Direct link to Why do we even need Randomness?\">​</a></h3>\n<p>To begin with, let’s understand the importance of Randomness in decentralized networks.</p>\n<p>As previously mentioned, decentralized networks don’t have a central authority. Instead, they are made of a group of nodes located at different parts of the world. These nodes are responsible to act and perform certain actions in the network to keep it functional.</p>\n<p>The selection of nodes to perform specific tasks must happen in a decentralized and fair manner to ensure no single actor in the network is capable of controlling the operations of the network.</p>\n<p>This is where randomness plays a critical role.</p>\n<p>In such decentralized systems, randomness is used to ensure the unpredictability of various processes, such as selecting validators, generating cryptographic keys, etc.</p>\n<p>This unpredictability is essential to prevent malicious actors from gaining control or manipulating the network. For example, in consensus mechanisms like Proof of Stake, a random selection of validators ensures that no single participant can dominate the process, thereby maintaining the decentralized nature of the network involved.</p>\n<p>Randomness also enhances the resilience of blockchains by making it difficult for attackers to predict or influence outcomes. This unpredictability protects against various attacks, such as Sybil attacks or collusion, where adversaries attempt to gain disproportionate control over a network.</p>\n<p>Moreover, randomness is vital in achieving fairness as it helps ensure that every participant has an equal opportunity to contribute and benefit from a network, regardless of their resources or influence.</p>\n<p>Now that we have a basic understanding of how crucial randomness is, let’s understand its how Push Nodes use randomness to enhance their security and fairness.</p>\n<h3 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"quick-glance-at-push-nodes\">Quick Glance at Push Nodes<a href=\"https://push.org/blog/the-role-of-randomness-in-push-nodes#quick-glance-at-push-nodes\" class=\"hash-link\" aria-label=\"Direct link to Quick Glance at Push Nodes\" title=\"Direct link to Quick Glance at Push Nodes\">​</a></h3>\n<p><a href=\"https://push.org/blog/explaining-push-nodes/\" target=\"_blank\" rel=\"noopener noreferrer\">Push Nodes</a> are a significant step towards the decentralized infrastructure for web3’s leading communication layer, the Push Protocol Network. This network is designed to facilitate secure and efficient movement of web3 notifications.</p>\n<p>The Push Network comprises different types of nodes such as Validator Nodes, Storage nodes, etc. A smart contract guards the network to maintain node staking and slashing. This is where the PUSH token is used.</p>\n<h3 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"how-the-push-network-uses-randomness-to-enhance-its-security\">How the Push Network uses Randomness to enhance its Security<a href=\"https://push.org/blog/the-role-of-randomness-in-push-nodes#how-the-push-network-uses-randomness-to-enhance-its-security\" class=\"hash-link\" aria-label=\"Direct link to How the Push Network uses Randomness to enhance its Security\" title=\"Direct link to How the Push Network uses Randomness to enhance its Security\">​</a></h3>\n<p>In this section, we will specifically understand the complete mechanism of how a transaction is submitted onto Push network and the role of randomness involved in the process.</p>\n<p>In the Push Network, the role of randomization is incorporated at multiple levels which allows the network to prevent centralization while ensuring that it remains resilient against a variety of attacks.</p>\n<p>A crucial security mechanism of the Push Chain is the randomized selection of validators for transaction validation or block production. This mechanism leverages cryptographic randomness to ensure an unpredictable selection of validators &amp;&nbsp;attestants ( <em>who verify whether or not a transaction is legit</em> ) to enhance the network’s resilience and fairness.</p>\n<p>A brief overview of the process looks something like this:</p>\n<ul>\n<li>To send a transaction to the network, the SDK/sender must attach a randomly generated token number to the transaction.</li>\n<li>To fetch this token, the SDK can request the same from any validator.</li>\n<li>Once received, the SDK attaches this token to the transaction and sends it to the network.</li>\n<li>The network then uses this random token to cryptographically decide the specific validator to verify the particular transaction for further processing.</li>\n<li>Additionally, the validator also randomly decides the validator set responsible for attesting to the transaction.</li>\n</ul>\n<h3 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"now-lets-dive-deeper-into-the-randomness-of-the-push-network\"><strong>Now, let’s dive deeper into the Randomness of the Push Network:</strong><a href=\"https://push.org/blog/the-role-of-randomness-in-push-nodes#now-lets-dive-deeper-into-the-randomness-of-the-push-network\" class=\"hash-link\" aria-label=\"Direct link to now-lets-dive-deeper-into-the-randomness-of-the-push-network\" title=\"Direct link to now-lets-dive-deeper-into-the-randomness-of-the-push-network\">​</a></h3>\n<p>The Push SDK selects a random validator (VR1) to generate a special signed (RANDX) hex token.</p>\n<p>The generation is performed as follows:</p>\n<ol>\n<li>\n<p><strong>Generation of a Random Token:</strong></p>\n<p>The network is designed to ensure that a random token cannot merely be generated by a single validator. Instead, it must be a combined effort as every random token is ideally a collection of digitally signed pieces of random numbers provided by specific validators in the network.</p>\n<p>To determine the exact number of such pieces required to form the token, the Validator.sol smart contract defines a parameter called <code>*required_random_number</code>.* This indicates the number of required random peers whose signed values each validator must hold, at a given time. Additionally, the contract also defines an <code>*expiration_time*</code> parameter that defines the expiry time for these tokens which helps ensure that only freshly created tokens can be used for the creation of random tokens.</p>\n<p>It should be kept in mind that validators in the network periodically ping their peers to collect and exchange signed random values. The collected value from each validator is a combination of the random value itself and the validator's signature, ensuring it can be verifiable.</p>\n<div class=\"language-jsx codeBlockContainer_Ckt0 theme-code-block\" style=\"--prism-color:#F8F8F2;--prism-background-color:#282A36\"><div class=\"codeBlockContent_biex\"><pre tabindex=\"0\" class=\"prism-code language-jsx codeBlock_bY9V thin-scrollbar\" style=\"color:#F8F8F2;background-color:#282A36\"><code class=\"codeBlockLines_e6Vv\"><span class=\"token-line\" style=\"color:#F8F8F2\"><span class=\"token plain\">signedRandomValue </span><span class=\"token operator\">=</span><span class=\"token plain\"> value </span><span class=\"token operator\">+</span><span class=\"token plain\"> validatorSignature</span><br></span></code></pre><div class=\"buttonGroup__atx\"><button type=\"button\" aria-label=\"Copy code to clipboard\" title=\"Copy\" class=\"clean-btn\"><span class=\"copyButtonIcons_eSgA\" aria-hidden=\"true\"><svg viewBox=\"0 0 24 24\" class=\"copyButtonIcon_y97N\"><path fill=\"currentColor\" d=\"M19,21H8V7H19M19,5H8A2,2 0 0,0 6,7V21A2,2 0 0,0 8,23H19A2,2 0 0,0 21,21V7A2,2 0 0,0 19,5M16,1H4A2,2 0 0,0 2,3V17H4V3H16V1Z\"></path></svg><svg viewBox=\"0 0 24 24\" class=\"copyButtonSuccessIcon_LjdS\"><path fill=\"currentColor\" d=\"M21,7L9,19L3.5,13.5L4.91,12.09L9,16.17L19.59,5.59L21,7Z\"></path></svg></span></button></div></div></div>\n<p>As a result, at any given moment the validators should have a collection of signed random values by their peers, i.e., <strong><code>signedRandomValue[].</code></strong></p>\n<p>Once a validator has accumulated the necessary signed random values, it can generate the random token. This token is derived from the network's collective randomness using the following formula:</p>\n<div class=\"language-jsx codeBlockContainer_Ckt0 theme-code-block\" style=\"--prism-color:#F8F8F2;--prism-background-color:#282A36\"><div class=\"codeBlockContent_biex\"><pre tabindex=\"0\" class=\"prism-code language-jsx codeBlock_bY9V thin-scrollbar\" style=\"color:#F8F8F2;background-color:#282A36\"><code class=\"codeBlockLines_e6Vv\"><span class=\"token-line\" style=\"color:#F8F8F2\"><span class=\"token maybe-class-name\">RANDX_Token</span><span class=\"token plain\"> </span><span class=\"token operator\">=</span><span class=\"token plain\"> </span><span class=\"token constant\" style=\"color:rgb(189, 147, 249)\">XOR</span><span class=\"token punctuation\" style=\"color:rgb(248, 248, 242)\">(</span><span class=\"token function\" style=\"color:rgb(80, 250, 123)\">sha</span><span class=\"token punctuation\" style=\"color:rgb(248, 248, 242)\">(</span><span class=\"token plain\">signedRandomValue</span><span class=\"token punctuation\" style=\"color:rgb(248, 248, 242)\">[</span><span class=\"token plain\">i</span><span class=\"token punctuation\" style=\"color:rgb(248, 248, 242)\">]</span><span class=\"token punctuation\" style=\"color:rgb(248, 248, 242)\">)</span><span class=\"token punctuation\" style=\"color:rgb(248, 248, 242)\">)</span><span class=\"token plain\"> </span><span class=\"token keyword control-flow\" style=\"color:rgb(189, 147, 249);font-style:italic\">for</span><span class=\"token plain\"> all i</span><br></span></code></pre><div class=\"buttonGroup__atx\"><button type=\"button\" aria-label=\"Copy code to clipboard\" title=\"Copy\" class=\"clean-btn\"><span class=\"copyButtonIcons_eSgA\" aria-hidden=\"true\"><svg viewBox=\"0 0 24 24\" class=\"copyButtonIcon_y97N\"><path fill=\"currentColor\" d=\"M19,21H8V7H19M19,5H8A2,2 0 0,0 6,7V21A2,2 0 0,0 8,23H19A2,2 0 0,0 21,21V7A2,2 0 0,0 19,5M16,1H4A2,2 0 0,0 2,3V17H4V3H16V1Z\"></path></svg><svg viewBox=\"0 0 24 24\" class=\"copyButtonSuccessIcon_LjdS\"><path fill=\"currentColor\" d=\"M21,7L9,19L3.5,13.5L4.91,12.09L9,16.17L19.59,5.59L21,7Z\"></path></svg></span></button></div></div></div>\n<ol>\n<li>\n<p><strong>The SDK Requests for a Random Token</strong></p>\n<p>Next, now let’s understand what happens when the SDK requests for a random token.</p>\n<p>As previously mentioned, before sending any transaction to the network, the SDK&nbsp; requests for a random token that must be attached with the transaction being sent.</p>\n<p>Now, since a random token value has already been generated ( as mentioned in step 1), any validator can provide this random token to the SDK.</p>\n<p>The SDK then attaches this random token to the transaction payloads and sends the transaction to the network.</p>\n</li>\n<li>\n<p><strong>Randomized Selection of Validators</strong></p>\n<p>This random token attached to the transaction plays a crucial role in randomly deciding which validator will process the transaction. With this token, the SDK deciphers the validator ID, to whom it must send the transaction for further processing.</p>\n<div class=\"language-jsx codeBlockContainer_Ckt0 theme-code-block\" style=\"--prism-color:#F8F8F2;--prism-background-color:#282A36\"><div class=\"codeBlockContent_biex\"><pre tabindex=\"0\" class=\"prism-code language-jsx codeBlock_bY9V thin-scrollbar\" style=\"color:#F8F8F2;background-color:#282A36\"><code class=\"codeBlockLines_e6Vv\"><span class=\"token-line\" style=\"color:#F8F8F2\"><span class=\"token plain\">validator_id </span><span class=\"token operator\">=</span><span class=\"token plain\"> </span><span class=\"token function\" style=\"color:rgb(80, 250, 123)\">f</span><span class=\"token punctuation\" style=\"color:rgb(248, 248, 242)\">(</span><span class=\"token plain\"> </span><span class=\"token constant\" style=\"color:rgb(189, 147, 249)\">RANDX_TOKEN</span><span class=\"token punctuation\" style=\"color:rgb(248, 248, 242)\">,</span><span class=\"token plain\"> contract_defaults</span><span class=\"token punctuation\" style=\"color:rgb(248, 248, 242)\">)</span><span class=\"token plain\"></span><br></span><span class=\"token-line\" style=\"color:#F8F8F2\"><span class=\"token plain\" style=\"display:inline-block\"></span><br></span><span class=\"token-line\" style=\"color:#F8F8F2\"><span class=\"token plain\"></span><span class=\"token comment\" style=\"color:rgb(98, 114, 164)\">//OUTPUT looks like: </span><span class=\"token plain\"></span><br></span><span class=\"token-line\" style=\"color:#F8F8F2\"><span class=\"token plain\">validator_id </span><span class=\"token operator\">=</span><span class=\"token plain\"> v1</span><br></span><span class=\"token-line\" style=\"color:#F8F8F2\"><span class=\"token plain\" style=\"display:inline-block\"></span><br></span><span class=\"token-line\" style=\"color:#F8F8F2\"><span class=\"token plain\">where contract </span><span class=\"token keyword module\" style=\"color:rgb(189, 147, 249);font-style:italic\">default</span><span class=\"token plain\"> parameters could be</span><span class=\"token operator\">:</span><span class=\"token plain\"></span><br></span><span class=\"token-line\" style=\"color:#F8F8F2\"><span class=\"token plain\">a</span><span class=\"token punctuation\" style=\"color:rgb(248, 248, 242)\">.</span><span class=\"token plain\"> </span><span class=\"token property-access\">min</span><span class=\"token plain\"> required quantity </span><span class=\"token keyword\" style=\"color:rgb(189, 147, 249);font-style:italic\">of</span><span class=\"token plain\"> random numbers</span><span class=\"token punctuation\" style=\"color:rgb(248, 248, 242)\">,</span><span class=\"token plain\"></span><br></span><span class=\"token-line\" style=\"color:#F8F8F2\"><span class=\"token plain\">b</span><span class=\"token punctuation\" style=\"color:rgb(248, 248, 242)\">.</span><span class=\"token plain\"> </span><span class=\"token property-access\">expiration</span><span class=\"token plain\"> time</span><span class=\"token punctuation\" style=\"color:rgb(248, 248, 242)\">,</span><span class=\"token plain\"></span><br></span><span class=\"token-line\" style=\"color:#F8F8F2\"><span class=\"token plain\">c</span><span class=\"token punctuation\" style=\"color:rgb(248, 248, 242)\">.</span><span class=\"token plain\"> </span><span class=\"token property-access\">a</span><span class=\"token plain\"> minimum number </span><span class=\"token keyword\" style=\"color:rgb(189, 147, 249);font-style:italic\">of</span><span class=\"token plain\"> peers that acknowledge the validator's online status</span><span class=\"token punctuation\" style=\"color:rgb(248, 248, 242)\">.</span><br></span></code></pre><div class=\"buttonGroup__atx\"><button type=\"button\" aria-label=\"Copy code to clipboard\" title=\"Copy\" class=\"clean-btn\"><span class=\"copyButtonIcons_eSgA\" aria-hidden=\"true\"><svg viewBox=\"0 0 24 24\" class=\"copyButtonIcon_y97N\"><path fill=\"currentColor\" d=\"M19,21H8V7H19M19,5H8A2,2 0 0,0 6,7V21A2,2 0 0,0 8,23H19A2,2 0 0,0 21,21V7A2,2 0 0,0 19,5M16,1H4A2,2 0 0,0 2,3V17H4V3H16V1Z\"></path></svg><svg viewBox=\"0 0 24 24\" class=\"copyButtonSuccessIcon_LjdS\"><path fill=\"currentColor\" d=\"M21,7L9,19L3.5,13.5L4.91,12.09L9,16.17L19.59,5.59L21,7Z\"></path></svg></span></button></div></div></div>\n<p>Upon receiving the transaction, the validator checks the random token in the transaction’s payload and validates it to confirm that it has been correctly assigned the role of handling this transaction.</p>\n<p>In case the validator identifies that it has been wrongly chosen, <em><strong>it can reject the transaction.</strong></em></p>\n<p>Once the accurate assignment of the validator is confirmed, the validator now creates a similar randomized process for creating a list of validators who must attest to the transaction being processed.</p>\n<div class=\"language-jsx codeBlockContainer_Ckt0 theme-code-block\" style=\"--prism-color:#F8F8F2;--prism-background-color:#282A36\"><div class=\"codeBlockContent_biex\"><pre tabindex=\"0\" class=\"prism-code language-jsx codeBlock_bY9V thin-scrollbar\" style=\"color:#F8F8F2;background-color:#282A36\"><code class=\"codeBlockLines_e6Vv\"><span class=\"token-line\" style=\"color:#F8F8F2\"><span class=\"token plain\">vlist </span><span class=\"token operator\">=</span><span class=\"token plain\"> </span><span class=\"token function\" style=\"color:rgb(80, 250, 123)\">f</span><span class=\"token punctuation\" style=\"color:rgb(248, 248, 242)\">(</span><span class=\"token maybe-class-name\">RANDX_Token_2nd</span><span class=\"token punctuation\" style=\"color:rgb(248, 248, 242)\">,</span><span class=\"token plain\"> contract_defaults</span><span class=\"token punctuation\" style=\"color:rgb(248, 248, 242)\">)</span><span class=\"token plain\"></span><br></span><span class=\"token-line\" style=\"color:#F8F8F2\"><span class=\"token plain\" style=\"display:inline-block\"></span><br></span><span class=\"token-line\" style=\"color:#F8F8F2\"><span class=\"token plain\"></span><span class=\"token comment\" style=\"color:rgb(98, 114, 164)\">// Output looks like this:</span><span class=\"token plain\"></span><br></span><span class=\"token-line\" style=\"color:#F8F8F2\"><span class=\"token plain\">vlist </span><span class=\"token operator\">=</span><span class=\"token plain\"> </span><span class=\"token constant\" style=\"color:rgb(189, 147, 249)\">V2</span><span class=\"token punctuation\" style=\"color:rgb(248, 248, 242)\">,</span><span class=\"token plain\"> </span><span class=\"token constant\" style=\"color:rgb(189, 147, 249)\">V50</span><span class=\"token punctuation\" style=\"color:rgb(248, 248, 242)\">,</span><span class=\"token plain\"> </span><span class=\"token constant\" style=\"color:rgb(189, 147, 249)\">V11</span><span class=\"token punctuation\" style=\"color:rgb(248, 248, 242)\">,</span><span class=\"token plain\"> </span><span class=\"token constant\" style=\"color:rgb(189, 147, 249)\">V8</span><span class=\"token punctuation\" style=\"color:rgb(248, 248, 242)\">,</span><span class=\"token plain\"> </span><span class=\"token constant\" style=\"color:rgb(189, 147, 249)\">V38</span><span class=\"token punctuation\" style=\"color:rgb(248, 248, 242)\">,</span><span class=\"token plain\"> </span><span class=\"token constant\" style=\"color:rgb(189, 147, 249)\">V17</span><span class=\"token punctuation\" style=\"color:rgb(248, 248, 242)\">,</span><span class=\"token plain\"> </span><span class=\"token constant\" style=\"color:rgb(189, 147, 249)\">V29</span><br></span></code></pre><div class=\"buttonGroup__atx\"><button type=\"button\" aria-label=\"Copy code to clipboard\" title=\"Copy\" class=\"clean-btn\"><span class=\"copyButtonIcons_eSgA\" aria-hidden=\"true\"><svg viewBox=\"0 0 24 24\" class=\"copyButtonIcon_y97N\"><path fill=\"currentColor\" d=\"M19,21H8V7H19M19,5H8A2,2 0 0,0 6,7V21A2,2 0 0,0 8,23H19A2,2 0 0,0 21,21V7A2,2 0 0,0 19,5M16,1H4A2,2 0 0,0 2,3V17H4V3H16V1Z\"></path></svg><svg viewBox=\"0 0 24 24\" class=\"copyButtonSuccessIcon_LjdS\"><path fill=\"currentColor\" d=\"M21,7L9,19L3.5,13.5L4.91,12.09L9,16.17L19.59,5.59L21,7Z\"></path></svg></span></button></div></div></div>\n<p>This list of validators is also responsible for verifying its <strong>legitimacy.</strong></p>\n</li>\n</ol>\n<h3 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"summary\">Summary<a href=\"https://push.org/blog/the-role-of-randomness-in-push-nodes#summary\" class=\"hash-link\" aria-label=\"Direct link to Summary\" title=\"Direct link to Summary\">​</a></h3>\n<p>To summarize, the entire process detailed above adds a security layer with the inclusion of randomization at multiple levels, i.e.,:</p>\n<ul>\n<li><strong>1st Level:</strong> The initial randomization starts with the SDK choosing any random validator to request for a token to be attached to the transaction.</li>\n<li><strong>2nd Level: A token is generated</strong> using digitally signed pieces of random values from multiple random validators instead of relying on any single actor.</li>\n<li><strong>3rd Level: A specific validator is randomly selected</strong> to create the token to be attached in the transaction occurs.</li>\n<li><strong>4th Level:</strong> The final level of randomization determines which specific validator (VR2) will process a transaction and which validator set will act as attestants to verify the transaction.</li>\n</ul>\n<p>This multi-level randomness ensures that at every step, the network is secure, and fair, while continuing to operate in a completely decentralized fashion.</p>\n</li>\n</ol>",
            "url": "https://push.org/blog/the-role-of-randomness-in-push-nodes",
            "title": "The Role of Randomness in Push Nodes",
            "summary": "The Role of Randomness in Push Nodes",
            "date_modified": "2024-08-26T00:00:00.000Z",
            "author": {
                "name": "Push Protocol",
                "url": "https://twitter.com/pushprotocol"
            },
            "tags": [
                "Push Protocol",
                "Web3",
                "Blockchain Technology"
            ]
        },
        {
            "id": "https://push.org/blog/push-protocol-july-updates",
            "content_html": "<p><img loading=\"lazy\" alt=\"Cover Image of Push Protocol Monthly Updates: A Look Back at July\" src=\"https://push.org/assets/images/cover-image-e56fa1d0193551b5f9e87ee825b18077.webp\" width=\"1600\" height=\"840\" class=\"img_ev3q\"></p>\n<p>July was a monumental month for Push Protocol as we hit the huge milestone of <a href=\"https://x.com/pushprotocol/status/1824491148229898313\" target=\"_blank\" rel=\"noopener noreferrer\"><strong>100 Million</strong></a> Push Notifications. More than 8.91 Million Notifications were sent with a cumulative 241k subscribers reached ending the month on a high note marking significant progress in protocol user engagement, development, and community growth.</p>\n<p>With all of this in mind, we are excited to share the highlights:</p>\n<h3 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"product-updates\">Product Updates:<a href=\"https://push.org/blog/push-protocol-july-updates#product-updates\" class=\"hash-link\" aria-label=\"Direct link to Product Updates:\" title=\"Direct link to Product Updates:\">​</a></h3>\n<p>Our <a href=\"https://push.org/\" target=\"_blank\" rel=\"noopener noreferrer\">website</a> has undergone a revamp, as we:</p>\n<ul>\n<li>Updated the <a href=\"https://push.org/docs/\" target=\"_blank\" rel=\"noopener noreferrer\">developer docs</a> and <a href=\"https://push.org/docs/roadmap/\" target=\"_blank\" rel=\"noopener noreferrer\">2024 live roadmap</a>.</li>\n<li>Performed various bug fixes for better UX.</li>\n<li>Uploaded several new <a href=\"https://push.org/blog/\" target=\"_blank\" rel=\"noopener noreferrer\">articles</a> focused on developer engagement and protocol growth announcements.</li>\n</ul>\n<p>Our <a href=\"https://app.push.org/\" target=\"_blank\" rel=\"noopener noreferrer\">DApp</a> has seen significant upgrades, including:</p>\n<ul>\n<li>The debut of a new channel creation flow pipeline. Testing has been initiated for it.</li>\n<li>The protocol and staking analytics overview features being released in the dashboard UI.</li>\n<li>The update of the Development Design System with more components.</li>\n<li>The update of the Font Family throughout the platform.</li>\n<li>The beginning of work on the new Push Points Program.</li>\n<li>The completion of all scheduled priority bug fixes.</li>\n<li>We also enhanced the <a href=\"https://github.com/push-protocol/push-sdk\" target=\"_blank\" rel=\"noopener noreferrer\">Push SDK</a> by optimizing the code as per the new design system and added support for the ERC1155 Gated Chat Groups.</li>\n</ul>\n<p>On the backend, we are:</p>\n<ul>\n<li>Working on improving the response format for our API calls.</li>\n<li>Working on a workflow automation tool that allows Push channels to automate their notification logic without writing a single line of code.</li>\n<li>Working on developing a custom delivery node that delivers notifications to different platforms like Discord/Telegram/email.</li>\n<li>Developing a pricing model for Push channels to leverage the custom delivery node’s capabilities.</li>\n</ul>\n<p>On the Smart Contracts side, we have:</p>\n<ul>\n<li>Added additional functional support that enables the update of channel profiles  from any chain.</li>\n<li>Completed the setup of an extensive mainnet testing framework for the CCR feature.</li>\n<li>Completed the optimizations for additional CCR-related features.</li>\n<li>Extended the optimization phase of development to include the gas optimization of the current Core and Comm contracts.</li>\n</ul>\n<h3 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"partnership-updates\">Partnership Updates:<a href=\"https://push.org/blog/push-protocol-july-updates#partnership-updates\" class=\"hash-link\" aria-label=\"Direct link to Partnership Updates:\" title=\"Direct link to Partnership Updates:\">​</a></h3>\n<p>We're thrilled to announce new partnerships:</p>\n<ol>\n<li>We welcomed <a href=\"https://app.push.org/channels/0xACF193302115b3e1b5E72402657ca3A2A21BeD87\" target=\"_blank\" rel=\"noopener noreferrer\">Rivera</a> -  a liquidity management platform for transforming concentrated positions into DeFi-composable yield tokens who is integrating Push Notifications to enable weekly epoch rewards, APY changes, and more notification alerts for its users.</li>\n<li>We partnered with <a href=\"https://x.com/pushprotocol/status/1810185041793966136\" target=\"_blank\" rel=\"noopener noreferrer\">ETH Uruguay</a> to co-sponsor the Buildathon event, offering bounties for developing projects using Push’s communication services.</li>\n<li>Push Protocol’s long-term partner Unstoppable Domains launched Group Chat powered by Push Protocol for the Crypto ‘<a href=\"https://x.com/sandy_carter/status/1809736115861221675\" target=\"_blank\" rel=\"noopener noreferrer\">Whale</a>’ group and new gated group chats, powered by Push for <a href=\"https://x.com/pushprotocol/status/1816376657915044173\" target=\"_blank\" rel=\"noopener noreferrer\">Stepn</a>, <a href=\"https://x.com/pushprotocol/status/1815356125178728512\" target=\"_blank\" rel=\"noopener noreferrer\">Raiin</a>, and <a href=\"https://x.com/pushprotocol/status/1819715311253307611\" target=\"_blank\" rel=\"noopener noreferrer\">.ubu</a> domain holders.</li>\n</ol>\n<h3 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"ecosystem-highlights\">Ecosystem Highlights:<a href=\"https://push.org/blog/push-protocol-july-updates#ecosystem-highlights\" class=\"hash-link\" aria-label=\"Direct link to Ecosystem Highlights:\" title=\"Direct link to Ecosystem Highlights:\">​</a></h3>\n<ul>\n<li>Push Protocol’s Founder Harsh Rajat joined the <a href=\"https://www.youtube.com/watch?v=-AMYb7UWHQk\" target=\"_blank\" rel=\"noopener noreferrer\"><strong>Digital Duniya Podcast</strong></a> to talk in-depth about the inception of Push Protocol and entrepreneurial tips for early founders, especially from India.</li>\n<li>With Push’s expansion to <a href=\"https://arbitrum.io/\" target=\"_blank\" rel=\"noopener noreferrer\">Arbitrum</a>, we conducted an exclusive <a href=\"https://x.com/i/spaces/1eaKbaEbBekxX\" target=\"_blank\" rel=\"noopener noreferrer\">AMA Twitter Space</a> with Arbitrum ecosystem partners  including <a href=\"https://www.inferium.io/\" target=\"_blank\" rel=\"noopener noreferrer\">Inferium</a>, <a href=\"https://www.logx.trade/\" target=\"_blank\" rel=\"noopener noreferrer\">LogX</a>, and <a href=\"https://factor.fi/\" target=\"_blank\" rel=\"noopener noreferrer\">Factor</a>, moderated by our DAO Lead.</li>\n<li>We successfully conducted the second iteration of our <a href=\"https://push.org/brb/\" target=\"_blank\" rel=\"noopener noreferrer\">Billion Reasons to Build (BRB) Bootcamp</a>, this time on a global scale via an online medium. Over six weeks, the <a href=\"https://x.com/pushbuilders/status/1812855006619423049\" target=\"_blank\" rel=\"noopener noreferrer\">bootcamp</a> attracted 70 participants, featured 10 masterclass lectures, and garnered 60,000+ impressions on social media.</li>\n<li>Further, we hosted Wormhole for a <a href=\"https://x.com/i/spaces/1djxXrbEezOGZ\" target=\"_blank\" rel=\"noopener noreferrer\">Push X Space</a> to discuss how Push will enable not just cross-chain but all-chain communications. Zaryab and Ian joined from our side, with Os from Wormhole’s ecosystem participating as well.</li>\n<li>Push was also invited as a guest at the <a href=\"https://x.com/i/spaces/1yoKMwPwyalJQ\" target=\"_blank\" rel=\"noopener noreferrer\">Koala Wallet’s AMA X Space</a>.</li>\n<li>We are thrilled to share that <a href=\"https://app.push.org/channels/0xe56f1D3EDFFF1f25855aEF744caFE7991c224FFF\" target=\"_blank\" rel=\"noopener noreferrer\">Coindesk</a> - the leading crypto news platform crossed 10k subscribers for its channel on Push.</li>\n<li>We were proud to feature <a href=\"https://app.push.org/channels/0x7239B1896ad2b6A9D3aA6C4B12D8993E78fb67Dc\" target=\"_blank\" rel=\"noopener noreferrer\">DappLooker</a>, <a href=\"https://app.push.org/channels/0x094A1ef2F50F36956a90E410Ffc143362340865c\" target=\"_blank\" rel=\"noopener noreferrer\">Simplified Privacy</a>, <a href=\"https://app.push.org/channels/0x90A48D5CF7343B08dA12E067680B4C6dbfE551Be\" target=\"_blank\" rel=\"noopener noreferrer\">ShapeShift</a>, and <a href=\"https://app.push.org/channels/0x67243d6c3c3bDc2F59D2f74ba1949a02973a529d\" target=\"_blank\" rel=\"noopener noreferrer\">Grantships</a> for the #PushChannelOfTheWeek in July 🔔</li>\n</ul>\n<h3 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"push-governance-and-community-updates\">Push Governance and Community Updates:<a href=\"https://push.org/blog/push-protocol-july-updates#push-governance-and-community-updates\" class=\"hash-link\" aria-label=\"Direct link to Push Governance and Community Updates:\" title=\"Direct link to Push Governance and Community Updates:\">​</a></h3>\n<ul>\n<li>The Push Grants Programs V3 received 19 grant applications. <a href=\"https://dhive.io/\" target=\"_blank\" rel=\"noopener noreferrer\">Dhive</a> - A governance data hub platform and <a href=\"https://www.si3.space/\" target=\"_blank\" rel=\"noopener noreferrer\">Si3</a> - a decentralized media-tech platform became the first official new grantees under the Push Grants V3 Program, which is community-run for the first time in history.</li>\n<li>Our DAO Council member, SixtyKeys landed speaking slots at <a href=\"https://ethsafari.xyz/\" target=\"_blank\" rel=\"noopener noreferrer\">ETH Safari</a> happening this year.</li>\n<li>We onboarded 20 new members to <a href=\"https://gov.push.org/\" target=\"_blank\" rel=\"noopener noreferrer\">Push DAO</a>.</li>\n<li>The Push Alpha Community on Push Chat grew its user base to 500+ participants becoming the largest conditionally gated community on Push DApp.</li>\n<li>Push Protocol received a notable mention in <a href=\"https://www.cryptomarketmap.org/\" target=\"_blank\" rel=\"noopener noreferrer\">Electric Capital’s Crypto Market Map</a>.</li>\n<li>The third iteration of the Push India Ambassador’s program has been formally initiated.</li>\n<li>We also had a booth set up at <a href=\"https://x.com/pushprotocol/status/1811046959353880785\" target=\"_blank\" rel=\"noopener noreferrer\">ETH CC Brussels</a> at the Metamask Building Onchain event, featuring <a href=\"https://snaps.metamask.io/snap/npm/pushprotocol/snap/\" target=\"_blank\" rel=\"noopener noreferrer\">Push Metamask Snap</a>.</li>\n</ul>\n<p>Stay tuned for more updates as we continue to push the boundaries of the Web3 ecosystem.</p>",
            "url": "https://push.org/blog/push-protocol-july-updates",
            "title": "Push Protocol Monthly Updates: A Look Back at July",
            "summary": "Push Protocol Monthly Updates: A Look Back at July",
            "date_modified": "2024-08-23T00:00:00.000Z",
            "author": {
                "name": "Push Protocol",
                "url": "https://twitter.com/pushprotocol"
            },
            "tags": [
                "Push Protocol",
                "Web3",
                "Blockchain Technology"
            ]
        },
        {
            "id": "https://push.org/blog/now-anyone-can-write-for-push-protocol",
            "content_html": "<p><img loading=\"lazy\" alt=\"Cover Image of Now anyone can write for Push\" src=\"https://push.org/assets/images/cover-image-1610fcb762ae65c4cbe377b08bb20d4c.webp\" width=\"1600\" height=\"900\" class=\"img_ev3q\"></p>\n<p>GM Push Fam,</p>\n<p>As we go further down our collective path of decentralization, hand-in-hand with our community, we’re opening up more and more of the ecosystem to be directly led by everyone involved.</p>\n<p>To reach our goal of providing the future of comms and beyond for all, in a truly trustless environment, we need to double-down on championing the opinions of all involved in our ecosystem.</p>\n<p>We need to be not just collective tech for change, but a collective voice for change.</p>\n<p>That’s why today, we’re taking the next step towards Push being a truly collectively run ecosystem.</p>\n<p>We’re opening the doors of our blog to everyone in the greater Push ecosystem.</p>\n<h3 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"who-qualifies\"><strong>Who qualifies?</strong><a href=\"https://push.org/blog/now-anyone-can-write-for-push-protocol#who-qualifies\" class=\"hash-link\" aria-label=\"Direct link to who-qualifies\" title=\"Direct link to who-qualifies\">​</a></h3>\n<p>Everyone.</p>\n<p>Whether you represent a Push channel, a technical partner, a DAO contributor, a grantee, or something else entirely, this is your time.</p>\n<p>Publish an opinion piece with us on one of the themes we’re looking for a the time, and reach our greater community of over 120,000 strong, while contributing to what the collective Push voice becomes.</p>\n<h3 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"what-kinds-of-posts-are-we-looking-for\">What kinds of posts are we looking for?<a href=\"https://push.org/blog/now-anyone-can-write-for-push-protocol#what-kinds-of-posts-are-we-looking-for\" class=\"hash-link\" aria-label=\"Direct link to What kinds of posts are we looking for?\" title=\"Direct link to What kinds of posts are we looking for?\">​</a></h3>\n<p>Currently, we’re accepting ideas related to consumer crypto and improving coordination as well as UX in our industry, with more calls for articles to be added over time to the Push DAO Forum!</p>\n<p>Make sure <a href=\"https://gov.push.org/\" target=\"_blank\" rel=\"noopener noreferrer\">you’re signed up there</a> to view the full process and guidelines for guest posting, including where to submit your drafts, what format to submit them in, who to submit them to, and more!</p>\n<p>Let’s inspire builders and widen the boundaries of innovation, together, both in-code, and in-text!</p>\n<p>Our team’s already curating the first few pieces to be published. Let us review yours.</p>",
            "url": "https://push.org/blog/now-anyone-can-write-for-push-protocol",
            "title": "Now anyone can write for Push",
            "summary": "Now anyone can write for Push",
            "date_modified": "2024-08-20T00:00:00.000Z",
            "author": {
                "name": "Push Protocol",
                "url": "https://twitter.com/pushprotocol"
            },
            "tags": [
                "Push Protocol",
                "Web3",
                "Blockchain Technology"
            ]
        },
        {
            "id": "https://push.org/blog/ama-with-wormhole-for-cross-chain-requests-pre-pip",
            "content_html": "<p><img loading=\"lazy\" alt=\"Cover Image of Push Protocol x Wormhole AMA for the Cross Chain Request Feature in Push V3\" src=\"https://push.org/assets/images/cover-image-87165fed06701e8b218562674f1dacdf.webp\" width=\"1600\" height=\"900\" class=\"img_ev3q\"></p>\n<p>Last week, we debuted Pre-PIP 3 (Push Improvement Proposal) for <a href=\"https://push.org/blog/cross-chain-requests-pre-pip/\" target=\"_blank\" rel=\"noopener noreferrer\">Cross Chain Requests</a> on the <a href=\"https://gov.push.org/t/pre-pip-3-cross-chain-request-feature-in-push-smart-contracts-v3/1794\" target=\"_blank\" rel=\"noopener noreferrer\">Push DAO forum</a> and invited the <a href=\"https://wormhole.com/\" target=\"_blank\" rel=\"noopener noreferrer\">Wormhole</a> team to chat about it, since their tech is a major part of this upgrade.</p>\n<p>Here’s a 3-minute recap for those who couldn’t join in:</p>\n<p>We kicked off the <a href=\"https://x.com/pushprotocol/status/1819017203284578483\" target=\"_blank\" rel=\"noopener noreferrer\">spaces</a> with a bit of alpha on Push’s V3 Smart Contracts and what else is coming up from our side as the 2024 rolls on:</p>\n<ol>\n<li><strong>Launch of On-Chain Governance</strong>: The V3 contracts will introduce on-chain governance, allowing the community to govern smart contract execution.</li>\n<li><strong>Optimized Contracts:</strong> Push’s V3 contracts will be more efficient. They’ll be capable of handling requests from any chain, which will then be relayed to the Ethereum-based Push core contracts for validations and state changes.</li>\n<li><strong>Upgraded Incentivized Chats:</strong> Users will be able to initiate and receive paid chats from any chain to any chain, as long as both are supported by the framework.</li>\n<li><strong>Cross-Chain Requests (CCR):</strong> This feature allows users to perform actions like creating channels or requests on any blockchain, rather than just on Ethereum. This move is essential for Push to reach a broader audience across different blockchains, including Layer 2 (L2), Layer 3 (L3), and app-specific chains, without increasing friction in the user’s experience with our tech.</li>\n<li>A new hub for builders: All of this will enable a new hub for builders to experiment and widen the boundaries of innovation with web3-based consumer apps.</li>\n</ol>\n<p>We then moved on to Wormhole’s views on the significance of the integration of Push’s smart contracts with their tech:</p>\n<h3 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"why-push-x-wormhole\">Why Push x Wormhole?<a href=\"https://push.org/blog/ama-with-wormhole-for-cross-chain-requests-pre-pip#why-push-x-wormhole\" class=\"hash-link\" aria-label=\"Direct link to Why Push x Wormhole?\" title=\"Direct link to Why Push x Wormhole?\">​</a></h3>\n<p>The integration centers on making the $PUSH token natively fungible across all of the connected chains that Push wants, while enabling native-messaging of all sorts on all involved. We came up with this new multi-chain framework, the Native Token Transfer framework, to enable seamless token transfers across different chains without the need for liquidity pools or complex bridging mechanisms. We both agree that the industry needs to involve into one that is truly interoperable. This is a major step in that direction.</p>\n<h3 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"why-is-pre-pip-3ccr-important\">Why is Pre-PIP 3/CCR important?<a href=\"https://push.org/blog/ama-with-wormhole-for-cross-chain-requests-pre-pip#why-is-pre-pip-3ccr-important\" class=\"hash-link\" aria-label=\"Direct link to Why is Pre-PIP 3/CCR important?\" title=\"Direct link to Why is Pre-PIP 3/CCR important?\">​</a></h3>\n<p>The proposal includes detailed research and considerations, focusing on minimal changes to the existing architecture, a security-first approach, and how the technical aspects of Wormhole will enable CCR. This includes the deployment of manager and transceiver contracts on different chains and how these contracts interact with Push’s existing infrastructure.</p>\n<h3 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"why-did-push-choose-wormhole-for-this-integration\">Why did Push choose Wormhole for this integration?<a href=\"https://push.org/blog/ama-with-wormhole-for-cross-chain-requests-pre-pip#why-did-push-choose-wormhole-for-this-integration\" class=\"hash-link\" aria-label=\"Direct link to Why did Push choose Wormhole for this integration?\" title=\"Direct link to Why did Push choose Wormhole for this integration?\">​</a></h3>\n<ol>\n<li><strong>Native Token Transfer (NTT) Framework:</strong> This framework allows for seamless token transfers across different chains without the need for liquidity pools or complex bridging mechanisms.</li>\n<li><strong>Security:</strong> Wormhole’s framework is battle-tested and includes additional security measures like rate limiting.</li>\n<li><strong>Future-Proofing:</strong> The NTT framework allows Push to maintain governance control over its tokens across multiple chains, which is crucial for its ecosystem and the evolution of its DAO.</li>\n</ol>\n<h3 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"overview-of-the-wormhole-transceiver-and-security-framework\">Overview of the Wormhole Transceiver and Security Framework:<a href=\"https://push.org/blog/ama-with-wormhole-for-cross-chain-requests-pre-pip#overview-of-the-wormhole-transceiver-and-security-framework\" class=\"hash-link\" aria-label=\"Direct link to Overview of the Wormhole Transceiver and Security Framework:\" title=\"Direct link to Overview of the Wormhole Transceiver and Security Framework:\">​</a></h3>\n<ol>\n<li><strong>Wormhole Transceiver:</strong> This utilizes the general message passing layer of Wormhole, which relies on a security model with 19 independent \"guardians\" who verify messages. At least 13 of the 19 guardians must agree to validate a message, making the system highly secure.</li>\n<li><strong>Flexibility and Future-Proofing: Wormhole’s</strong> system allows for the adding of other transceivers or message verification protocols, such as off-chain processes or ZK transceivers for enhanced security.</li>\n<li><strong>Overall Security and Reliability:</strong> Wormhole has processed over a billion messages while maintaining consistently high security and resilience across its network. The platform already provably supports the future of secure message and token transfers across chains.</li>\n</ol>\n<h3 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"push-protocol-and-wormhole-integration\">Push Protocol and Wormhole Integration:<a href=\"https://push.org/blog/ama-with-wormhole-for-cross-chain-requests-pre-pip#push-protocol-and-wormhole-integration\" class=\"hash-link\" aria-label=\"Direct link to Push Protocol and Wormhole Integration:\" title=\"Direct link to Push Protocol and Wormhole Integration:\">​</a></h3>\n<ol>\n<li><strong>Security-First Approach:</strong> Push Protocol has always and continues to prioritize security, ensuring that the deployment of tokens and messages on multiple chains is always protected and that protection always increases.</li>\n<li><strong>Cross-Chain Request (CCR):</strong> With CCR live, users will be able to execute actions (e.g., creating channels) across different chains without leaving their native chain or bridging tokens. The integration with Wormhole makes this process more seamless and efficient.</li>\n<li><strong>User Experience:</strong> Post-CCR’s launch, actions like channel creation will become more straightforward, with users able to operate across chains without the hassle of managing tokens or gas fees on multiple networks to get to their intended destination.</li>\n</ol>\n<h3 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"the-greater-implications-of-ccr-for-developers-and-builders\">The Greater Implications of CCR for Developers and Builders:<a href=\"https://push.org/blog/ama-with-wormhole-for-cross-chain-requests-pre-pip#the-greater-implications-of-ccr-for-developers-and-builders\" class=\"hash-link\" aria-label=\"Direct link to The Greater Implications of CCR for Developers and Builders:\" title=\"Direct link to The Greater Implications of CCR for Developers and Builders:\">​</a></h3>\n<ol>\n<li><strong>Unified API and Multi-Chain Notifications:</strong> Developers can build once and notify everywhere, simplifying cross-chain interactions and enhancing user engagement. This reduces development complexity and improves resource management.</li>\n<li><strong>Enhanced Functionality and Interoperability:</strong> The integration allows for smart contracts on one chain to trigger notifications on another, improving the overall functionality of decentralized applications (dApps).</li>\n<li><strong>Security Enhancements:</strong> Wormhole’s security features, like rate-limiting, access control, and defense mechanisms, ensure that cross-chain communications remain verifiably secure.</li>\n</ol>\n<p>The integration of Push Protocol's Cross-Chain Requests (CCR) with Wormhole represents a pivotal advancement in decentralized technology. This advancement strengthens Push’s security, raises its scalability, and broadens its reach across multiple blockchains, paving the way for a more connected and user-friendly Web3 experience for all. As Push continues to innovate, its partnership with Wormhole ensures that it remains on the forefront.</p>\n<p>To any of you who are looking to build the future of consumer applications, reach out to our team across our networks, and we’ll help you get started as CCR takes off!</p>",
            "url": "https://push.org/blog/ama-with-wormhole-for-cross-chain-requests-pre-pip",
            "title": "Push Protocol x Wormhole AMA for the Cross Chain Request Feature in Push V3",
            "summary": "Push Protocol x Wormhole AMA for the Cross Chain Request Feature in Push V3",
            "date_modified": "2024-08-09T00:00:00.000Z",
            "author": {
                "name": "Push Protocol",
                "url": "https://twitter.com/pushprotocol"
            },
            "tags": [
                "Push Protocol",
                "Web3",
                "Blockchain Technology"
            ]
        },
        {
            "id": "https://push.org/blog/cross-chain-requests-pre-pip",
            "content_html": "<p><img loading=\"lazy\" alt=\"Cover Image of Introducing Pre-PIP 3 (Push Improvement Proposal) for Cross-Chain Requests\" src=\"https://push.org/assets/images/cover-image-57bca9ea6556a16c996e32f0d3721977.webp\" width=\"1600\" height=\"900\" class=\"img_ev3q\"></p>\n<p>Push Protocol, the leading web3 communication layer, has proposed a major upgrade with the introduction of <a href=\"https://gov.push.org/t/pre-pip-3-cross-chain-request-feature-in-push-smart-contracts-v3/1794\" target=\"_blank\" rel=\"noopener noreferrer\">Pre-PIP (Push Improvement Proposal) for Cross-Chain Requests (CCR)</a>. This proposal aims to enable users to interact with Push Protocol smart contracts on the Ethereum blockchain from any blockchain network, whether it’s EVM-based or non-EVM. Once CCR is implemented, users will be able to stay on their preferred blockchain while accessing Push Protocol's services, offering enhanced convenience and flexibility.</p>\n<h3 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"what-is-ccr-cross-chain-requests-and-its-impact\">What is CCR (Cross-Chain Requests) and its impact?<a href=\"https://push.org/blog/cross-chain-requests-pre-pip#what-is-ccr-cross-chain-requests-and-its-impact\" class=\"hash-link\" aria-label=\"Direct link to What is CCR (Cross-Chain Requests) and its impact?\" title=\"Direct link to What is CCR (Cross-Chain Requests) and its impact?\">​</a></h3>\n<p>In the current Push Protocol architecture, performing any important task related to channels like creating a channel, modification of a channel, changing a channel’s state, etc, requires the user/protocol to interact with the Push Smart Contract which is only deployed on Ethereum Blockchain.</p>\n<p>This led to a bad user experience for the user/protocol as they need to switch to the Ethereum network for any interaction they might want to do with the Push Core contract. This is currently a friction point for users who primarily operate on other EVM-compatible chains and even non-EVM users.</p>\n<p>Cross-chain requests will eliminate the need to switch to the Ethereum Network making it possible to create a channel, use Push services, or interact with Push Protocol’s Ethereum smart contract from any blockchain they like, whether it’s another EVM chain or non-EVM chain.</p>\n<p>Additionally, this was not just something that users faced but more for Push Protocol as it limits Push Protocol's ability to tap into other chains and help solve the communication/notification issues of those chains adequately. This constraint hinders the protocol from reaching a broader audience and solving communication issues across diverse blockchain environments.</p>\n<p>Therefore, by enabling the Cross-Chain Request feature, Push Protocol can primarily significantly enhance the UX for average users as well as channel creators/managers from not just Ethereum but multiple other EVM/Non-EVM chains as well. It also allows the protocol to expand its market reach, attract users from different chains, and foster a more interconnected blockchain ecosystem.</p>\n<h3 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"importance-of-ccr-cross-chain-requests\">Importance of CCR (Cross-Chain Requests):<a href=\"https://push.org/blog/cross-chain-requests-pre-pip#importance-of-ccr-cross-chain-requests\" class=\"hash-link\" aria-label=\"Direct link to Importance of CCR (Cross-Chain Requests):\" title=\"Direct link to Importance of CCR (Cross-Chain Requests):\">​</a></h3>\n<p>The Cross Chain Requests (CCR) feature is crucial for the future success and growth of the Push Protocol:</p>\n<ol>\n<li><strong>Enhanced User Experience:</strong> The CCR feature will significantly enhance user experience by eliminating the need for users to switch networks or manually bridge tokens to interact with the Push Core contract on Ethereum. This streamlined process will allow users to perform key actions like channel creation and incentivize chat requests directly from their preferred blockchain, reducing both complexity and transaction costs. By making these features accessible from various chains, CCR removes barriers for new and existing users, fostering a more inclusive and user-friendly environment.</li>\n<li><strong>Broader Reach:</strong> The CCR feature will expand the reach of Push Protocol across the blockchain ecosystem. By enabling interactions from multiple EVM and non-EVM chains, CCR will not only broaden the protocol's user base but also tap into diverse blockchain communities that might benefit from Push’s communication and notification features. This increased accessibility helps Push Protocol grow its market presence and integrate with a wider range of blockchain projects, ultimately supporting the development of a more interconnected and collaborative blockchain network.</li>\n<li><strong>Revolutionizing Web3 Communications</strong>: CCR future-proofs Push Protocol against the rapid evolution of the blockchain space. As new chains and technologies emerge, CCR’s cross-chain capabilities ensure that Push Protocol remains adaptable and relevant. By leveraging established technologies like Wormhole’s NTT framework and Relayers, CCR positions Push Protocol to embrace future advancements and continue delivering value to its users across an ever-expanding blockchain landscape.</li>\n</ol>\n<p><strong>Here’s a simple overview of how CCR works:</strong></p>\n<ol>\n<li><strong>Initiate Request</strong>: A user on another blockchain (like Polygon) wants to perform an action, such as creating a new channel for sending notifications.</li>\n<li><strong>Submit Details</strong>: The user uses a special function on the Push Communicator contract on their preferred blockchain to submit the request, providing the necessary details and approving the $PUSH tokens for the action.</li>\n<li><strong>Send Data and Tokens</strong>: The Push Communicator contract validates the input, creates a message payload, and uses Wormhole Relayers to securely send this payload and the $PUSH tokens to the Push Core contract on Ethereum.</li>\n<li><strong>Process Request</strong>: On Ethereum, the Push Core contract receives the message and tokens, decodes the request, validates it, and performs the required action.</li>\n<li><strong>Completion</strong>: The request is completed on Ethereum, and any unused native tokens are refunded to the user on their original blockchain.</li>\n</ol>\n<p><img loading=\"lazy\" alt=\"Cover Image of Diagram for Cross-Chain Requests\" src=\"https://push.org/assets/images/image1-2f89fa71911892f627b09ac1af285b45.webp\" width=\"1600\" height=\"901\" class=\"img_ev3q\"></p>\n<h3 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"visualizing-channel-creation-with-the-ccr-feature\">Visualizing Channel Creation with the CCR feature<a href=\"https://push.org/blog/cross-chain-requests-pre-pip#visualizing-channel-creation-with-the-ccr-feature\" class=\"hash-link\" aria-label=\"Direct link to Visualizing Channel Creation with the CCR feature\" title=\"Direct link to Visualizing Channel Creation with the CCR feature\">​</a></h3>\n<p>Imagine Bob, a Polygon user, wants to create a channel for sending notifications.</p>\n<p>Previously, he'd need to switch to Ethereum, bridge tokens, and change networks. With CCR, Bob simply uses the familiar Push Communicator contract on Polygon.</p>\n<p>The contract acts as a bridge, relaying Bob's request (channel details) and the required PUSH tokens (bridged via Wormhole) to the Push Core contract on Ethereum.</p>\n<p>All behind the scenes, without Bob ever leaving Polygon! This creates a seamless experience for users on any chain, opening Push Protocol to a wider audience.</p>\n<h3 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"why-not-just-deploy-push-core-everywhere\">Why Not Just Deploy Push Core Everywhere?<a href=\"https://push.org/blog/cross-chain-requests-pre-pip#why-not-just-deploy-push-core-everywhere\" class=\"hash-link\" aria-label=\"Direct link to Why Not Just Deploy Push Core Everywhere?\" title=\"Direct link to Why Not Just Deploy Push Core Everywhere?\">​</a></h3>\n<p>While putting Push Core on every blockchain might seem easy, it's quite tricky.</p>\n<p>It would be hard to manage separate fees and keep all the information on different chains in sync, which could even be risky.</p>\n<p>That's why we're improving the existing Push Communicator contracts to handle these requests. We'll also use a reliable system called Wormhole to securely send information and tokens between blockchains. This way, everything works smoothly without needing Push Core on every chain. For more details check out <a href=\"https://gov.push.org/t/pre-pip-3-cross-chain-request-feature-in-push-smart-contracts-v3/1794\" target=\"_blank\" rel=\"noopener noreferrer\">here</a>.</p>\n<h3 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"implementation-how-we-will-build-ccr\">Implementation: How we will build CCR:<a href=\"https://push.org/blog/cross-chain-requests-pre-pip#implementation-how-we-will-build-ccr\" class=\"hash-link\" aria-label=\"Direct link to Implementation: How we will build CCR:\" title=\"Direct link to Implementation: How we will build CCR:\">​</a></h3>\n<p>To implement Cross-Chain Requests (CCR), we will:</p>\n<ol>\n<li>Enable $Push Token for multi-chain support.</li>\n<li>Build cross-chain support in the Push Communicator and Push Core Contract.</li>\n<li>Use Wormhole’s Relayer Interface and NTT framework for token transfers across chains.</li>\n<li>Equip the Push Communicator to handle cross-chain actions like channel creation and requests.</li>\n<li>Modify the Push Core Contract to process cross-chain payloads.</li>\n<li>Conduct security audits and deploy the updated contracts on the testnet and mainnet.</li>\n</ol>\n<p>For more details on the implementation of CCR check out <a href=\"https://gov.push.org/t/pre-pip-3-cross-chain-request-feature-in-push-smart-contracts-v3/1794\" target=\"_blank\" rel=\"noopener noreferrer\">here</a>.</p>\n<h3 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"the-future-of-push-protocol\">The Future of Push Protocol:<a href=\"https://push.org/blog/cross-chain-requests-pre-pip#the-future-of-push-protocol\" class=\"hash-link\" aria-label=\"Direct link to The Future of Push Protocol:\" title=\"Direct link to The Future of Push Protocol:\">​</a></h3>\n<p>CCR feature is a significant step forward for Push Protocol. It paves the way for a more interconnected and user-friendly communication layer within the ever-expanding blockchain landscape.</p>\n<p>Stay tuned for further updates as we implement CCR and empower users to unlock the full potential of Web3 communication!</p>",
            "url": "https://push.org/blog/cross-chain-requests-pre-pip",
            "title": "Introducing Pre-PIP 3 (Push Improvement Proposal) for Cross-Chain Requests:",
            "summary": "Introducing Pre-PIP 3 (Push Improvement Proposal) for Cross-Chain Requests:",
            "date_modified": "2024-07-30T00:00:00.000Z",
            "author": {
                "name": "Push Protocol",
                "url": "https://twitter.com/pushprotocol"
            },
            "tags": [
                "Push Protocol",
                "Web3",
                "Blockchain Technology"
            ]
        },
        {
            "id": "https://push.org/blog/monthly-updates-june-2024",
            "content_html": "<p><img loading=\"lazy\" alt=\"Cover Image of Push Protocol Monthly Updates: A Look Back at June\" src=\"https://push.org/assets/images/cover-image-efd54013a8526607c2293a9e5fc87709.webp\" width=\"1600\" height=\"840\" class=\"img_ev3q\"></p>\n<p>June has been a monumental month for Push Protocol, marked by significant achievements and advancements that further strengthen our position in the Web3 ecosystem. More than <strong>8.6 Million Notifications</strong> were sent with a cumulative <strong>238k subscribers</strong> reached ending the month on a high note. We are excited to share the highlights:</p>\n<h3 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"product-updates\">Product Updates:<a href=\"https://push.org/blog/monthly-updates-june-2024#product-updates\" class=\"hash-link\" aria-label=\"Direct link to Product Updates:\" title=\"Direct link to Product Updates:\">​</a></h3>\n<p>Our <a href=\"https://push.org/\" target=\"_blank\" rel=\"noopener noreferrer\">website</a> has undergone a revamp, featuring:</p>\n<ul>\n<li>New resources and tutorials for the <a href=\"https://push.org/bootcamp/\" target=\"_blank\" rel=\"noopener noreferrer\">BRB Bootcamp</a></li>\n<li>Performance optimizations and security enhancements</li>\n<li>Improved blog section with new categories and enhanced search capabilities</li>\n</ul>\n<p>Our <a href=\"https://app.push.org/welcome\" target=\"_blank\" rel=\"noopener noreferrer\">DApp</a> has seen significant upgrades, including:</p>\n<ul>\n<li>A new dashboard page</li>\n<li>Updates to the Push Alpha Access NFT Claims page</li>\n<li>The upcoming release of the reward points feature</li>\n<li>Development of a new design system</li>\n<li>Priority bug fixes</li>\n</ul>\n<p>Our <a href=\"https://github.com/push-protocol/push-sdk\" target=\"_blank\" rel=\"noopener noreferrer\">SDK</a> now also supports the base chain growing our support for 7 chains including Ethereum, Polygon, BNB, Arbitrum, Polygon zkEVM, Fuse, and Cuber. The Push SDK now also includes the Space ID package for .arb and .bnb domains, along with priority bug fixes.</p>\n<p>Advancing our mobile app, we completed the development and review phase of the new version of the mobile app, currently in the testing phase, after which the new version will be rolled out.</p>\n<p>On the backend, we have:</p>\n<ul>\n<li>Launched on Base and Linea chain</li>\n<li>Made Channel Pre cache live till stage from the backend side.</li>\n<li>Enabled support for multiple aliases from the backend side</li>\n<li>Made Channel Tags live from push nodes and the SDK</li>\n<li>Migrated Dev and Stage from AWS to GCP</li>\n<li>Are working on SDK for Nodes.</li>\n</ul>\n<h3 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"partnership-updates\">Partnership Updates:<a href=\"https://push.org/blog/monthly-updates-june-2024#partnership-updates\" class=\"hash-link\" aria-label=\"Direct link to Partnership Updates:\" title=\"Direct link to Partnership Updates:\">​</a></h3>\n<p>We're thrilled to announce new partnerships with amazing projects:</p>\n<ol>\n<li>We went live on the <a href=\"https://push.org/blog/push-protocol-on-arbitrum-blockchain/\" target=\"_blank\" rel=\"noopener noreferrer\">Arbitrum Blockchain</a> partnering with <a href=\"https://app.push.org/channels/0xAeF69730D3210B151036C04434c2b1E551e20928\" target=\"_blank\" rel=\"noopener noreferrer\">Cryptex</a>, <a href=\"https://app.push.org/channels/0x67243d6c3c3bDc2F59D2f74ba1949a02973a529d\" target=\"_blank\" rel=\"noopener noreferrer\">Grant Ships</a>, <a href=\"https://app.push.org/channels/0x2A43cB483361FB5b3a09Bd11c24CbEE5cf1BE7Ca\" target=\"_blank\" rel=\"noopener noreferrer\">Estate Protocol</a>, <a href=\"https://app.push.org/channels/0xf995b8145F6d17AECf0d0Fb54435Dd4D6B3060e5\" target=\"_blank\" rel=\"noopener noreferrer\">ANDAO</a> and <a href=\"https://app.push.org/channels/0xcBEBcCCF0B846C686D68c4D9EDA95fb17a7eedaE\" target=\"_blank\" rel=\"noopener noreferrer\">Roseon</a> enabling notifications for the users.</li>\n<li>We welcomed <a href=\"https://app.push.org/channels/0xD79771c38e4AfFCeAc05a61ffEB566d2CAF7Dc6A\" target=\"_blank\" rel=\"noopener noreferrer\">Vurse</a>, and <a href=\"https://app.push.org/channels/0x518a3A3e11f9f86A4509374559Adf0313B687A38\" target=\"_blank\" rel=\"noopener noreferrer\">MetaCRM</a> integrating Push Notifications.</li>\n<li>Further, we partnered with <a href=\"https://x.com/pushprotocol/status/1806327421664133423\" target=\"_blank\" rel=\"noopener noreferrer\">RetroBridge</a> and <a href=\"https://x.com/pushprotocol/status/1804220237929419071\" target=\"_blank\" rel=\"noopener noreferrer\">Uquid</a> listing the Push DApp on the RetroBridge Dapp Explorer and Uquid DApp Center.</li>\n<li>We also partnered with <a href=\"https://x.com/pushprotocol/status/1804114717222281521\" target=\"_blank\" rel=\"noopener noreferrer\">Space ID Protocol</a>, integrating their Web3 Name SDK to introduce the usability of .bnb and .arb which can be used on Push dApp &amp; Push Chat.</li>\n</ol>\n<h3 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"community-engagement\">Community Engagement:<a href=\"https://push.org/blog/monthly-updates-june-2024#community-engagement\" class=\"hash-link\" aria-label=\"Direct link to Community Engagement:\" title=\"Direct link to Community Engagement:\">​</a></h3>\n<p>In our continuous effort to keep the community engaged and excited, we’ve rolled out a series of thrilling initiatives including:</p>\n<ol>\n<li>We announced the winners of the #CommunicateWithPUSH Galxe Contest which resulted in 1000+ Push Alpha NFT mints in June.</li>\n<li>Further, we opened the gates to the <a href=\"https://app.push.org/chat/chatid:37799f9cb3ffd83eff4d2dc18913a3d9607f9c787a4374a7b3259bda28242cd6\" target=\"_blank\" rel=\"noopener noreferrer\">Push Alpha Community Chat</a> for 573 Push Alpha Access NFT Holders.</li>\n</ol>\n<h3 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"ecosystem-highlights\">Ecosystem Highlights:<a href=\"https://push.org/blog/monthly-updates-june-2024#ecosystem-highlights\" class=\"hash-link\" aria-label=\"Direct link to Ecosystem Highlights:\" title=\"Direct link to Ecosystem Highlights:\">​</a></h3>\n<p>Push Protocol’s founder Harsh Rajat joined as a guest on multiple podcasts including:</p>\n<ol>\n<li><a href=\"https://x.com/pushprotocol/status/1801565106783871325\" target=\"_blank\" rel=\"noopener noreferrer\">The Web3 Gamer</a> Podcast hosted by Matthew</li>\n<li><a href=\"https://x.com/pushprotocol/status/1805253308501614931\" target=\"_blank\" rel=\"noopener noreferrer\">Web3 CMO Stories</a> hosted by Joeri Bilast</li>\n<li><a href=\"https://x.com/pushprotocol/status/1800437383738929643\" target=\"_blank\" rel=\"noopener noreferrer\">Web3 Thought and Action</a> by Akshat</li>\n<li>and <a href=\"https://x.com/pushprotocol/status/1804541946779615403\" target=\"_blank\" rel=\"noopener noreferrer\">Ethereum Cat Herders</a> Project Demo sharing about his entrepreneurial journey, Push Protocol, and the developments.</li>\n</ol>\n<p>Our DAO Lead <a href=\"https://x.com/ExpatCrypto3\" target=\"_blank\" rel=\"noopener noreferrer\">Ian LeViness</a> joined in for a <a href=\"https://x.com/pushprotocol/status/1798602250278875235\" target=\"_blank\" rel=\"noopener noreferrer\">DeFi 101 Space</a> hosted by Rivo to discuss The Impact of Ethereum ETF Approval on the DeFi Ecosystem and <a href=\"https://x.com/pushprotocol/status/1801201370684436684\" target=\"_blank\" rel=\"noopener noreferrer\">DAO Spring</a> for an X space on Finding Product/Community Market Fit for your DAO. We also had <a href=\"https://x.com/PushProtocol_IN/status/1802801933830566022\" target=\"_blank\" rel=\"noopener noreferrer\">Push India Ambassadors</a> sharing inspiring stories and insights from their participation in the Push Ambassador program.</p>\n<p>We were proud to feature <a href=\"https://app.push.org/channels/0x7F41abf7fDb9E4A6373EC3BAB3Df814b5CCceCC3\" target=\"_blank\" rel=\"noopener noreferrer\">Bancor</a>, <a href=\"https://app.push.org/channels/0x361Cb6BE977d0113A33914A8f952Ced95747F793\" target=\"_blank\" rel=\"noopener noreferrer\">Fabwelt</a>, <a href=\"https://app.push.org/channels/0xbc7797319B3eD4246c7078CC4e8B28Ea2C6872D0\" target=\"_blank\" rel=\"noopener noreferrer\">Dhive</a>, and <a href=\"https://app.push.org/channels/0x48De2669db5C2da4bf36C29ef9CFd62057B4b6C8\" target=\"_blank\" rel=\"noopener noreferrer\">Price Tracker</a> Channels for the #PushChannelOfTheWeek in June 🔔</p>\n<h3 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"push-dao-updates\">Push DAO Updates:<a href=\"https://push.org/blog/monthly-updates-june-2024#push-dao-updates\" class=\"hash-link\" aria-label=\"Direct link to Push DAO Updates:\" title=\"Direct link to Push DAO Updates:\">​</a></h3>\n<ol>\n<li>We launched the most awaited <a href=\"https://mirror.xyz/0x1fdac7887A701609bcFb9188f5912EC59bDb33BE/-n9pgSJ2FZz75yPoEa-0a5mcg-SsHAiz6R8YdyrsO5I\" target=\"_blank\" rel=\"noopener noreferrer\">Push Grants Program V3</a> powered by CharmVerse to empower early-stage &amp; established projects building compelling social, gaming, &amp; mobile apps.</li>\n<li>Further, we also introduced the <a href=\"https://mirror.xyz/0x1fdac7887A701609bcFb9188f5912EC59bDb33BE/N8ZFxd1xU4pr1EeFR-0BJ9V01oYSUnie-ld21mzahBg\" target=\"_blank\" rel=\"noopener noreferrer\">Push DAO BD SubDAO Program</a> offering an opportunity to engage in BD activities for Push Protocol and win rewards of $500-$1500 on successfully integrating with DAOs, DeFi protocol, dApps, and other projects with Push Notifications/Chat.</li>\n<li>The <a href=\"https://mirror.xyz/0x1fdac7887A701609bcFb9188f5912EC59bDb33BE/-n9pgSJ2FZz75yPoEa-0a5mcg-SsHAiz6R8YdyrsO5I\" target=\"_blank\" rel=\"noopener noreferrer\">Push Grants program</a> is now under community control via Push DAO.</li>\n<li>Our council members <a href=\"https://gov.push.org/u/christiandike/summary\" target=\"_blank\" rel=\"noopener noreferrer\">Christian Dike</a> and <a href=\"https://gov.push.org/u/sixtykeys/summary\" target=\"_blank\" rel=\"noopener noreferrer\">SixtyKeys</a> represented Push at Lagos Blockchain Week and  Zuzalu event in Zanzibar, respectively.</li>\n<li>Our Council member Carla secured a partnership with <a href=\"https://www.ethereumuruguay.org/\" target=\"_blank\" rel=\"noopener noreferrer\">Ethereum Uruguay</a> for their upcoming buildathon.</li>\n<li>The first grantee Si3 started receiving funding, and DAO ambassadors began contributing to the ecosystem's growth.</li>\n</ol>\n<p>Stay tuned for more updates as we continue to push the boundaries of the Web3 ecosystem.</p>",
            "url": "https://push.org/blog/monthly-updates-june-2024",
            "title": "Push Protocol Monthly Updates: A Look Back at June",
            "summary": "Push Protocol Monthly Updates: A Look Back at June",
            "date_modified": "2024-07-17T00:00:00.000Z",
            "author": {
                "name": "Push Protocol",
                "url": "https://twitter.com/pushprotocol"
            },
            "tags": [
                "Push Protocol",
                "Web3",
                "Blockchain Technology"
            ]
        },
        {
            "id": "https://push.org/blog/interoperable-communications-moving-across-an-open-web-with-push",
            "content_html": "<p><img loading=\"lazy\" alt=\"Cover image of Case Study - Moving across an open web with Push\" src=\"https://push.org/assets/images/cover-image-c9dfc8a9752992a8c97ecf5c76e0095e.webp\" width=\"1600\" height=\"900\" class=\"img_ev3q\"></p>\n<p>With every passing day, the blockchain industry continues to become more mature and inch closer towards achieving the operational level comfort that today’s web2 world offers.</p>\n<p>In this pursuit, we’re witnessing a period of massive experimentation in on-chain infrastructure design.</p>\n<p>A natural trend observed in the EVM space is vertical growth through Rollups, Layer 2, and Layer 3 networks. The common goal of this design shift is to achieve scalability and, as a result, a higher degree of interoperability.</p>\n<p>But as the web3 dev community continues to take bigger strides in achieving transactional interoperability, app-to-user, app-to-app, and user-to-user communication are still at nascent steps.</p>\n<p>Push is working towards diminishing this divide between transactional and communication interoperability by building a robust, secure fabric that weaves multiple chains and services together by forming the <strong>“Universal Layer2 Of Communication”</strong>.</p>\n<h2 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"fragmented-ecosystem\">Fragmented Ecosystem<a href=\"https://push.org/blog/interoperable-communications-moving-across-an-open-web-with-push#fragmented-ecosystem\" class=\"hash-link\" aria-label=\"Direct link to Fragmented Ecosystem\" title=\"Direct link to Fragmented Ecosystem\">​</a></h2>\n<p>Web3 operates on a multitude of blockchains, each with its own protocols, standards, and its own unique set of rules. This creates independent and isolated silos of information, making it difficult for users, services and applications built on separate chains to interact and communicate with each other unanimously.</p>\n<p>Push continues to form a communication blanket over the fragmented ecosystem and provide its communication services to multiple EVM and non-EVM based chains. At present, Push supports over 7 networks including:</p>\n<ul>\n<li>Ethereum</li>\n<li>Polyogn</li>\n<li>Polygon zkEVM</li>\n<li>Arbitrum</li>\n<li>Binance Smart Chain (BNB)</li>\n<li>Fuse</li>\n<li>Cyber</li>\n</ul>\n<p><strong>The Communicator contracts (Push Comm V2) serve as a middleware for listening to inbound communications</strong>&nbsp;and events from the Client Application’s smart contract. Thus, shouldering the responsibility of on-chain communication across contracts deployed on multiple chains (EVM and non-EVM).</p>\n<p>Notifications can not always be triggered as a result of an on-chain event. Many notifications, especially the ones that are more inclined towards driving engagement can be considered off-chain. Push ensures that any frontend, service, backend or smart contract can easily send communication payloads across the diverse participants and devices ( App, Wallet, Extension, Frontends and more).</p>\n<h2 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"data-availability-no-communication-da-layer\">Data Availability (no communication DA layer)<a href=\"https://push.org/blog/interoperable-communications-moving-across-an-open-web-with-push#data-availability-no-communication-da-layer\" class=\"hash-link\" aria-label=\"Direct link to Data Availability (no communication DA layer)\" title=\"Direct link to Data Availability (no communication DA layer)\">​</a></h2>\n<p>Traditionally, Data Availability (DA) ensures that the data needed to validate a block is accessible to the majority of network participants. However, in the context of interoperable communications within Web3, we need a broader concept: “<strong>Communication DA”</strong>.</p>\n<p><strong>What's the problem?</strong>\nFrom an end user's perspective, app notifications and other forms of read-write communications (messaging, groupchats, videocalls) should be accessible regardless of the platform, service, hardware and underlying chain they use.  Previously, there was no standardized middleware mechanism to link communication across platforms and chains.</p>\n<p>Push solves this problem. Being an open network, Push enables any frontend, service, or backend to securely tap into the Push network and extract the necessary communication payloads in a platform-agnostic manner.</p>\n<p>Simply put, <strong>your communication travels with your web3 identity: your wallet.</strong></p>\n<p><img loading=\"lazy\" alt=\"Push Delivery Nodes\" src=\"https://push.org/assets/images/image1-7aaf4b71343d3f54e055b4a4a9e86577.webp\" width=\"1400\" height=\"1124\" class=\"img_ev3q\"></p>\n<h2 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"benefits-to-protocols-and-dapps\">Benefits to Protocols and DApps<a href=\"https://push.org/blog/interoperable-communications-moving-across-an-open-web-with-push#benefits-to-protocols-and-dapps\" class=\"hash-link\" aria-label=\"Direct link to Benefits to Protocols and DApps\" title=\"Direct link to Benefits to Protocols and DApps\">​</a></h2>\n<h3 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"1-communications-web-3-wallets\">1. Communications 🤝&nbsp;Web 3 Wallets<a href=\"https://push.org/blog/interoperable-communications-moving-across-an-open-web-with-push#1-communications-web-3-wallets\" class=\"hash-link\" aria-label=\"Direct link to 1. Communications 🤝&nbsp;Web 3 Wallets\" title=\"Direct link to 1. Communications 🤝&nbsp;Web 3 Wallets\">​</a></h3>\n<p>In a typical web3 user journey, A user’s wallet , is the first element that unlocks transactional interoperability by  allowing users to seamlessly transfer assets and interact with dApps regardless of their underlying set of rules.</p>\n<p>Push Protocol extends the scope of this interoperability by  enabling cross-chain communication in form of notifications and messaging for Dapps, wallets, and services by tying it to the wallet addresses in an open, cryptographically encrypted and gasless manner.</p>\n<p>Notifications from various protocols and services are accessible regardless of the chains they originate from. All subscribed channel notifications are synchronized and displayed in one place within your Push-compatible wallet.</p>\n<p><img loading=\"lazy\" alt=\"Receive notifications from web3 DApps straight to your wallet\" src=\"https://push.org/assets/images/image2-e91f9e7a072801d8e0f392418a09bf31.webp\" width=\"2000\" height=\"1947\" class=\"img_ev3q\"></p>\n<h3 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"interoperable-communication-tied-to-web3-wallets--secret-to-unlock-massive-distribution\">Interoperable Communication tied to web3 wallets = Secret to unlock massive distribution:<a href=\"https://push.org/blog/interoperable-communications-moving-across-an-open-web-with-push#interoperable-communication-tied-to-web3-wallets--secret-to-unlock-massive-distribution\" class=\"hash-link\" aria-label=\"Direct link to Interoperable Communication tied to web3 wallets = Secret to unlock massive distribution:\" title=\"Direct link to Interoperable Communication tied to web3 wallets = Secret to unlock massive distribution:\">​</a></h3>\n<p>According to <a href=\"https://dappradar.com/blog/state-of-the-dapp-industry-q1-2024\" target=\"_blank\" rel=\"noopener noreferrer\">DApp Radar</a>, Q1 2024 saw a remarkable surge in daily active wallet users (dUAW), reaching an average of 7 million daily active wallets—a 77% increase compared to the previous year.</p>\n<p>The numbers clearly show that the entry into web3 starts from a wallet. With more than 120 wallet apps in market, Push presents an opportunity to revolutionise their UX by reaching to these wallet addresses. And essentially pave the way to <strong>onboard the first Billion users into web3</strong>.</p>\n<p>Protocols, services, and DApps can tap into a highly scalable  distribution stream with the help of Push. Push ties all application-specific communication to the user's wallet address, ensuring zero user friction and exponentially growing the client protocol's distribution.</p>\n<p><img loading=\"lazy\" alt=\"Unlock Interoperable Communications with Push\" src=\"https://push.org/assets/images/image3-773c84f6611fb60de497f032b88e6813.webp\" width=\"2226\" height=\"1248\" class=\"img_ev3q\"></p>\n<h3 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"communication-drives-collaboration-and-engagement\">Communication drives collaboration and engagement:<a href=\"https://push.org/blog/interoperable-communications-moving-across-an-open-web-with-push#communication-drives-collaboration-and-engagement\" class=\"hash-link\" aria-label=\"Direct link to Communication drives collaboration and engagement:\" title=\"Direct link to Communication drives collaboration and engagement:\">​</a></h3>\n<p>Notifications delivered directly to users' wallets enhance a DApp's brand recall by keeping it at the forefront of users' minds. Users can interact with these notifications, enabling them to visit the DApp and view updates promptly.</p>\n<p>When more applications can reach out to their user’s wallet, across multiple networks it opens new avenues for engagement, customer retention and brand building.</p>\n<p><img loading=\"lazy\" alt=\"DApp Looker Integrating Push Notifications in platform frontend\" src=\"https://push.org/assets/images/image4-3b874b5f437a7d75ff5ca0f95b3075da.webp\" width=\"1600\" height=\"900\" class=\"img_ev3q\"></p>\n<p><a href=\"https://dapplooker.com/\" target=\"_blank\" rel=\"noopener noreferrer\">DappLooker</a>: A no-code data analytics platform provides product and subscription related notifications. Users can enable / disable the notifications as per their wish via the platform.</p>\n<h2 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"benefits-to-user\">Benefits to User<a href=\"https://push.org/blog/interoperable-communications-moving-across-an-open-web-with-push#benefits-to-user\" class=\"hash-link\" aria-label=\"Direct link to Benefits to User\" title=\"Direct link to Benefits to User\">​</a></h2>\n<h3 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"1-wallet-address-a-universal-pass-for-web3-communication\">1. Wallet Address: A Universal Pass for Web3 Communication<a href=\"https://push.org/blog/interoperable-communications-moving-across-an-open-web-with-push#1-wallet-address-a-universal-pass-for-web3-communication\" class=\"hash-link\" aria-label=\"Direct link to 1. Wallet Address: A Universal Pass for Web3 Communication\" title=\"Direct link to 1. Wallet Address: A Universal Pass for Web3 Communication\">​</a></h3>\n<p>The utility of a wallet address extends beyond simply being a social identifier or a key for facilitating transactions.  It also acts as a hub for collecting, presenting and managing mission-critical communications.</p>\n<img src=\"https://push.org/assets/images/image5-5d9ae0c85a4ebb07d13db37c10eb5910.webp\" alt=\"Push Metamask Snap\" width=\"353\" height=\"100%\" class=\"SharedStyling__Image-sc-1enui31-9 efFBTI\">\n<p>The <a href=\"https://snaps.metamask.io/snap/npm/pushprotocol/snap/?utm_source=google&amp;utm_medium=blog&amp;utm_campaign=case_study_open_web\" target=\"_blank\" rel=\"noopener noreferrer\">Push MetaMask Snap</a> allows users to receive real-time notification alerts from their favourite web3 applications directly within their MetaMask wallet.</p>\n<h3 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"2-no-personal-information-needed\">2. No personal information needed:<a href=\"https://push.org/blog/interoperable-communications-moving-across-an-open-web-with-push#2-no-personal-information-needed\" class=\"hash-link\" aria-label=\"Direct link to 2. No personal information needed:\" title=\"Direct link to 2. No personal information needed:\">​</a></h3>\n<p>Push fascilitates Native Integration with Wallet Addresses enabling communication between wallet addresses without needing personal information like email, social handles or cellular contact info.</p>\n<h3 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"3security-and-decentralized-communication\">3.Security and Decentralized Communication:<a href=\"https://push.org/blog/interoperable-communications-moving-across-an-open-web-with-push#3security-and-decentralized-communication\" class=\"hash-link\" aria-label=\"Direct link to 3.Security and Decentralized Communication:\" title=\"Direct link to 3.Security and Decentralized Communication:\">​</a></h3>\n<p>With respect to communications, decentralization can be broken down into:</p>\n<ol>\n<li>Immutability of communication payloads/messages</li>\n<li>Inability to censor content.</li>\n</ol>\n<p>Push maintains immutability and censorship resistance  by encrypting mission critical communication payloads and messaging chats ensuring highest standards of communication security.</p>\n<p>Push powers wallet to wallet group chat with conditional gating form over <strong>3.8 Million users</strong> of <a href=\"https://unstoppabledomains.com/\" target=\"_blank\" rel=\"noopener noreferrer\">Unstoppable Domains</a> with over 300 groups made sofar.</p>\n<p><img loading=\"lazy\" alt=\"Unstoppable Domains Chat and Notifications support integrated in platform frontend\" src=\"https://push.org/assets/images/image6-0789530906cab11e27c1ff862999af20.webp\" width=\"1600\" height=\"900\" class=\"img_ev3q\"></p>\n<p>With the onset of <a href=\"https://push.org/blog/explaining-push-nodes/?utm_source=google&amp;utm_medium=blog&amp;utm_campaign=case_study_open_web\" target=\"_blank\" rel=\"noopener noreferrer\">Push Network</a> in Q4, the network will achieve its largest step in achieving complete network decentralization. Which in turn will activate slashing mechanisms to deter any nodes from censorship activities.</p>\n<h2 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"communication-follows-where-wallet-connects\">Communication Follows where wallet connects<a href=\"https://push.org/blog/interoperable-communications-moving-across-an-open-web-with-push#communication-follows-where-wallet-connects\" class=\"hash-link\" aria-label=\"Direct link to Communication Follows where wallet connects\" title=\"Direct link to Communication Follows where wallet connects\">​</a></h2>\n<p>Across multiple genres including, Gaming, DeFI, Governance and Wallets, Push enables multiple ways for the DApps to tap into the the protocol’s Communication DA Layer (i.e Push Network) and extract notifications in a platform agnostic manner.</p>\n<p>For instance, <a href=\"https://decentraland.org/\" target=\"_blank\" rel=\"noopener noreferrer\">Decentraland</a> users can choose to opt into and receive notifications into the platform frontend as well as receive the notifications directly into their Metamask Snap wallet.</p>\n<p><img loading=\"lazy\" alt=\"Decentraland notification support integrated in platform frontend\" src=\"https://push.org/assets/images/image7-d216fa7195718c94c9fdf1f3c46fef3c.webp\" width=\"1600\" height=\"900\" class=\"img_ev3q\"></p>\n<p>To receive updates when of a new governance proposal from Shapeshift DAO, you can either choose to receive notifications directly in your <a href=\"https://shapeshift.com/wallets\" target=\"_blank\" rel=\"noopener noreferrer\">Shapeshift</a> wallet or perhaps any other wallet that integrates Push’s open-source SDK.</p>\n<img src=\"https://push.org/assets/images/image8-f8a14125752aa82d79fb9a87197d767f.webp\" alt=\"Shapeshift Wallet\" width=\"353\" height=\"100%\" class=\"SharedStyling__Image-sc-1enui31-9 efFBTI\">\n<p>Additionally, users can experience updates from the following applications powered by Push, according to their convenience:</p>\n<ul>\n<li><strong><a href=\"https://app.push.org/welcome?utm_source=google&amp;utm_medium=blog&amp;utm_campaign=case_study_open_web\" target=\"_blank\" rel=\"noopener noreferrer\">Push DApp</a></strong></li>\n<li><strong><a href=\"https://chromewebstore.google.com/detail/push-protocol-alpha/lbdcbpaldalgiieffakjhiccoeebchmg?utm_source=google&amp;utm_medium=blog&amp;utm_campaign=case_study_open_web\" target=\"_blank\" rel=\"noopener noreferrer\">Push Browser Extension</a></strong></li>\n<li><strong><a href=\"https://play.google.com/store/apps/details?id=io.epns.epns&amp;hl=en_IN?utm_source=google&amp;utm_medium=blog&amp;utm_campaign=case_study_open_web\" target=\"_blank\" rel=\"noopener noreferrer\">Push Android App</a></strong></li>\n<li><strong><a href=\"https://apps.apple.com/us/app/push-epns/id1528614910?utm_source=google&amp;utm_medium=blog&amp;utm_campaign=case_study_open_web\" target=\"_blank\" rel=\"noopener noreferrer\">Push iOS App</a></strong></li>\n</ul>\n<h2 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"moving-across-an-open-web-with-push\">Moving across an Open Web with Push<a href=\"https://push.org/blog/interoperable-communications-moving-across-an-open-web-with-push#moving-across-an-open-web-with-push\" class=\"hash-link\" aria-label=\"Direct link to Moving across an Open Web with Push\" title=\"Direct link to Moving across an Open Web with Push\">​</a></h2>\n<p>We believe communications is a public good and a bare necessity for a frictionless digital life.\nThis also means that the means to provide communications and access them should not be limited to one or atmost two mediums.</p>\n<p>Push invented the communication network for web3 with a similar vision of enabling communication experiences unconstrained by chains.</p>\n<p><strong>A user of chain 'X' should not only be able to communicate with other users and services on that chain but also with users and services on chain 'Y' seamlessly, without added friction.</strong></p>\n<p>This is how Push is pushing towards forming a universal communication network of web3 encompassing all networks ensuring you, as a user can move across the open web along with your communications with ease.</p>",
            "url": "https://push.org/blog/interoperable-communications-moving-across-an-open-web-with-push",
            "title": "Interoperable communications: Moving across an open web with Push",
            "summary": "Moving across an open web with Push",
            "date_modified": "2024-07-11T00:00:00.000Z",
            "author": {
                "name": "Push Protocol",
                "url": "https://twitter.com/pushprotocol"
            },
            "tags": [
                "Push Protocol",
                "Web3",
                "Wallets",
                "Adoption"
            ]
        },
        {
            "id": "https://push.org/blog/how-to-create-your-community-on-push-chat",
            "content_html": "<p><img loading=\"lazy\" alt=\"Cover image of blog - How to create your community on Push Chat?\" src=\"https://push.org/assets/images/cover-image-db4e91147bf978f668cf712539292325.webp\" width=\"1600\" height=\"900\" class=\"img_ev3q\"></p>\n<p>Creating your on-chain community on Push Protocol is fairly easy.</p>\n<p>This guide will walk you through the step by step process of creating your own vibrant community on Push Protocol, right from setting up a strong foundation to complete community formation.</p>\n<p>To illustrate the journey, lets imagine a community dedicated to a captivating NFT collection known as '<strong>Charcoal Cats🐱</strong>'. In this guide we will show you, how to create a conditionally gated group chat exclusively for these Charcoal Cats admirers.</p>\n<p>Building a strong online community takes more than just setting up a group chat.\nBefore diving in to the group creation process, let's explore some key considerations to form a solid foundation of your community.</p>\n<h3 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"1define-your-communitys-purpose\">1.Define your community's purpose<a href=\"https://push.org/blog/how-to-create-your-community-on-push-chat#1define-your-communitys-purpose\" class=\"hash-link\" aria-label=\"Direct link to 1.Define your community's purpose\" title=\"Direct link to 1.Define your community's purpose\">​</a></h3>\n<p>Members join and leave the communities, but what remains constant is the community's  purpose.\nFind out what common interests will unite your members?<br>\n<!-- -->For Example : The 'Charcoal Cats🐱' community is cult camp of charcoal cat NFT lovers. The access to the chat is restricted to only those wallets who hold 'Charcoal Cats' NFT/s.</p>\n<h3 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"2choose-your-community-type\">2.Choose your community type<a href=\"https://push.org/blog/how-to-create-your-community-on-push-chat#2choose-your-community-type\" class=\"hash-link\" aria-label=\"Direct link to 2.Choose your community type\" title=\"Direct link to 2.Choose your community type\">​</a></h3>\n<p>Do you prefer a community which is more welcoming, open &amp; visible to all (i.e Public Group Chats) or rather prefer to form a exclusive community which is only visible to the individuals who are invited, are a part of the community or satisfy the criteria to join it.</p>\n<p>Push enables both, Public and Private communities with the ability to establish gating conditions for <strong>controlled access</strong>.</p>\n<p>With respect to our  example, lets  keep the Charcoal Cats a private community where-in the messages are encrypted and only visible upon successfully joining the group.</p>\n<h3 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"3decide-open-to-all-or-conditionally-gated-group-chat\">3.Decide: Open to all OR Conditionally Gated Group Chat<a href=\"https://push.org/blog/how-to-create-your-community-on-push-chat#3decide-open-to-all-or-conditionally-gated-group-chat\" class=\"hash-link\" aria-label=\"Direct link to 3.Decide: Open to all OR Conditionally Gated Group Chat\" title=\"Direct link to 3.Decide: Open to all OR Conditionally Gated Group Chat\">​</a></h3>\n<p>Groupchats that do not impose any pre-requsite condition before joining the group can be termed as <strong>open groupchats</strong>.\nFor instance, media oriented groupchats can be joined by anyone directly.</p>\n<p><strong>Conditionally Gated Chats</strong></p>\n<p>Group chats that impose one or multiple conditions for users and allows only those users who satisfy these conditions are termed as <strong>conditionally gated chats</strong>.</p>\n<p><strong>Conditions are a series of criterias that can be applied for both, joining the group as well as for chatting in the group.</strong></p>\n<h3 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"tailoring-access-with-any-or-all-settings\">Tailoring Access with \"Any\" or \"All\" Settings<a href=\"https://push.org/blog/how-to-create-your-community-on-push-chat#tailoring-access-with-any-or-all-settings\" class=\"hash-link\" aria-label=\"Direct link to Tailoring Access with &quot;Any&quot; or &quot;All&quot; Settings\" title=\"Direct link to Tailoring Access with &quot;Any&quot; or &quot;All&quot; Settings\">​</a></h3>\n<p>Push Protocol gives you further control by letting you define how users meet the set criteria. You can choose between:</p>\n<ul>\n<li><strong>'Any' setting:</strong> Here, users only need to meet one of the defined criteria to gain access. This allows for a more inclusive approach.</li>\n<li><strong>'All' setting:</strong> This requires users to satisfy all the defined criteria, creating a more exclusive space.</li>\n</ul>\n<p>Push Chat provides the following settings to configure your gated chat group:</p>\n<p><img loading=\"lazy\" alt=\"Types of communities\" src=\"https://push.org/assets/images/image1-a5b03ff26a0d5e8b18d8003c9f35e2dc.webp\" width=\"2000\" height=\"1125\" class=\"img_ev3q\"></p>\n<table><thead><tr><th>Criteria</th><th>Description</th></tr></thead><tbody><tr><td>ERC20 -Tokens</td><td>User needs to hold XX token to join the group</td></tr><tr><td>ERC721 - NFTs</td><td>User needs to hold XX NFT to join the group.</td></tr><tr><td>Invite</td><td>Both Owners and Admins can invite people to join the group. You can further customize invite privileges by specifying whether both Owner and Admin need to approve invites, or if either of them can do so independently.</td></tr><tr><td>Guild</td><td>Ability to set non-web3 native conditions using <a href=\"https://guild.xyz/\" target=\"_blank\" rel=\"noopener noreferrer\">Guild.xyz</a></td></tr><tr><td>Custom Endpoint</td><td>URL provided for custom usecases.</td></tr></tbody></table>\n<p>So, are you ready to build your dream community?  Let's get started!  We'll walk you through the creation process using our example of : the 'Charcoal Cats🐱' NFT Gated community groupchat.</p>\n<h2 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"time-to-build-our-very-first-group-chat\">Time to build our very first group chat<a href=\"https://push.org/blog/how-to-create-your-community-on-push-chat#time-to-build-our-very-first-group-chat\" class=\"hash-link\" aria-label=\"Direct link to Time to build our very first group chat\" title=\"Direct link to Time to build our very first group chat\">​</a></h2>\n<p><strong>Step 0 : Visit <a href=\"https://app.push.org/welcome?utm_source=google&amp;utm_medium=blog&amp;utm_campaign=create_group_chat\" target=\"_blank\" rel=\"noopener noreferrer\">Push DApp</a> and Connect Wallet:</strong></p>\n<p><img loading=\"lazy\" alt=\"Connect Wallet\" src=\"https://push.org/assets/images/image2-660799d6295ae4dd775422d48b034076.webp\" width=\"2000\" height=\"1125\" class=\"img_ev3q\"></p>\n<p><strong>Step 1 : Unlock your Profile.</strong></p>\n<p>The first step is to verify and unlock your profile on <strong><a href=\"https://app.push.org/chat?utm_source=google&amp;utm_medium=blog&amp;utm_campaign=create_group_chat\" target=\"_blank\" rel=\"noopener noreferrer\">PushChat</a></strong>.\nYou can check the “<strong>Remember me</strong>” option for avoiding the profile unlock process everytime.</p>\n<p><img loading=\"lazy\" alt=\"Unlock Profile\" src=\"https://push.org/assets/images/image3-5af03cdfee282a4bf114c02ac57548cf.webp\" width=\"2000\" height=\"1125\" class=\"img_ev3q\"></p>\n<p>Selecting 'Remember me' will save your Push Profile keys locally on your device.</p>\n<p><strong>Step 2: Click on the ‘+’ button to create a new group</strong></p>\n<p><img loading=\"lazy\" alt=\"Create Group\" src=\"https://push.org/assets/images/image4-4aed6d635a11b27db169a1bf73575425.webp\" width=\"1600\" height=\"900\" class=\"img_ev3q\"></p>\n<p>Click on “New Group” to start creating your group</p>\n<p><strong>Step 3: Create Group Chat Profile</strong></p>\n<p><img loading=\"lazy\" alt=\"Create Profile\" src=\"https://push.org/assets/images/image5-53ebe57395087bb1fa990b5d0a9ae976.webp\" width=\"1600\" height=\"900\" class=\"img_ev3q\"></p>\n<p><strong>Step 4: Specify the Joining Conditions (if any)</strong></p>\n<p>Conditions can be levied on Joining the group as well as for chatting in the group.</p>\n<p><img loading=\"lazy\" alt=\"Add joining and chatting conditions\" src=\"https://push.org/assets/images/image6-27bcf14fa71b9f57e17fae3f237237de.webp\" width=\"1600\" height=\"900\" class=\"img_ev3q\"></p>\n<p><strong>Step 5: Add Participants.</strong></p>\n<p><img loading=\"lazy\" alt=\"Add group participants\" src=\"https://push.org/assets/images/image7-ba5ebd401f1099ff282b0fca96b31569.webp\" width=\"1600\" height=\"900\" class=\"img_ev3q\"></p>\n<p>The address that creates the group chat is the '<strong>Group Owner</strong>' and the '<strong>Group Admin</strong>' by default.</p>\n<p>The owner can delegate 'admin' role to some other trusted participant of choice.</p>\n<p>Initially the owner can choose to add few early known participants and thereafter you can circulate the groupchat link OR joinees can search the chat name in search bar to join the chat.</p>\n<p>Finally, click on <strong>Create Group</strong> to get your own customized group chat up and running for free, with no gas fees!</p>\n<p><strong>Fin-al Step : Time to Chat 💬</strong></p>\n<p>This is how you can swiftly create your community with granular customization possibilities within no time for free!</p>\n<h3 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"start-building-your-community-now--httpsapppushorgchat\">Start building your community now 👉 <a href=\"https://app.push.org/chat?utm_source=google&amp;utm_medium=blog&amp;utm_campaign=create_group_chat\" target=\"_blank\" rel=\"noopener noreferrer\">https://app.push.org/chat</a><a href=\"https://push.org/blog/how-to-create-your-community-on-push-chat#start-building-your-community-now--httpsapppushorgchat\" class=\"hash-link\" aria-label=\"Direct link to start-building-your-community-now--httpsapppushorgchat\" title=\"Direct link to start-building-your-community-now--httpsapppushorgchat\">​</a></h3>\n<p>Have any queries?\nWe’ll be super happy to answer them on our <a href=\"https://discord.com/invite/pushprotocol\" target=\"_blank\" rel=\"noopener noreferrer\">Discord</a></p>",
            "url": "https://push.org/blog/how-to-create-your-community-on-push-chat",
            "title": "How to create your community on Push Chat?",
            "summary": "How to create your community on Push Chat?",
            "date_modified": "2024-07-04T00:00:00.000Z",
            "author": {
                "name": "Push Protocol",
                "url": "https://twitter.com/pushprotocol"
            },
            "tags": [
                "Push Protocol",
                "Web3",
                "Wallets",
                "Push Chat"
            ]
        },
        {
            "id": "https://push.org/blog/how-wallets-use-push-to-become-a-super-app",
            "content_html": "<p><img loading=\"lazy\" alt=\"Cover image of Case Study - How Wallets use Push to become a Super App\" src=\"https://push.org/assets/images/cover-image-61389f60de2ebdb4d8a889a1ae52954c.webp\" width=\"2000\" height=\"1125\" class=\"img_ev3q\"></p>\n<p>In the ever-evolving landscape of Web3, as protocols become more innovative and mature, the need for web3 wallets to act as a bridge for onboarding typical Internet (web2) users into web3 with minimal friction is advancing rapidly.</p>\n<p>Amidst these technical advancements, communication remains a paramount factor in driving this transformation.</p>\n<p>Today, Push Protocol is at the forefront, enabling wallets to enhance their functionality and better serve their users by becoming a <strong>'Super App’</strong>.</p>\n<h2 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"challenges\">Challenges<a href=\"https://push.org/blog/how-wallets-use-push-to-become-a-super-app#challenges\" class=\"hash-link\" aria-label=\"Direct link to Challenges\" title=\"Direct link to Challenges\">​</a></h2>\n<p>According to <a href=\"https://dappradar.com/blog/state-of-the-dapp-industry-q1-2024\" target=\"_blank\" rel=\"noopener noreferrer\">DApp Radar</a>, Q1 2024 saw a remarkable surge in daily active wallet users (dUAW), reaching an average of <strong>7 million</strong> daily active wallets—a <strong>77%</strong> increase compared to the previous year.</p>\n<p>The numbers clearly show that the entry into web3 starts from a wallet. With more than 120 wallet apps, the sheer innovation in onboarding the next Billion users into web3 is surreal.</p>\n<p>Although wallets are expanding their utility from simply being a medium of secure storage and a facilitator of transactions to now, becoming a <em>‘Super Hub’</em> for NFT, DeFi, and app browsing activities, they still lack the ability to consistently relay updates and alerts between the user and the accessed protocol while maintaining a constant, symbiotic and duplex communication relationship.</p>\n<p>In addition, multi-chain wallets serve as a single entry point for users to interact with applications across a variety of supported chains with ease. However, there is no standardized way for these apps to communicate back with users through the same entrance point i.e. your wallet.</p>\n<h2 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"solution\">Solution<a href=\"https://push.org/blog/how-wallets-use-push-to-become-a-super-app#solution\" class=\"hash-link\" aria-label=\"Direct link to Solution\" title=\"Direct link to Solution\">​</a></h2>\n<p><strong>Push helps us solve these challenges.</strong></p>\n<p>With the help of an open - decentralized and secure network supported across multiple chains, Push facilitates any wallet, DApp, service or smart contract to tap into the network and fetch notifications with ease.</p>\n<p>With the motive of forming a universal communication layer of web3, Push Protocol is expanding its support to multiple chains including <strong>Ethereum, Polygon, BSC, Arbitrum, Polygon zkEVM, Cyber and Fuse</strong>.</p>\n<p>To date, Push has sent over <strong>80 Million Notifications</strong> across <strong>230k+ subscribers</strong>.</p>\n<h3 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"journey-from-wallet-to-a-super-app-wallet-from-our-partners\">Journey from Wallet to a Super App Wallet from our Partners:<a href=\"https://push.org/blog/how-wallets-use-push-to-become-a-super-app#journey-from-wallet-to-a-super-app-wallet-from-our-partners\" class=\"hash-link\" aria-label=\"Direct link to Journey from Wallet to a Super App Wallet from our Partners:\" title=\"Direct link to Journey from Wallet to a Super App Wallet from our Partners:\">​</a></h3>\n<p>Lets take a thorough look at how our partner wallets are adopting Push to become a Super App.</p>\n<p><img loading=\"lazy\" alt=\"Push enables interoperable communications\" src=\"https://push.org/assets/images/image1-773c84f6611fb60de497f032b88e6813.webp\" width=\"2226\" height=\"1248\" class=\"img_ev3q\"></p>\n<ol>\n<li>Unstoppable Lite Wallet</li>\n<li>Push Metamask Snap</li>\n<li>Shapeshift Governance Wallet</li>\n<li>Verso Wallet</li>\n</ol>\n<h3 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"1unstoppable-domains-lite-wallet\">1.Unstoppable Domains Lite Wallet<a href=\"https://push.org/blog/how-wallets-use-push-to-become-a-super-app#1unstoppable-domains-lite-wallet\" class=\"hash-link\" aria-label=\"Direct link to 1.Unstoppable Domains Lite Wallet\" title=\"Direct link to 1.Unstoppable Domains Lite Wallet\">​</a></h3>\n<p>Unstoppable Domain Wallets are cryptocurrency addresses used to store users’ web3 domains in addition to tokens and digital collectables.\nAn Unstoppable Wallet with a valid domain acts as a web3 social identifier for enabling domain-to-domain in-app messaging!</p>\n<p><strong>Push x UD: Empowering wallet-to-wallet messaging with ease!</strong></p>\n<img src=\"https://push.org/assets/images/image3-d7830c6dc6f987f1db382732689dafa6.webp\" alt=\"Unstoppable Domains Lite Wallet\" width=\"353\" height=\"100%\" class=\"SharedStyling__Image-sc-1enui31-9 efFBTI\">\n<p>Push is proud to enable the next frontier of inter-domain communication by powering notifications and messaging support for over <strong>3.58 million</strong> UD users across more than <strong>300 group chats</strong>.</p>\n<p><strong>What type of users primarily use Unstoppable Lite Wallet?</strong></p>\n<p>The primary user of Unstoppable Lite Wallet are people with domains. The self-custody wallet is designed specifically for domainers, so they can manage and interact with their domains directly from the wallet in addition to traditional crypto tokens. This is a use case that has not been addressed by other wallets.</p>\n<p><strong>How does Unstopppable Lite Wallet ensure smooth UX and Communication?</strong></p>\n<p>Many of the Unstopppable Lite Wallet users are new to web3, so an intuitive and easy to use experience are essential. Inline education and clear messages help new users understand what can be a difficult learning curve.</p>\n<p><strong>How does Push fit into the overall strategic goals of Unstoppable Lite Wallet?</strong></p>\n<p>Messaging is built directly into Unstoppable Lite Wallet. Push Protocol enables token gated group chat. Messaging is built directly into Unstoppable Lite Wallet.</p>\n<p>As Push Protocol enables wallet to wallet token gated group chatting, depending on domains and badges, users have access to various conditionally gated group chats where they can engage with others.</p>\n<p><strong>Overcoming seed phrase scares using MPC</strong></p>\n<p>The unstoppable lite wallet features advanced multi-party computation (MPC) technology provided by Fireblocks to improve safety for the self-custody wallet. Users are able to manage their wallet using an email address and password, instead of worrying about seed phrases. There is also a way to recover the wallet if the user forgets their password, adding another layer of safety.</p>\n<h3 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"2metamask-snap\">2.Metamask Snap<a href=\"https://push.org/blog/how-wallets-use-push-to-become-a-super-app#2metamask-snap\" class=\"hash-link\" aria-label=\"Direct link to 2.Metamask Snap\" title=\"Direct link to 2.Metamask Snap\">​</a></h3>\n<p>MetaMask Snaps are independent feature plugins developed by third-party developers to enhance wallet experiences in areas such as communication, interoperability, security, account management, and more, for various web3 protocols and applications.</p>\n<p>The Push MetaMask Snap allows users to receive real-time notification alerts from their favourite Web3 applications directly within their MetaMask wallet.</p>\n<p><strong>Push X Metamask: Unlocking a Super App experience</strong></p>\n<img src=\"https://push.org/assets/images/image2-5d9ae0c85a4ebb07d13db37c10eb5910.webp\" alt=\"Push Metamask Snap\" width=\"353\" height=\"100%\" class=\"SharedStyling__Image-sc-1enui31-9 efFBTI\">\n<p>Metamask being a widely popular wallet and often the first choice for many new web3 users, was crucial to integrate with Push’s capabilities. The launch of the snap functionality provided an opportunity to offer a communication experience akin to web2 applications.</p>\n<p>The <a href=\"https://snaps.metamask.io/snap/npm/pushprotocol/snap/?utm_source=google&amp;utm_medium=blog&amp;utm_campaign=case_study_supper_app\" target=\"_blank\" rel=\"noopener noreferrer\">Push Metamask Snap</a> was launched in September 2023 and continues to see steady growth with over <strong>1.7k downloads.</strong></p>\n<p>The Push  Snap is positioned at a crucial intersection in a user’s DApp interaction journey through their wallet.</p>\n<p>Instead of frequently visiting a DApp to check the status of domain expiry or loan health indexes, Push Snap eliminates these kinds of unproductive user travels.</p>\n<p>Using Push Snap, every mission-critical alert is delivered directly to the wallet as a Push Notification, providing an experience similar to a typical Web2 mobile app.</p>\n<h3 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"3shapeshift-wallet\">3.ShapeShift Wallet<a href=\"https://push.org/blog/how-wallets-use-push-to-become-a-super-app#3shapeshift-wallet\" class=\"hash-link\" aria-label=\"Direct link to 3.ShapeShift Wallet\" title=\"Direct link to 3.ShapeShift Wallet\">​</a></h3>\n<p><a href=\"https://app.shapeshift.com/\" target=\"_blank\" rel=\"noopener noreferrer\">Shapeshift</a> is an open-source multi-chain platform, offering various DeFi services. The Shapeshift wallet is a community-governed, private, non-custodial wallet that supports multiple chains and assists users in managing their portfolio and DeFi positions.</p>\n<p><strong>Push x ShapeShift  Wallet : Powering Communication</strong></p>\n<img src=\"https://push.org/assets/images/image4-f8a14125752aa82d79fb9a87197d767f.webp\" alt=\"Shapeshift Wallet\" width=\"353\" height=\"100%\" class=\"SharedStyling__Image-sc-1enui31-9 efFBTI\">\n<p>Push powers the communication middleware for enabling Push notifications for product updates, governance updates and token transfers.</p>\n<p>Push powers the necessary middleware and infrastructure for <a href=\"https://www.wherever.im/\" target=\"_blank\" rel=\"noopener noreferrer\">Wherever</a>, a third-party communications service to show notifications in wallet and platform frontend as well as share with the user’s telegram and email.</p>\n<p>On a parallel front, As users continue to become mature and conscious about on-chain security, the demand for hardware wallets will be ever-increasing. Push can also be integrated with companion Apps of Hardware Wallets like <a href=\"https://www.keepkey.com/\" target=\"_blank\" rel=\"noopener noreferrer\">KeepKay</a>, ensuring user’s with mission critical application updates independant of any wallet type.</p>\n<p>ShapeShift has remained the second most subscribed channel for over a year, with a total subscriber count of more than <strong>28,000</strong> with a growth of more than <strong>306%</strong> as compared to previous year.</p>\n<p><img loading=\"lazy\" alt=\"Shapeshift subscriber statistics\" src=\"https://push.org/assets/images/image5-eb9e1bf69855bc58ae4f00c2e2b7f59e.webp\" width=\"1587\" height=\"783\" class=\"img_ev3q\"></p>\n<h3 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"4verso-wallet\">4.Verso Wallet:<a href=\"https://push.org/blog/how-wallets-use-push-to-become-a-super-app#4verso-wallet\" class=\"hash-link\" aria-label=\"Direct link to 4.Verso Wallet:\" title=\"Direct link to 4.Verso Wallet:\">​</a></h3>\n<p><a href=\"https://get-verso.com/\" target=\"_blank\" rel=\"noopener noreferrer\">Verso Wallet</a> is a non-custodial multi-chain wallet for gaming, NFT,defi, meme coins and cash backs.</p>\n<p>Verso bridges Web2 audiences to Web3 by enabling in-wallet crypto purchases using credit cards or bank transfers. Verso also facilitates the purchase of gift cards with crypto and provides crypto reward cashback.</p>\n<p><strong>Push x Verso Wallet : Manage all your notifications in one place</strong></p>\n<p>The Push x Verso integration enables users to search for and opt-into any channel and receive notifications directly into the wallet. Ensuring the fact that the communications across all subscribed channels can be managed and organized easily in one place with ease!</p>\n<h3 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"push-is-the-missing-piece-for-building-the-next-super-wallet-app\">Push is the missing piece for building the next Super Wallet App🧩:<a href=\"https://push.org/blog/how-wallets-use-push-to-become-a-super-app#push-is-the-missing-piece-for-building-the-next-super-wallet-app\" class=\"hash-link\" aria-label=\"Direct link to Push is the missing piece for building the next Super Wallet App🧩:\" title=\"Direct link to Push is the missing piece for building the next Super Wallet App🧩:\">​</a></h3>\n<p><img loading=\"lazy\" alt=\"Push is the missing piece of web3 wallets\" src=\"https://push.org/assets/images/image6-860c53b95f95e25190d5deb0a270a422.webp\" width=\"1200\" height=\"1200\" class=\"img_ev3q\"></p>\n<p>As Web3 continues to mature, user experience will be the key differentiator for wallets vying to become the go-to <strong>\"Super App”</strong>. And Push is determined to onboard a Billion Users to web3 by filling in the void between current and expected communication experiences.</p>\n<p>With <a href=\"https://push.org/blog/explaining-push-nodes/\" target=\"_blank\" rel=\"noopener noreferrer\">Push Nodes</a> launching soon, the Protocol will take its biggest leap in its journey to become a completely decentralized communication layer of web3.</p>",
            "url": "https://push.org/blog/how-wallets-use-push-to-become-a-super-app",
            "title": "Case Study: How Wallets Use Push To Become a Super App?",
            "summary": "How wallets use Push to become a Super App",
            "date_modified": "2024-07-01T00:00:00.000Z",
            "author": {
                "name": "Push Protocol",
                "url": "https://twitter.com/pushprotocol"
            },
            "tags": [
                "Push Protocol",
                "Web3",
                "Wallets",
                "Adoption"
            ]
        }
    ]
}